#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_BigBush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_BigBush.Apollo_BigBush_C
// 0x0078 (0x0DC0 - 0x0D48)
class AApollo_BigBush_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UShadowProxyMeshComponent_C*            ShadowProxyMeshComponent;                          // 0x0D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortCollisionResponseSwapperComponent* FortCollisionResponseSwapper;                      // 0x0D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       OverlapSphere;                                     // 0x0D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_CornField_GC;                                   // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldWobble;                                      // 0x0D70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D71[0x3];                                      // 0x0D71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PlayerVelocity;                                    // 0x0D74(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 WinterDecoEvent;                                   // 0x0D88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             Winter_Mesh;                                       // 0x0D98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_Apollo_BigBush(int32 EntryPoint);
	void MaterialWobble(class AActor* Player);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_BigBush_C">();
	}
	static class AApollo_BigBush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_BigBush_C>();
	}
};
static_assert(alignof(AApollo_BigBush_C) == 0x000008, "Wrong alignment on AApollo_BigBush_C");
static_assert(sizeof(AApollo_BigBush_C) == 0x000DC0, "Wrong size on AApollo_BigBush_C");
static_assert(offsetof(AApollo_BigBush_C, UberGraphFrame) == 0x000D48, "Member 'AApollo_BigBush_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, ShadowProxyMeshComponent) == 0x000D50, "Member 'AApollo_BigBush_C::ShadowProxyMeshComponent' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, FortCollisionResponseSwapper) == 0x000D58, "Member 'AApollo_BigBush_C::FortCollisionResponseSwapper' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, OverlapSphere) == 0x000D60, "Member 'AApollo_BigBush_C::OverlapSphere' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, GE_CornField_GC) == 0x000D68, "Member 'AApollo_BigBush_C::GE_CornField_GC' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, ShouldWobble) == 0x000D70, "Member 'AApollo_BigBush_C::ShouldWobble' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, PlayerVelocity) == 0x000D74, "Member 'AApollo_BigBush_C::PlayerVelocity' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, Mid) == 0x000D80, "Member 'AApollo_BigBush_C::Mid' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, WinterDecoEvent) == 0x000D88, "Member 'AApollo_BigBush_C::WinterDecoEvent' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, Winter_Mesh) == 0x000D98, "Member 'AApollo_BigBush_C::Winter_Mesh' has a wrong offset!");

}

