#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Artemis_PhysicsTreeStump_01

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Artemis_PhysicsTreeStump_01.Artemis_PhysicsTreeStump_01_C.ExecuteUbergraph_Artemis_PhysicsTreeStump_01
// 0x0110 (0x0110 - 0x0000)
struct Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0008(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0034(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00E0(0x0018)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendPlayerKilledStumpStatEvent_bQuestCompleted; // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01) == 0x000008, "Wrong alignment on Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01");
static_assert(sizeof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01) == 0x000110, "Wrong size on Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, EntryPoint) == 0x000000, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, K2Node_Event_Damage) == 0x000004, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, K2Node_Event_DamageTags) == 0x000008, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, K2Node_Event_Momentum) == 0x000028, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, K2Node_Event_HitInfo) == 0x000034, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, K2Node_Event_InstigatedBy) == 0x0000D0, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, K2Node_Event_DamageCauser) == 0x0000D8, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, K2Node_Event_EffectContext) == 0x0000E0, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, CallFunc_GetOwner_ReturnValue) == 0x0000F8, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000100, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01, CallFunc_SendPlayerKilledStumpStatEvent_bQuestCompleted) == 0x000109, "Member 'Artemis_PhysicsTreeStump_01_C_ExecuteUbergraph_Artemis_PhysicsTreeStump_01::CallFunc_SendPlayerKilledStumpStatEvent_bQuestCompleted' has a wrong offset!");

// Function Artemis_PhysicsTreeStump_01.Artemis_PhysicsTreeStump_01_C.OnDeathServer
// 0x00F8 (0x00F8 - 0x0000)
struct Artemis_PhysicsTreeStump_01_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00E0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Artemis_PhysicsTreeStump_01_C_OnDeathServer) == 0x000008, "Wrong alignment on Artemis_PhysicsTreeStump_01_C_OnDeathServer");
static_assert(sizeof(Artemis_PhysicsTreeStump_01_C_OnDeathServer) == 0x0000F8, "Wrong size on Artemis_PhysicsTreeStump_01_C_OnDeathServer");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_OnDeathServer, Damage) == 0x000000, "Member 'Artemis_PhysicsTreeStump_01_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_OnDeathServer, DamageTags) == 0x000008, "Member 'Artemis_PhysicsTreeStump_01_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_OnDeathServer, Momentum) == 0x000028, "Member 'Artemis_PhysicsTreeStump_01_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_OnDeathServer, HitInfo) == 0x000034, "Member 'Artemis_PhysicsTreeStump_01_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_OnDeathServer, InstigatedBy) == 0x0000D0, "Member 'Artemis_PhysicsTreeStump_01_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_OnDeathServer, DamageCauser) == 0x0000D8, "Member 'Artemis_PhysicsTreeStump_01_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_OnDeathServer, EffectContext) == 0x0000E0, "Member 'Artemis_PhysicsTreeStump_01_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function Artemis_PhysicsTreeStump_01.Artemis_PhysicsTreeStump_01_C.SendPlayerKilledStumpStatEvent
// 0x0050 (0x0050 - 0x0000)
struct Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent final
{
public:
	class AFortPlayerPawn*                        Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bQuestCompleted;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  StatEventDestroyedTreeTrump;                       // 0x0010(0x0020)(Edit, BlueprintVisible)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent) == 0x000008, "Wrong alignment on Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent");
static_assert(sizeof(Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent) == 0x000050, "Wrong size on Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent, Player) == 0x000000, "Member 'Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent::Player' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent, bQuestCompleted) == 0x000008, "Member 'Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent::bQuestCompleted' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent, StatEventDestroyedTreeTrump) == 0x000010, "Member 'Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent::StatEventDestroyedTreeTrump' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000030, "Member 'Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent, CallFunc_GetQuestManager_ReturnValue) == 0x000040, "Member 'Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000049, "Member 'Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x00004A, "Member 'Artemis_PhysicsTreeStump_01_C_SendPlayerKilledStumpStatEvent::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");

}

