#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Artemis_DarkPine_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Artemis_DarkPine_01.Artemis_DarkPine_01_C.Reset Scale
// 0x0018 (0x0018 - 0x0000)
struct Artemis_DarkPine_01_C_Reset_Scale final
{
public:
	float                                         CallFunc_BreakVector2D_X;                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_DarkPine_01_C_Reset_Scale) == 0x000004, "Wrong alignment on Artemis_DarkPine_01_C_Reset_Scale");
static_assert(sizeof(Artemis_DarkPine_01_C_Reset_Scale) == 0x000018, "Wrong size on Artemis_DarkPine_01_C_Reset_Scale");
static_assert(offsetof(Artemis_DarkPine_01_C_Reset_Scale, CallFunc_BreakVector2D_X) == 0x000000, "Member 'Artemis_DarkPine_01_C_Reset_Scale::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Artemis_DarkPine_01_C_Reset_Scale, CallFunc_BreakVector2D_Y) == 0x000004, "Member 'Artemis_DarkPine_01_C_Reset_Scale::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Artemis_DarkPine_01_C_Reset_Scale, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'Artemis_DarkPine_01_C_Reset_Scale::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_DarkPine_01_C_Reset_Scale, CallFunc_MakeVector_ReturnValue) == 0x00000C, "Member 'Artemis_DarkPine_01_C_Reset_Scale::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

