#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Artemis_PhysicsTree_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Parent_Tree_Apollo_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Artemis_PhysicsTree_01.Artemis_PhysicsTree_01_C
// 0x0258 (0x1000 - 0x0DA8)
class AArtemis_PhysicsTree_01_C final : public AParent_Tree_Apollo_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Artemis_PhysicsTree_01_C;           // 0x0DA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                LogHalfLength;                                     // 0x0DB0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StumpOffset;                                       // 0x0DBC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  FallAwayDamageTagList;                             // 0x0DC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         FallingImpulseForce;                               // 0x0DE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlopeBlend;                                        // 0x0DEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReplacementDelay;                                  // 0x0DF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ReplacementScaleRangeMap;                          // 0x0DF4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FallTargetingDistance;                             // 0x0DFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RandomFallDirection;                               // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Tree_Feller;                                       // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FallVector;                                        // 0x0E10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowFellingDebug;                                  // 0x0E18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E19[0x7];                                      // 0x0E19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LogPhysicsObject;                                  // 0x0E20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         FellingAutoTargetChance;                           // 0x0E28(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         FellingImpulseMagnitude;                           // 0x0E50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         FellingImpulseDisableTime;                         // 0x0E78(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PhysicsTreesEnabled;                               // 0x0EA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_EC8[0x8];                                      // 0x0EC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ParentActorTransform;                              // 0x0ED0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  Additional_Source_Tags;                            // 0x0F00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 DisabledActorReplacementClass;                     // 0x0F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ReplacementDelayRange;                             // 0x0F28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         PhysicsLogsEnabled;                                // 0x0F30(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                FallVector_FX;                                     // 0x0F58(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             TreeHitInfo;                                       // 0x0F64(0x009C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)

public:
	void ExecuteUbergraph_Artemis_PhysicsTree_01(int32 EntryPoint);
	void GetTreesEnabled(bool* Enabled);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnRep_FallVector_FX();
	void ReceiveBeginPlay();
	void Reenable_Impulse_via_damage();
	void SendFallenTreeStatEvent(class AActor* DamageCauser, bool* bWasEventSent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Artemis_PhysicsTree_01_C">();
	}
	static class AArtemis_PhysicsTree_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArtemis_PhysicsTree_01_C>();
	}
};
static_assert(alignof(AArtemis_PhysicsTree_01_C) == 0x000010, "Wrong alignment on AArtemis_PhysicsTree_01_C");
static_assert(sizeof(AArtemis_PhysicsTree_01_C) == 0x001000, "Wrong size on AArtemis_PhysicsTree_01_C");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, UberGraphFrame_Artemis_PhysicsTree_01_C) == 0x000DA8, "Member 'AArtemis_PhysicsTree_01_C::UberGraphFrame_Artemis_PhysicsTree_01_C' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, LogHalfLength) == 0x000DB0, "Member 'AArtemis_PhysicsTree_01_C::LogHalfLength' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, StumpOffset) == 0x000DBC, "Member 'AArtemis_PhysicsTree_01_C::StumpOffset' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, FallAwayDamageTagList) == 0x000DC8, "Member 'AArtemis_PhysicsTree_01_C::FallAwayDamageTagList' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, FallingImpulseForce) == 0x000DE8, "Member 'AArtemis_PhysicsTree_01_C::FallingImpulseForce' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, SlopeBlend) == 0x000DEC, "Member 'AArtemis_PhysicsTree_01_C::SlopeBlend' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, ReplacementDelay) == 0x000DF0, "Member 'AArtemis_PhysicsTree_01_C::ReplacementDelay' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, ReplacementScaleRangeMap) == 0x000DF4, "Member 'AArtemis_PhysicsTree_01_C::ReplacementScaleRangeMap' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, FallTargetingDistance) == 0x000DFC, "Member 'AArtemis_PhysicsTree_01_C::FallTargetingDistance' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, RandomFallDirection) == 0x000E00, "Member 'AArtemis_PhysicsTree_01_C::RandomFallDirection' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, Tree_Feller) == 0x000E08, "Member 'AArtemis_PhysicsTree_01_C::Tree_Feller' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, FallVector) == 0x000E10, "Member 'AArtemis_PhysicsTree_01_C::FallVector' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, ShowFellingDebug) == 0x000E18, "Member 'AArtemis_PhysicsTree_01_C::ShowFellingDebug' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, LogPhysicsObject) == 0x000E20, "Member 'AArtemis_PhysicsTree_01_C::LogPhysicsObject' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, FellingAutoTargetChance) == 0x000E28, "Member 'AArtemis_PhysicsTree_01_C::FellingAutoTargetChance' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, FellingImpulseMagnitude) == 0x000E50, "Member 'AArtemis_PhysicsTree_01_C::FellingImpulseMagnitude' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, FellingImpulseDisableTime) == 0x000E78, "Member 'AArtemis_PhysicsTree_01_C::FellingImpulseDisableTime' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, PhysicsTreesEnabled) == 0x000EA0, "Member 'AArtemis_PhysicsTree_01_C::PhysicsTreesEnabled' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, ParentActorTransform) == 0x000ED0, "Member 'AArtemis_PhysicsTree_01_C::ParentActorTransform' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, Additional_Source_Tags) == 0x000F00, "Member 'AArtemis_PhysicsTree_01_C::Additional_Source_Tags' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, DisabledActorReplacementClass) == 0x000F20, "Member 'AArtemis_PhysicsTree_01_C::DisabledActorReplacementClass' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, ReplacementDelayRange) == 0x000F28, "Member 'AArtemis_PhysicsTree_01_C::ReplacementDelayRange' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, PhysicsLogsEnabled) == 0x000F30, "Member 'AArtemis_PhysicsTree_01_C::PhysicsLogsEnabled' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, FallVector_FX) == 0x000F58, "Member 'AArtemis_PhysicsTree_01_C::FallVector_FX' has a wrong offset!");
static_assert(offsetof(AArtemis_PhysicsTree_01_C, TreeHitInfo) == 0x000F64, "Member 'AArtemis_PhysicsTree_01_C::TreeHitInfo' has a wrong offset!");

}

