#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AshtonIndigoLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AshtonIndigoLayerAnimBP.AshtonIndigoLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x02D7 (0x02D8 - 0x0001)
struct AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_416;                                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_417;                                  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_418;                                  // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_419;                                  // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_420;                                  // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_421;                                  // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_422;                                  // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_423;                                  // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_424;                                  // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_425;                                  // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_426;                                  // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_427;                                  // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_428;                                  // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_429;                                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_430;                                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_431;                                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_432;                                  // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_433;                                  // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_434;                                  // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_435;                                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_436;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_437;                                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_438;                                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_439;                                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_440;                                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_441;                                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_442;                                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_443;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_444;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_445;                                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_446;                                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_447;                                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_448;                                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_449;                                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_450;                                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_451;                                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_452;                                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_453;                                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_454;                                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_455;                                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_456;                                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_457;                                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_458;                                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_459;                                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_460;                                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_461;                                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_462;                                  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_463;                                  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_464;                                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_465;                                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_466;                                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_467;                                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendProfile*                          ObjectProperty_468;                                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            ObjectProperty_469;                                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             EnumProperty_470;                                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      EnumProperty_471;                                  // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_472;                                 // 0x01B8(0x0010)()
	float                                         FloatProperty_473;                                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          StructProperty_474;                                // 0x01CC(0x002C)(NoDestructor)
	float                                         FloatProperty_475;                                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_476;                                // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_477;                                  // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_478;                                  // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_479;                                  // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_480;                                // 0x0210(0x0020)(NoDestructor)
	class FName                                   NameProperty_481;                                  // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_482;                                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0240(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02C0(0x0018)()
};
static_assert(alignof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x0002D8, "Wrong size on AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_416) == 0x000004, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_416' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_417) == 0x00000C, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_417' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_418) == 0x000014, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_418' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_419) == 0x00001C, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_419' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_420) == 0x000024, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_420' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_421) == 0x00002C, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_421' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_422) == 0x000034, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_422' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_423) == 0x00003C, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_423' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_424) == 0x000044, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_424' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_425) == 0x00004C, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_425' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_426) == 0x000054, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_426' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_427) == 0x00005C, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_427' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_428) == 0x000064, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_428' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_429) == 0x000070, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_429' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_430) == 0x000078, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_430' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_431) == 0x000079, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_431' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_432) == 0x00007C, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_432' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_433) == 0x000084, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_433' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_434) == 0x00008C, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_434' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_435) == 0x000098, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_435' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_436) == 0x0000A0, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_436' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_437) == 0x0000A8, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_437' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_438) == 0x0000B0, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_438' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_439) == 0x0000B8, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_439' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_440) == 0x0000C0, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_440' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_441) == 0x0000C8, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_441' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_442) == 0x0000D0, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_442' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_443) == 0x0000D8, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_443' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_444) == 0x0000E0, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_444' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_445) == 0x0000E8, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_445' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_446) == 0x0000F0, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_446' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_447) == 0x0000F8, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_447' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_448) == 0x000100, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_448' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_449) == 0x000108, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_449' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_450) == 0x000110, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_450' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_451) == 0x000118, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_451' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_452) == 0x000120, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_452' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_453) == 0x000128, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_453' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_454) == 0x000130, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_454' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_455) == 0x000138, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_455' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_456) == 0x000140, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_456' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_457) == 0x000148, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_457' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_458) == 0x000150, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_458' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_459) == 0x000158, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_459' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_460) == 0x000160, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_460' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_461) == 0x000168, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_461' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_462) == 0x000170, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_462' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_463) == 0x000178, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_463' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_464) == 0x000180, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_464' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_465) == 0x000188, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_465' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_466) == 0x000190, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_466' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_467) == 0x000198, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_467' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_468) == 0x0001A0, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_468' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_469) == 0x0001A8, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_469' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_470) == 0x0001B0, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_470' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_471) == 0x0001B1, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_471' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_472) == 0x0001B8, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_472' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_473) == 0x0001C8, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_473' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_474) == 0x0001CC, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_474' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_475) == 0x0001F8, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_475' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_476) == 0x000200, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_476' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_477) == 0x000208, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_477' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_478) == 0x000209, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_478' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_479) == 0x00020A, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_479' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_480) == 0x000210, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_480' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_481) == 0x000230, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_481' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_482) == 0x000238, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_482' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000240, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0002C0, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AshtonIndigoLayerAnimBP.AshtonIndigoLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x001B (0x001C - 0x0001)
struct AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_0;                                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_1;                                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_2;                                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_3;                                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_4;                                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_5;                                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_6;                                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_7;                                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_8;                                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x00001C, "Wrong size on AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty) == 0x000004, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty' has a wrong offset!");
static_assert(offsetof(AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedMutableData, BoolProperty_0) == 0x000008, "Member 'AshtonIndigoLayerAnimBP::FAnimBlueprintGeneratedMutableData::BoolProperty_0' has a wrong offset!");
