#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDuelOverlay

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaDuelOverlay.AthenaDuelOverlay_C.OnSetupForActivation
// 0x0054 (0x0054 - 0x0000)
struct AthenaDuelOverlay_C_OnSetupForActivation final
{
public:
	EDuelState                                    DuelState;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortColorPalette                      RarityColorPalette;                                // 0x0004(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AthenaDuelOverlay_C_OnSetupForActivation) == 0x000004, "Wrong alignment on AthenaDuelOverlay_C_OnSetupForActivation");
static_assert(sizeof(AthenaDuelOverlay_C_OnSetupForActivation) == 0x000054, "Wrong size on AthenaDuelOverlay_C_OnSetupForActivation");
static_assert(offsetof(AthenaDuelOverlay_C_OnSetupForActivation, DuelState) == 0x000000, "Member 'AthenaDuelOverlay_C_OnSetupForActivation::DuelState' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_OnSetupForActivation, RarityColorPalette) == 0x000004, "Member 'AthenaDuelOverlay_C_OnSetupForActivation::RarityColorPalette' has a wrong offset!");

// Function AthenaDuelOverlay.AthenaDuelOverlay_C.ExecuteUbergraph_AthenaDuelOverlay
// 0x0090 (0x0090 - 0x0000)
struct AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDuelState                                    Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDuelState                                    K2Node_Event_DuelState;                            // 0x0006(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortColorPalette                      K2Node_Event_RarityColorPalette;                   // 0x0008(0x0050)(ConstParm, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopAnimationByName_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDuelState                                    Temp_byte_Variable_4;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay) == 0x000008, "Wrong alignment on AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay");
static_assert(sizeof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay) == 0x000090, "Wrong size on AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, EntryPoint) == 0x000000, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, Temp_byte_Variable) == 0x000004, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, Temp_byte_Variable_1) == 0x000005, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, K2Node_Event_DuelState) == 0x000006, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::K2Node_Event_DuelState' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, K2Node_Event_RarityColorPalette) == 0x000008, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::K2Node_Event_RarityColorPalette' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, Temp_byte_Variable_2) == 0x000058, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, K2Node_Select_Default) == 0x000060, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, CallFunc_PlayAnimationByName_ReturnValue) == 0x000068, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, CallFunc_StopAnimationByName_ReturnValue) == 0x000069, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::CallFunc_StopAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, CallFunc_IsValid_ReturnValue) == 0x00006A, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, Temp_byte_Variable_3) == 0x000078, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000080, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, Temp_byte_Variable_4) == 0x000088, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay, K2Node_Select_Default_1) == 0x000089, "Member 'AthenaDuelOverlay_C_ExecuteUbergraph_AthenaDuelOverlay::K2Node_Select_Default_1' has a wrong offset!");

}

