#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaHUDMenu.AthenaHUDMenu_C
// 0x0020 (0x0350 - 0x0330)
class UAthenaHUDMenu_C final : public UAthenaHUDMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaServerShutdownWidget_C*          AthenaServerShutdownWidget;                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ClickCatcher;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UContentOnDemand_C*                     ContentOnDemand;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaHUDMenu(int32 EntryPoint);
	void Construct();
	void BP_OnPostGameStarted();
	void BP_OnPostGameEnded();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaHUDMenu_C">();
	}
	static class UAthenaHUDMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDMenu_C>();
	}
};
static_assert(alignof(UAthenaHUDMenu_C) == 0x000008, "Wrong alignment on UAthenaHUDMenu_C");
static_assert(sizeof(UAthenaHUDMenu_C) == 0x000350, "Wrong size on UAthenaHUDMenu_C");
static_assert(offsetof(UAthenaHUDMenu_C, UberGraphFrame) == 0x000330, "Member 'UAthenaHUDMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaHUDMenu_C, AthenaServerShutdownWidget) == 0x000338, "Member 'UAthenaHUDMenu_C::AthenaServerShutdownWidget' has a wrong offset!");
static_assert(offsetof(UAthenaHUDMenu_C, ClickCatcher) == 0x000340, "Member 'UAthenaHUDMenu_C::ClickCatcher' has a wrong offset!");
static_assert(offsetof(UAthenaHUDMenu_C, ContentOnDemand) == 0x000348, "Member 'UAthenaHUDMenu_C::ContentOnDemand' has a wrong offset!");

}

