#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpecialEventChallengeEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSpecialEventChallengeEntry.AthenaSpecialEventChallengeEntry_C
// 0x0088 (0x0370 - 0x02E8)
class UAthenaSpecialEventChallengeEntry_C final : public UAthenaSpecialEventChallengeEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewQuest;                                          // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         BountyContent;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_IconType;                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_48;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayerPortrait;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ThreatGlow;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ThreatMeter;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Timer;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SocialIcon;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_UrgentIcon;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separator;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           BountyHunterTag;                                   // 0x0350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EPlayerBountyThreatLevel                      Bounty_Threat_Level;                               // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            DefaultTint;                                       // 0x035C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void StyleLastElement(bool isLast);
	void Play_Threat_Audio();
	void OnUpdateBountyThreatLevel(EPlayerBountyThreatLevel NewPlayerBountyThreatLevel);
	void OnLoaded_CF580B9642CB35C0D01098B54EFEBF2D(class UObject* Loaded);
	void OnEntrySetup(const struct FUrgentQuestData& UrgentQuestData, bool bUrgentQuestRecentlyStarted);
	void OnBountyThreatInformationVisibilityChange(ESlateVisibility NewVisibilty);
	void HandleDefaultCase(const struct FLinearColor& inAlertIconBorderColor);
	void ExecuteUbergraph_AthenaSpecialEventChallengeEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSpecialEventChallengeEntry_C">();
	}
	static class UAthenaSpecialEventChallengeEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpecialEventChallengeEntry_C>();
	}
};
static_assert(alignof(UAthenaSpecialEventChallengeEntry_C) == 0x000008, "Wrong alignment on UAthenaSpecialEventChallengeEntry_C");
static_assert(sizeof(UAthenaSpecialEventChallengeEntry_C) == 0x000370, "Wrong size on UAthenaSpecialEventChallengeEntry_C");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, UberGraphFrame) == 0x0002E8, "Member 'UAthenaSpecialEventChallengeEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, NewQuest) == 0x0002F0, "Member 'UAthenaSpecialEventChallengeEntry_C::NewQuest' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, BountyContent) == 0x0002F8, "Member 'UAthenaSpecialEventChallengeEntry_C::BountyContent' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, CommonWidgetSwitcher_IconType) == 0x000300, "Member 'UAthenaSpecialEventChallengeEntry_C::CommonWidgetSwitcher_IconType' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Image) == 0x000308, "Member 'UAthenaSpecialEventChallengeEntry_C::Image' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Image_48) == 0x000310, "Member 'UAthenaSpecialEventChallengeEntry_C::Image_48' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Image_PlayerPortrait) == 0x000318, "Member 'UAthenaSpecialEventChallengeEntry_C::Image_PlayerPortrait' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Image_ThreatGlow) == 0x000320, "Member 'UAthenaSpecialEventChallengeEntry_C::Image_ThreatGlow' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Image_ThreatMeter) == 0x000328, "Member 'UAthenaSpecialEventChallengeEntry_C::Image_ThreatMeter' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Image_Timer) == 0x000330, "Member 'UAthenaSpecialEventChallengeEntry_C::Image_Timer' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Overlay_SocialIcon) == 0x000338, "Member 'UAthenaSpecialEventChallengeEntry_C::Overlay_SocialIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Overlay_UrgentIcon) == 0x000340, "Member 'UAthenaSpecialEventChallengeEntry_C::Overlay_UrgentIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Separator) == 0x000348, "Member 'UAthenaSpecialEventChallengeEntry_C::Separator' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, BountyHunterTag) == 0x000350, "Member 'UAthenaSpecialEventChallengeEntry_C::BountyHunterTag' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Bounty_Threat_Level) == 0x000358, "Member 'UAthenaSpecialEventChallengeEntry_C::Bounty_Threat_Level' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, DefaultTint) == 0x00035C, "Member 'UAthenaSpecialEventChallengeEntry_C::DefaultTint' has a wrong offset!");

}

