#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDBoundActionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaHUDBoundActionButton.AthenaHUDBoundActionButton_C
// 0x0030 (0x0F20 - 0x0EF0)
class UAthenaHUDBoundActionButton_C final : public UFortBoundActionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0EF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                ContentBorder;                                     // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              InputActionIconScale;                              // 0x0F00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSubclassOf<class UCommonButtonStyle>         MobileButtonStyle;                                 // 0x0F08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonButtonStyle>         PCandConsoleButtonStyle;                           // 0x0F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void UpdateInputActionIconSize();
	void ExecuteUbergraph_AthenaHUDBoundActionButton(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaHUDBoundActionButton_C">();
	}
	static class UAthenaHUDBoundActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDBoundActionButton_C>();
	}
};
static_assert(alignof(UAthenaHUDBoundActionButton_C) == 0x000010, "Wrong alignment on UAthenaHUDBoundActionButton_C");
static_assert(sizeof(UAthenaHUDBoundActionButton_C) == 0x000F20, "Wrong size on UAthenaHUDBoundActionButton_C");
static_assert(offsetof(UAthenaHUDBoundActionButton_C, UberGraphFrame) == 0x000EF0, "Member 'UAthenaHUDBoundActionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaHUDBoundActionButton_C, ContentBorder) == 0x000EF8, "Member 'UAthenaHUDBoundActionButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UAthenaHUDBoundActionButton_C, InputActionIconScale) == 0x000F00, "Member 'UAthenaHUDBoundActionButton_C::InputActionIconScale' has a wrong offset!");
static_assert(offsetof(UAthenaHUDBoundActionButton_C, MobileButtonStyle) == 0x000F08, "Member 'UAthenaHUDBoundActionButton_C::MobileButtonStyle' has a wrong offset!");
static_assert(offsetof(UAthenaHUDBoundActionButton_C, PCandConsoleButtonStyle) == 0x000F10, "Member 'UAthenaHUDBoundActionButton_C::PCandConsoleButtonStyle' has a wrong offset!");

}

