#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTransientQuestStartedOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTransientQuestStartedOverlay.AthenaTransientQuestStartedOverlay_C
// 0x00A8 (0x03A8 - 0x0300)
class UAthenaTransientQuestStartedOverlay_C final : public UAthenaTransientQuestStartedOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_Details;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TextGlow;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Container;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSimpleWidgetAnimationsPanel*       SimpleAnimations;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_ClueText;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_MobileClueText;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CollectionPrompt;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Details;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MobileCollectionPrompt;                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NewClue;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NewClue_1;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   IntroAnim;                                         // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FadeAnim;                                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TFieldPath<class FProperty>                   MobileClickCatcher;                                // 0x0388(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Play_Audio_Intro();
	void OnTransientQuestStarted(const class UFortQuestItem* QuestItem);
	void OnPrioitizedFinished();
	void OnPrioitizedActivated();
	void ExecuteUbergraph_AthenaTransientQuestStartedOverlay(int32 EntryPoint);
	void Construct();
	void ClearActiveContent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaTransientQuestStartedOverlay_C">();
	}
	static class UAthenaTransientQuestStartedOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTransientQuestStartedOverlay_C>();
	}
};
static_assert(alignof(UAthenaTransientQuestStartedOverlay_C) == 0x000008, "Wrong alignment on UAthenaTransientQuestStartedOverlay_C");
static_assert(sizeof(UAthenaTransientQuestStartedOverlay_C) == 0x0003A8, "Wrong size on UAthenaTransientQuestStartedOverlay_C");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, UberGraphFrame) == 0x000300, "Member 'UAthenaTransientQuestStartedOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Intro) == 0x000308, "Member 'UAthenaTransientQuestStartedOverlay_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Image_Details) == 0x000310, "Member 'UAthenaTransientQuestStartedOverlay_C::Image_Details' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Image_Shadow) == 0x000318, "Member 'UAthenaTransientQuestStartedOverlay_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Image_TextGlow) == 0x000320, "Member 'UAthenaTransientQuestStartedOverlay_C::Image_TextGlow' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Overlay_Container) == 0x000328, "Member 'UAthenaTransientQuestStartedOverlay_C::Overlay_Container' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, SimpleAnimations) == 0x000330, "Member 'UAthenaTransientQuestStartedOverlay_C::SimpleAnimations' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Switcher_ClueText) == 0x000338, "Member 'UAthenaTransientQuestStartedOverlay_C::Switcher_ClueText' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Switcher_MobileClueText) == 0x000340, "Member 'UAthenaTransientQuestStartedOverlay_C::Switcher_MobileClueText' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Text_CollectionPrompt) == 0x000348, "Member 'UAthenaTransientQuestStartedOverlay_C::Text_CollectionPrompt' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Text_Details) == 0x000350, "Member 'UAthenaTransientQuestStartedOverlay_C::Text_Details' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Text_MobileCollectionPrompt) == 0x000358, "Member 'UAthenaTransientQuestStartedOverlay_C::Text_MobileCollectionPrompt' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Text_NewClue) == 0x000360, "Member 'UAthenaTransientQuestStartedOverlay_C::Text_NewClue' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, Text_NewClue_1) == 0x000368, "Member 'UAthenaTransientQuestStartedOverlay_C::Text_NewClue_1' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, IntroAnim) == 0x000370, "Member 'UAthenaTransientQuestStartedOverlay_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, FadeAnim) == 0x000378, "Member 'UAthenaTransientQuestStartedOverlay_C::FadeAnim' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, TimerHandle) == 0x000380, "Member 'UAthenaTransientQuestStartedOverlay_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UAthenaTransientQuestStartedOverlay_C, MobileClickCatcher) == 0x000388, "Member 'UAthenaTransientQuestStartedOverlay_C::MobileClickCatcher' has a wrong offset!");

}

