#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryEquipSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryEquipSlot.AthenaInventoryEquipSlot_C
// 0x0070 (0x0FA0 - 0x0F30)
class UAthenaInventoryEquipSlot_C final : public UAthenaInventoryQuickBarSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UnderlineSelect;                                   // 0x0F38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EmptySlotSelect;                                   // 0x0F40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Scale;                                             // 0x0F48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EmptySlotHover;                                    // 0x0F50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_153;                                        // 0x0F58(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EmptyImage;                                        // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaGadgetFuelGauge_C*               JetpackFuelGauge;                                  // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayExtensionWidgets;                           // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_InputAction;                              // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SlotSizeBox;                                       // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SwapTargetIndicator;                               // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsSwapOrigin;                                     // 0x0F90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasValidItem;                                     // 0x0F91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSwapTarget;                                     // 0x0F92(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0F93(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SingleSlotSize;                                    // 0x0F94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateSlotSize(class UFortItem* Item);
	void Update_Athena_Gadget_Fuel_Widget(class UFortItem* ItemInSlot);
	void ShowSelectedState();
	void ShowHoveredState();
	void Show_Athena_Gadget_Fuel_Widget(class UFortItem* Item);
	void ResetAnims();
	void OnSwapStarted();
	void OnSwapComplete();
	void OnSlottedItemChanged(const class UFortItem* SlottedItem);
	void OnOwnerDeactivated();
	struct FEventReply OnMouseButtonDown_Border(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	bool OnDragOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnExtensionWidgetAdded(const EUIExtensionSlot ExtensionSlot, class UUserWidget* ExtensionWidget);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void ExecuteUbergraph_AthenaInventoryEquipSlot(int32 EntryPoint);
	bool CanEquipFortItem(class UObject* Object);
	void BP_OnUnhovered();
	void BP_OnSelected();
	void Hide_Athena_Gadget_Fuel_Widget();
	void BP_OnHovered();
	void BP_OnDeselected();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryEquipSlot_C">();
	}
	static class UAthenaInventoryEquipSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryEquipSlot_C>();
	}
};
static_assert(alignof(UAthenaInventoryEquipSlot_C) == 0x000010, "Wrong alignment on UAthenaInventoryEquipSlot_C");
static_assert(sizeof(UAthenaInventoryEquipSlot_C) == 0x000FA0, "Wrong size on UAthenaInventoryEquipSlot_C");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, UberGraphFrame) == 0x000F30, "Member 'UAthenaInventoryEquipSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, UnderlineSelect) == 0x000F38, "Member 'UAthenaInventoryEquipSlot_C::UnderlineSelect' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, EmptySlotSelect) == 0x000F40, "Member 'UAthenaInventoryEquipSlot_C::EmptySlotSelect' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, Scale) == 0x000F48, "Member 'UAthenaInventoryEquipSlot_C::Scale' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, EmptySlotHover) == 0x000F50, "Member 'UAthenaInventoryEquipSlot_C::EmptySlotHover' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, Border_153) == 0x000F58, "Member 'UAthenaInventoryEquipSlot_C::Border_153' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, EmptyImage) == 0x000F60, "Member 'UAthenaInventoryEquipSlot_C::EmptyImage' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, JetpackFuelGauge) == 0x000F68, "Member 'UAthenaInventoryEquipSlot_C::JetpackFuelGauge' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, OverlayExtensionWidgets) == 0x000F70, "Member 'UAthenaInventoryEquipSlot_C::OverlayExtensionWidgets' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, ScaleBox_InputAction) == 0x000F78, "Member 'UAthenaInventoryEquipSlot_C::ScaleBox_InputAction' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, SlotSizeBox) == 0x000F80, "Member 'UAthenaInventoryEquipSlot_C::SlotSizeBox' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, SwapTargetIndicator) == 0x000F88, "Member 'UAthenaInventoryEquipSlot_C::SwapTargetIndicator' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, bIsSwapOrigin) == 0x000F90, "Member 'UAthenaInventoryEquipSlot_C::bIsSwapOrigin' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, bHasValidItem) == 0x000F91, "Member 'UAthenaInventoryEquipSlot_C::bHasValidItem' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, bIsSwapTarget) == 0x000F92, "Member 'UAthenaInventoryEquipSlot_C::bIsSwapTarget' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, bIsSelected) == 0x000F93, "Member 'UAthenaInventoryEquipSlot_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, SingleSlotSize) == 0x000F94, "Member 'UAthenaInventoryEquipSlot_C::SingleSlotSize' has a wrong offset!");

}

