#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_BurstReaction_Exploding

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Athena_DamageStateParticles_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Athena_Prop_BurstReaction_Exploding.Athena_Prop_BurstReaction_Exploding_C.ExecuteFireApplicationInRadiusIfCurieEnabled
// 0x00E0 (0x00E0 - 0x0000)
struct Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled final
{
public:
	class AActor*                                 Fire_Application_Target;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TargetedLandscape;                                 // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALandscape*                             K2Node_DynamicCast_AsLandscape;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurieActive_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0040(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled) == 0x000008, "Wrong alignment on Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled");
static_assert(sizeof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled) == 0x0000E0, "Wrong size on Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled, Fire_Application_Target) == 0x000000, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled::Fire_Application_Target' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled, TargetedLandscape) == 0x000008, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled::TargetedLandscape' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled, K2Node_DynamicCast_AsLandscape) == 0x000010, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled::K2Node_DynamicCast_AsLandscape' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled, CallFunc_HasAuthority_ReturnValue) == 0x000019, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled, CallFunc_GetValueAtLevel_ReturnValue) == 0x00001C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled, Temp_bool_Variable) == 0x000020, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled, K2Node_Select_Default) == 0x000028, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled, CallFunc_IsCurieActive_ReturnValue) == 0x000030, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled::CallFunc_IsCurieActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled, CallFunc_MakeHitResult_ReturnValue) == 0x000040, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteFireApplicationInRadiusIfCurieEnabled::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");

// Function Athena_Prop_BurstReaction_Exploding.Athena_Prop_BurstReaction_Exploding_C.ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding
// 0x0A68 (0x0A68 - 0x0000)
struct Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_2;                // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_3;                // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue_4;                // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_2;      // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_5;                // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_2;                             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_2;                         // 0x00E0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_2;                           // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_2;                            // 0x010C(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_2;                       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_2;                       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_2;                      // 0x01B8(0x0018)()
	float                                         CallFunc_VSize_ReturnValue_2;                      // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_2;               // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTags_ReturnValue;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthPercent_ReturnValue;             // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0228(0x00C0)(ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x02E8(0x00C0)(ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x03A8(0x00C0)(ContainsInstancedReference)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46D[0x3];                                      // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage_1;                             // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0478(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x04A4(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x0550(0x0018)()
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x0578(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue; // 0x0580(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x0588(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0590(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x05A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x05B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x05BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BE[0x2];                                      // 0x05BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_2; // 0x05C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x05E8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0608(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0614(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x06C0(0x0018)()
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x06DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD[0x3];                                      // 0x06DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x06E0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x06F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_701[0x7];                                      // 0x0701(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0714(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0728(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_739[0x7];                                      // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActorPtr_ReturnValue;           // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0748(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_6;                // 0x0754(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0760(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_3;                      // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_3;                     // 0x0770(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x077C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77D[0x3];                                      // 0x077D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_3;               // 0x0780(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x078C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0798(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x07A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x07B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x07B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x07C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C5[0x3];                                      // 0x07C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x07C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_7;                // 0x07D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_4;               // 0x07E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x07EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x07F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0804(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0810(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_4;                     // 0x081C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_831[0x3];                                      // 0x0831(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_5;               // 0x0834(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0840(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_851[0x7];                                      // 0x0851(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0858(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0869(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86A[0x2];                                      // 0x086A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue_1;     // 0x086C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0878(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0884(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue_1;               // 0x0888(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_1;                    // 0x0894(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x0898(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x08A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A5[0x3];                                      // 0x08A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_6;               // 0x08A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B4[0x4];                                      // 0x08B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x08B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C9[0x3];                                      // 0x08C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue_1; // 0x08CC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4[0x4];                                      // 0x08D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x08E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E1[0x7];                                      // 0x08E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_3; // 0x08E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F9[0x3];                                      // 0x08F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue_1; // 0x08FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x0904(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0905(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_906[0x2];                                      // 0x0906(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthena_Prop_BurstReaction_Exploding_C* K2Node_DynamicCast_AsAthena_Prop_Burst_Reaction_Exploding; // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_911[0x7];                                      // 0x0911(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_1;                          // 0x0918(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0928(0x0020)()
	bool                                          CallFunc_HasTags_ReturnValue_1;                    // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_949[0x3];                                      // 0x0949(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x094C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0950(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x095C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0964(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0968(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x096C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x097C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97D[0x3];                                      // 0x097D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0984(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0990(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x099C(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue_5;                     // 0x09AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x09B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_7;               // 0x09C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue_2;     // 0x09CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_2;         // 0x09D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x09E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue_2;               // 0x09E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_2;                    // 0x09F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_2;            // 0x09F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0A04(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A05[0x3];                                      // 0x0A05(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_8;               // 0x0A08(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0A14(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0A20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0A24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0A28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0A2C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0A38(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A44[0x4];                                      // 0x0A44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         CallFunc_GetDeathParticles_ReturnValue;            // 0x0A48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x0A50(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0A58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0A5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5D[0x3];                                      // 0x0A5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding) == 0x000008, "Wrong alignment on Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding");
static_assert(sizeof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding) == 0x000A68, "Wrong size on Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, EntryPoint) == 0x000000, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue) == 0x000004, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue_1) == 0x000010, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Normal_ReturnValue) == 0x00001C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Normal_ReturnValue_1) == 0x000028, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetActorForwardVector_ReturnValue) == 0x000034, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue_2) == 0x000040, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x00004C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_VSize_ReturnValue) == 0x000058, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue_3) == 0x00005C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000068, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_VSize_ReturnValue_1) == 0x00006C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_SelectVector_ReturnValue) == 0x000070, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00007C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_SelectVector_ReturnValue_1) == 0x000080, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_IsValid_ReturnValue) == 0x00008C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_IsPlaying_ReturnValue) == 0x00008D, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, Temp_bool_IsClosed_Variable) == 0x00008E, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, Temp_bool_Has_Been_Initd_Variable) == 0x00008F, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, Temp_bool_Variable) == 0x000090, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_HitLocation) == 0x000094, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_IsServer_ReturnValue) == 0x0000A4, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue_4) == 0x0000A8, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetActorForwardVector_ReturnValue_2) == 0x0000B4, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetActorForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Normal_ReturnValue_2) == 0x0000C0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue_5) == 0x0000CC, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_Damage_2) == 0x0000D8, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_Damage_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_DamageTags_2) == 0x0000E0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_DamageTags_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_Momentum_2) == 0x000100, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_Momentum_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_HitInfo_2) == 0x00010C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_HitInfo_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_InstigatedBy_2) == 0x0001A8, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_InstigatedBy_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_DamageCauser_2) == 0x0001B0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_DamageCauser_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_EffectContext_2) == 0x0001B8, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_EffectContext_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_VSize_ReturnValue_2) == 0x0001D0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_VSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_DynamicCast_AsFort_Player_Controller) == 0x0001D8, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0001E1, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_SelectVector_ReturnValue_2) == 0x0001E4, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_SelectVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_HasTags_ReturnValue) == 0x0001F0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_HasTags_ReturnValue' has a wrong offset!");
