#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDSituationalFeedback

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaHUDSituationalFeedback.AthenaHUDSituationalFeedback_C
// 0x0040 (0x02F0 - 0x02B0)
class UAthenaHUDSituationalFeedback_C : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Feedback;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaHUDFeedbackLine_C*               FeedbackLine1;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UAthenaHUDFeedbackLine_C*>       FeedbackLines;                                     // 0x02C8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         MaxLinesNeeded;                                    // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoHide;                                         // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AutoHideTime;                                      // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             DefaultTextStyleSet;                               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UpdateFeedbackStyles(class UDataTable* Style);
	void ShowFeedback();
	void HideFeedback();
	void ExecuteUbergraph_AthenaHUDSituationalFeedback(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaHUDSituationalFeedback_C">();
	}
	static class UAthenaHUDSituationalFeedback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDSituationalFeedback_C>();
	}
};
static_assert(alignof(UAthenaHUDSituationalFeedback_C) == 0x000008, "Wrong alignment on UAthenaHUDSituationalFeedback_C");
static_assert(sizeof(UAthenaHUDSituationalFeedback_C) == 0x0002F0, "Wrong size on UAthenaHUDSituationalFeedback_C");
static_assert(offsetof(UAthenaHUDSituationalFeedback_C, UberGraphFrame) == 0x0002B0, "Member 'UAthenaHUDSituationalFeedback_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaHUDSituationalFeedback_C, Feedback) == 0x0002B8, "Member 'UAthenaHUDSituationalFeedback_C::Feedback' has a wrong offset!");
static_assert(offsetof(UAthenaHUDSituationalFeedback_C, FeedbackLine1) == 0x0002C0, "Member 'UAthenaHUDSituationalFeedback_C::FeedbackLine1' has a wrong offset!");
static_assert(offsetof(UAthenaHUDSituationalFeedback_C, FeedbackLines) == 0x0002C8, "Member 'UAthenaHUDSituationalFeedback_C::FeedbackLines' has a wrong offset!");
static_assert(offsetof(UAthenaHUDSituationalFeedback_C, MaxLinesNeeded) == 0x0002D8, "Member 'UAthenaHUDSituationalFeedback_C::MaxLinesNeeded' has a wrong offset!");
static_assert(offsetof(UAthenaHUDSituationalFeedback_C, bAutoHide) == 0x0002DC, "Member 'UAthenaHUDSituationalFeedback_C::bAutoHide' has a wrong offset!");
static_assert(offsetof(UAthenaHUDSituationalFeedback_C, AutoHideTime) == 0x0002E0, "Member 'UAthenaHUDSituationalFeedback_C::AutoHideTime' has a wrong offset!");
static_assert(offsetof(UAthenaHUDSituationalFeedback_C, DefaultTextStyleSet) == 0x0002E8, "Member 'UAthenaHUDSituationalFeedback_C::DefaultTextStyleSet' has a wrong offset!");

}

