#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryItemInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryItemInfo.AthenaInventoryItemInfo_C
// 0x0048 (0x03A8 - 0x0360)
class UAthenaInventoryItemInfo_C final : public UAthenaInventoryItemInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Inspect;                                           // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxExtensionWidgets;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBlackBacking;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RarityGlow;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ItemtypeBorder;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PlaceholderRarityInfo;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              SwitcherInfoContent;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bInspecting;                                       // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateRarityInfoVisibility(class UFortItem* Item);
	void SetRarityGlowColors(const struct FLinearColor& Specified_Color, EFortRarity Index_0);
	void PreConstruct(bool IsDesignTime);
	void PlayInspectAudio();
	void OnPostItemToRepresentChanged(const class UFortItem* ItemToRepresent);
	void OnOwnerDeactivated();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnItemRarityUpdated(const EFortRarity ItemRarity, const struct FFortRarityItemData& RarityItemData);
	void OnItemCategoryIconUpdated(const bool bHasCategoryIcon);
	void OnInspectItemInput(const bool bPressed);
	void OnExtensionWidgetAdded(class UUserWidget* ExtensionWidget);
	void ExecuteUbergraph_AthenaInventoryItemInfo(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryItemInfo_C">();
	}
	static class UAthenaInventoryItemInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryItemInfo_C>();
	}
};
static_assert(alignof(UAthenaInventoryItemInfo_C) == 0x000008, "Wrong alignment on UAthenaInventoryItemInfo_C");
static_assert(sizeof(UAthenaInventoryItemInfo_C) == 0x0003A8, "Wrong size on UAthenaInventoryItemInfo_C");
static_assert(offsetof(UAthenaInventoryItemInfo_C, UberGraphFrame) == 0x000360, "Member 'UAthenaInventoryItemInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryItemInfo_C, Inspect) == 0x000368, "Member 'UAthenaInventoryItemInfo_C::Inspect' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryItemInfo_C, HBoxExtensionWidgets) == 0x000370, "Member 'UAthenaInventoryItemInfo_C::HBoxExtensionWidgets' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryItemInfo_C, HeaderBlackBacking) == 0x000378, "Member 'UAthenaInventoryItemInfo_C::HeaderBlackBacking' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryItemInfo_C, Image_RarityGlow) == 0x000380, "Member 'UAthenaInventoryItemInfo_C::Image_RarityGlow' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryItemInfo_C, ItemtypeBorder) == 0x000388, "Member 'UAthenaInventoryItemInfo_C::ItemtypeBorder' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryItemInfo_C, PlaceholderRarityInfo) == 0x000390, "Member 'UAthenaInventoryItemInfo_C::PlaceholderRarityInfo' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryItemInfo_C, SwitcherInfoContent) == 0x000398, "Member 'UAthenaInventoryItemInfo_C::SwitcherInfoContent' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryItemInfo_C, bInspecting) == 0x0003A0, "Member 'UAthenaInventoryItemInfo_C::bInspecting' has a wrong offset!");

}

