#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuickbarSecondary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QuickbarBase_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaQuickbarSecondary.AthenaQuickbarSecondary_C
// 0x0088 (0x0370 - 0x02E8)
class UAthenaQuickbarSecondary_C final : public UQuickbarBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AthenaQuickbarSecondary_C;          // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_CannotPerform_0;                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_CannotPerform;                                // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         _Horizontal_Box__Camera_Mode_Content;              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Separator;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Switch_Action;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BuildingBlocked_Icon;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindSwitchBinding;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       QuickbarSecondaryInvalidationBox;                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF1;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF2;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF3;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF4;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF5;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Building;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentBuildingSlot;                               // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Show_Secondary_Quickbar_Rail(bool Show);
	void SetQuickBarNativeMode(bool bNativeMode);
	void Removed_897643034F53813748C62389F1399537();
	void OnUnableToPerformAction(const struct FGameplayTagContainer& FailedReason, const class FText& FailureText);
	void OnQuickBarSlotFocusChanged_Bind(EFortQuickBars QuickbarIndex, int32 Slot_0);
	void OnQuickbarContentsChanged(EFortQuickBars QuickbarIndex, const TArray<int32>& ChangedSlots);
	void Minimize();
	void Maximize();
	void HandleShowHideRail();
	void HandlePawnSet();
	void HandleKeybindsChanged();
	void HandleKeyBindsChange();
	void HandleInputMethodChanged_Bind(ECommonInputType InputType);
	class UFortQuickBarSlotBase* GetSpecificSlot(int32 SlotNumber);
	void ExecuteUbergraph_AthenaQuickbarSecondary(int32 EntryPoint);
	void Destruct();
	void Construct();
	void BuildModeUpdated(bool bBuildingBlocked);
	void Added_6814FFE741B5A552ACDCCFB726D60ED5();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuickbarSecondary_C">();
	}
	static class UAthenaQuickbarSecondary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQuickbarSecondary_C>();
	}
};
static_assert(alignof(UAthenaQuickbarSecondary_C) == 0x000008, "Wrong alignment on UAthenaQuickbarSecondary_C");
static_assert(sizeof(UAthenaQuickbarSecondary_C) == 0x000370, "Wrong size on UAthenaQuickbarSecondary_C");
static_assert(offsetof(UAthenaQuickbarSecondary_C, UberGraphFrame_AthenaQuickbarSecondary_C) == 0x0002E8, "Member 'UAthenaQuickbarSecondary_C::UberGraphFrame_AthenaQuickbarSecondary_C' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, Anim_CannotPerform_0) == 0x0002F0, "Member 'UAthenaQuickbarSecondary_C::Anim_CannotPerform_0' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, Anim_CannotPerform) == 0x0002F8, "Member 'UAthenaQuickbarSecondary_C::Anim_CannotPerform' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, _Horizontal_Box__Camera_Mode_Content) == 0x000300, "Member 'UAthenaQuickbarSecondary_C::_Horizontal_Box__Camera_Mode_Content' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, _Image__Separator) == 0x000308, "Member 'UAthenaQuickbarSecondary_C::_Image__Separator' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, _Image__Switch_Action) == 0x000310, "Member 'UAthenaQuickbarSecondary_C::_Image__Switch_Action' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, BuildingBlocked_Icon) == 0x000318, "Member 'UAthenaQuickbarSecondary_C::BuildingBlocked_Icon' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, KeybindSwitchBinding) == 0x000320, "Member 'UAthenaQuickbarSecondary_C::KeybindSwitchBinding' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, Overlay_0) == 0x000328, "Member 'UAthenaQuickbarSecondary_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSecondaryInvalidationBox) == 0x000330, "Member 'UAthenaQuickbarSecondary_C::QuickbarSecondaryInvalidationBox' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF1) == 0x000338, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF1' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF2) == 0x000340, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF2' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF3) == 0x000348, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF3' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF4) == 0x000350, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF4' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF5) == 0x000358, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF5' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, SizeBox_Building) == 0x000360, "Member 'UAthenaQuickbarSecondary_C::SizeBox_Building' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, CurrentBuildingSlot) == 0x000368, "Member 'UAthenaQuickbarSecondary_C::CurrentBuildingSlot' has a wrong offset!");

}

