#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaAerialFeedback

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaAerialFeedback.AthenaAerialFeedback_C
// 0x0018 (0x0318 - 0x0300)
class UAthenaAerialFeedback_C final : public UAthenaAerialFeedback
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortSimpleWidgetAnimationsPanel*       AnimationsPanel;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaAerialFeedback(int32 EntryPoint);
	void BP_HandleTextChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaAerialFeedback_C">();
	}
	static class UAthenaAerialFeedback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAerialFeedback_C>();
	}
};
static_assert(alignof(UAthenaAerialFeedback_C) == 0x000008, "Wrong alignment on UAthenaAerialFeedback_C");
static_assert(sizeof(UAthenaAerialFeedback_C) == 0x000318, "Wrong size on UAthenaAerialFeedback_C");
static_assert(offsetof(UAthenaAerialFeedback_C, UberGraphFrame) == 0x000300, "Member 'UAthenaAerialFeedback_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaAerialFeedback_C, Intro) == 0x000308, "Member 'UAthenaAerialFeedback_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaAerialFeedback_C, AnimationsPanel) == 0x000310, "Member 'UAthenaAerialFeedback_C::AnimationsPanel' has a wrong offset!");

}

