#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamScoreWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTeamScoreWidget.AthenaTeamScoreWidget_C
// 0x00B0 (0x0388 - 0x02D8)
class UAthenaTeamScoreWidget_C final : public UAthenaTeamScoreWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WinnerShine;                                       // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScoreUp;                                           // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RankUp;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_GameStatus;                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackplateProgress;                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       IsWinner;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Leaderboard;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayPlacePlate;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ScoreTextBox;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PlaceValue;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_LeaderDelta;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_places;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlaceValues;                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_TiedForLead;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_TrailingDelta;                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_BackgroundFlash;                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_PlaceBackground;                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentPlaceValue;                                 // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinimumDisplayPlacement;                           // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviewPlace;                                      // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ProgressBarDMI;                                    // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isBacchus;                                         // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdatePlacement(int32 Place, bool Instant);
	void UpdateScore(int32 Score);
	void UpdateLeaderboard(int32 PointsDelta, bool IsWinner_0, bool HasScore);
	void OnScoreChanged(int32 Score);
	void OnPlacementChanged(int32 Placement);
	void PreConstruct(bool IsDesignTime);
	void OnLeaderboardChanged(int32 ScoreDelta, bool bIsWinner, bool bHasScore);
	void ExecuteUbergraph_AthenaTeamScoreWidget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaTeamScoreWidget_C">();
	}
	static class UAthenaTeamScoreWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTeamScoreWidget_C>();
	}
};
static_assert(alignof(UAthenaTeamScoreWidget_C) == 0x000008, "Wrong alignment on UAthenaTeamScoreWidget_C");
static_assert(sizeof(UAthenaTeamScoreWidget_C) == 0x000388, "Wrong size on UAthenaTeamScoreWidget_C");
static_assert(offsetof(UAthenaTeamScoreWidget_C, UberGraphFrame) == 0x0002D8, "Member 'UAthenaTeamScoreWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, WinnerShine) == 0x0002E0, "Member 'UAthenaTeamScoreWidget_C::WinnerShine' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, ScoreUp) == 0x0002E8, "Member 'UAthenaTeamScoreWidget_C::ScoreUp' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, RankUp) == 0x0002F0, "Member 'UAthenaTeamScoreWidget_C::RankUp' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, CommonWidgetSwitcher_GameStatus) == 0x0002F8, "Member 'UAthenaTeamScoreWidget_C::CommonWidgetSwitcher_GameStatus' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, Image_BackplateProgress) == 0x000300, "Member 'UAthenaTeamScoreWidget_C::Image_BackplateProgress' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, IsWinner) == 0x000308, "Member 'UAthenaTeamScoreWidget_C::IsWinner' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, Overlay_Leaderboard) == 0x000310, "Member 'UAthenaTeamScoreWidget_C::Overlay_Leaderboard' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, OverlayPlacePlate) == 0x000318, "Member 'UAthenaTeamScoreWidget_C::OverlayPlacePlate' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, ScoreTextBox) == 0x000320, "Member 'UAthenaTeamScoreWidget_C::ScoreTextBox' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, Text_PlaceValue) == 0x000328, "Member 'UAthenaTeamScoreWidget_C::Text_PlaceValue' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, TextBlock_LeaderDelta) == 0x000330, "Member 'UAthenaTeamScoreWidget_C::TextBlock_LeaderDelta' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, TextBlock_places) == 0x000338, "Member 'UAthenaTeamScoreWidget_C::TextBlock_places' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, TextBlock_PlaceValues) == 0x000340, "Member 'UAthenaTeamScoreWidget_C::TextBlock_PlaceValues' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, TextBlock_TiedForLead) == 0x000348, "Member 'UAthenaTeamScoreWidget_C::TextBlock_TiedForLead' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, TextBlock_TrailingDelta) == 0x000350, "Member 'UAthenaTeamScoreWidget_C::TextBlock_TrailingDelta' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, WidgetSwitcher_BackgroundFlash) == 0x000358, "Member 'UAthenaTeamScoreWidget_C::WidgetSwitcher_BackgroundFlash' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, WidgetSwitcher_PlaceBackground) == 0x000360, "Member 'UAthenaTeamScoreWidget_C::WidgetSwitcher_PlaceBackground' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, CurrentPlaceValue) == 0x000368, "Member 'UAthenaTeamScoreWidget_C::CurrentPlaceValue' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, MinimumDisplayPlacement) == 0x00036C, "Member 'UAthenaTeamScoreWidget_C::MinimumDisplayPlacement' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, PreviewPlace) == 0x000370, "Member 'UAthenaTeamScoreWidget_C::PreviewPlace' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, ProgressBarDMI) == 0x000378, "Member 'UAthenaTeamScoreWidget_C::ProgressBarDMI' has a wrong offset!");
static_assert(offsetof(UAthenaTeamScoreWidget_C, isBacchus) == 0x000380, "Member 'UAthenaTeamScoreWidget_C::isBacchus' has a wrong offset!");

}

