#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaContextualChallengesWidget_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaContextualChallengesWidget_BP.AthenaContextualChallengesWidget_BP_C.StartOutroDelay
// 0x0020 (0x0020 - 0x0000)
struct AthenaContextualChallengesWidget_BP_C_StartOutroDelay final
{
public:
	bool                                          CallFunc_ShouldOutroAutomatically_ReturnValue;     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetOutroDelay_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaContextualChallengesWidget_BP_C_StartOutroDelay) == 0x000008, "Wrong alignment on AthenaContextualChallengesWidget_BP_C_StartOutroDelay");
static_assert(sizeof(AthenaContextualChallengesWidget_BP_C_StartOutroDelay) == 0x000020, "Wrong size on AthenaContextualChallengesWidget_BP_C_StartOutroDelay");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartOutroDelay, CallFunc_ShouldOutroAutomatically_ReturnValue) == 0x000000, "Member 'AthenaContextualChallengesWidget_BP_C_StartOutroDelay::CallFunc_ShouldOutroAutomatically_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartOutroDelay, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaContextualChallengesWidget_BP_C_StartOutroDelay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartOutroDelay, CallFunc_GetOutroDelay_ReturnValue) == 0x000014, "Member 'AthenaContextualChallengesWidget_BP_C_StartOutroDelay::CallFunc_GetOutroDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartOutroDelay, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'AthenaContextualChallengesWidget_BP_C_StartOutroDelay::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function AthenaContextualChallengesWidget_BP.AthenaContextualChallengesWidget_BP_C.StartIntro
// 0x0058 (0x0058 - 0x0000)
struct AthenaContextualChallengesWidget_BP_C_StartIntro final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasChallengesToDisplay_bHasChallenges;    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0020(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaContextualChallengeEntry_BP_C*   K2Node_DynamicCast_AsAthena_Contextual_Challenge_Entry_BP; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaContextualChallengesWidget_BP_C_StartIntro) == 0x000008, "Wrong alignment on AthenaContextualChallengesWidget_BP_C_StartIntro");
static_assert(sizeof(AthenaContextualChallengesWidget_BP_C_StartIntro) == 0x000058, "Wrong size on AthenaContextualChallengesWidget_BP_C_StartIntro");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, CallFunc_PlayAnimationByName_ReturnValue) == 0x000018, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, CallFunc_HasChallengesToDisplay_bHasChallenges) == 0x000019, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::CallFunc_HasChallengesToDisplay_bHasChallenges' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, CallFunc_GetAllEntries_ReturnValue) == 0x000020, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::CallFunc_GetAllEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, CallFunc_Array_Get_Item) == 0x000030, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, K2Node_DynamicCast_AsAthena_Contextual_Challenge_Entry_BP) == 0x000040, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::K2Node_DynamicCast_AsAthena_Contextual_Challenge_Entry_BP' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, CallFunc_Subtract_IntInt_ReturnValue) == 0x00004C, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000054, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_StartIntro, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'AthenaContextualChallengesWidget_BP_C_StartIntro::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaContextualChallengesWidget_BP.AthenaContextualChallengesWidget_BP_C.OnNewContextualHeader
// 0x0018 (0x0018 - 0x0000)
struct AthenaContextualChallengesWidget_BP_C_OnNewContextualHeader final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaContextualChallengesWidget_BP_C_OnNewContextualHeader) == 0x000008, "Wrong alignment on AthenaContextualChallengesWidget_BP_C_OnNewContextualHeader");
static_assert(sizeof(AthenaContextualChallengesWidget_BP_C_OnNewContextualHeader) == 0x000018, "Wrong size on AthenaContextualChallengesWidget_BP_C_OnNewContextualHeader");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_OnNewContextualHeader, NewText) == 0x000000, "Member 'AthenaContextualChallengesWidget_BP_C_OnNewContextualHeader::NewText' has a wrong offset!");

// Function AthenaContextualChallengesWidget_BP.AthenaContextualChallengesWidget_BP_C.OnAnimationsFinished
// 0x0008 (0x0008 - 0x0000)
struct AthenaContextualChallengesWidget_BP_C_OnAnimationsFinished final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaContextualChallengesWidget_BP_C_OnAnimationsFinished) == 0x000004, "Wrong alignment on AthenaContextualChallengesWidget_BP_C_OnAnimationsFinished");
static_assert(sizeof(AthenaContextualChallengesWidget_BP_C_OnAnimationsFinished) == 0x000008, "Wrong size on AthenaContextualChallengesWidget_BP_C_OnAnimationsFinished");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_OnAnimationsFinished, Name_0) == 0x000000, "Member 'AthenaContextualChallengesWidget_BP_C_OnAnimationsFinished::Name_0' has a wrong offset!");

// Function AthenaContextualChallengesWidget_BP.AthenaContextualChallengesWidget_BP_C.HasChallengesToDisplay
// 0x000C (0x000C - 0x0000)
struct AthenaContextualChallengesWidget_BP_C_HasChallengesToDisplay final
{
public:
	bool                                          bHasChallenges;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumEntries_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaContextualChallengesWidget_BP_C_HasChallengesToDisplay) == 0x000004, "Wrong alignment on AthenaContextualChallengesWidget_BP_C_HasChallengesToDisplay");
static_assert(sizeof(AthenaContextualChallengesWidget_BP_C_HasChallengesToDisplay) == 0x00000C, "Wrong size on AthenaContextualChallengesWidget_BP_C_HasChallengesToDisplay");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_HasChallengesToDisplay, bHasChallenges) == 0x000000, "Member 'AthenaContextualChallengesWidget_BP_C_HasChallengesToDisplay::bHasChallenges' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_HasChallengesToDisplay, CallFunc_GetNumEntries_ReturnValue) == 0x000004, "Member 'AthenaContextualChallengesWidget_BP_C_HasChallengesToDisplay::CallFunc_GetNumEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_HasChallengesToDisplay, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'AthenaContextualChallengesWidget_BP_C_HasChallengesToDisplay::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaContextualChallengesWidget_BP.AthenaContextualChallengesWidget_BP_C.FinishOutro
// 0x0001 (0x0001 - 0x0000)
struct AthenaContextualChallengesWidget_BP_C_FinishOutro final
{
public:
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaContextualChallengesWidget_BP_C_FinishOutro) == 0x000001, "Wrong alignment on AthenaContextualChallengesWidget_BP_C_FinishOutro");
static_assert(sizeof(AthenaContextualChallengesWidget_BP_C_FinishOutro) == 0x000001, "Wrong size on AthenaContextualChallengesWidget_BP_C_FinishOutro");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_FinishOutro, CallFunc_PlayAnimationByName_ReturnValue) == 0x000000, "Member 'AthenaContextualChallengesWidget_BP_C_FinishOutro::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");

// Function AthenaContextualChallengesWidget_BP.AthenaContextualChallengesWidget_BP_C.ExecuteUbergraph_AthenaContextualChallengesWidget_BP
// 0x0108 (0x0108 - 0x0000)
struct AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName Name)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0028(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasChallengesToDisplay_bHasChallenges;    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_NewText;                              // 0x0048(0x0018)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00E0(0x0018)(ConstParm)
	class FName                                   K2Node_CustomEvent_Name;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP) == 0x000008, "Wrong alignment on AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP");
static_assert(sizeof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP) == 0x000108, "Wrong size on AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, EntryPoint) == 0x000000, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000020, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, CallFunc_GetText_ReturnValue) == 0x000028, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, Temp_bool_Variable) == 0x000040, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x000041, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, CallFunc_HasChallengesToDisplay_bHasChallenges) == 0x000042, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::CallFunc_HasChallengesToDisplay_bHasChallenges' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, K2Node_Event_NewText) == 0x000048, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::K2Node_Event_NewText' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, CallFunc_BooleanOR_ReturnValue) == 0x0000A8, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, K2Node_MakeArray_Array) == 0x0000B0, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, CallFunc_TextIsEmpty_ReturnValue) == 0x0000D8, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, K2Node_Select_Default) == 0x0000E0, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, K2Node_CustomEvent_Name) == 0x0000F8, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000100, "Member 'AthenaContextualChallengesWidget_BP_C_ExecuteUbergraph_AthenaContextualChallengesWidget_BP::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function AthenaContextualChallengesWidget_BP.AthenaContextualChallengesWidget_BP_C.ClearActiveContent
// 0x0010 (0x0010 - 0x0000)
struct AthenaContextualChallengesWidget_BP_C_ClearActiveContent final
{
public:
	TScriptInterface<class IFortPrioritizedWidget> CallFunc_SetHasActiveContent_self_CastInput;       // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaContextualChallengesWidget_BP_C_ClearActiveContent) == 0x000008, "Wrong alignment on AthenaContextualChallengesWidget_BP_C_ClearActiveContent");
static_assert(sizeof(AthenaContextualChallengesWidget_BP_C_ClearActiveContent) == 0x000010, "Wrong size on AthenaContextualChallengesWidget_BP_C_ClearActiveContent");
static_assert(offsetof(AthenaContextualChallengesWidget_BP_C_ClearActiveContent, CallFunc_SetHasActiveContent_self_CastInput) == 0x000000, "Member 'AthenaContextualChallengesWidget_BP_C_ClearActiveContent::CallFunc_SetHasActiveContent_self_CastInput' has a wrong offset!");

}

