#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryDragVisual

#include "Basic.hpp"

#include "AthenaDragDropAction_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryDragVisual.AthenaInventoryDragVisual_C
// 0x0030 (0x0288 - 0x0258)
class UAthenaInventoryDragVisual_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DropImage;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DropImageContainer;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaItemIconLoadout_C*               ItemIcon;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              Item;                                              // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ShowDropIcon(EAthenaDragDropAction Drop_Action);
	void ExecuteUbergraph_AthenaInventoryDragVisual(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryDragVisual_C">();
	}
	static class UAthenaInventoryDragVisual_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryDragVisual_C>();
	}
};
static_assert(alignof(UAthenaInventoryDragVisual_C) == 0x000008, "Wrong alignment on UAthenaInventoryDragVisual_C");
static_assert(sizeof(UAthenaInventoryDragVisual_C) == 0x000288, "Wrong size on UAthenaInventoryDragVisual_C");
static_assert(offsetof(UAthenaInventoryDragVisual_C, UberGraphFrame) == 0x000258, "Member 'UAthenaInventoryDragVisual_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, DropImage) == 0x000260, "Member 'UAthenaInventoryDragVisual_C::DropImage' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, DropImageContainer) == 0x000268, "Member 'UAthenaInventoryDragVisual_C::DropImageContainer' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, ItemIcon) == 0x000270, "Member 'UAthenaInventoryDragVisual_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, Shadow) == 0x000278, "Member 'UAthenaInventoryDragVisual_C::Shadow' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, Item) == 0x000280, "Member 'UAthenaInventoryDragVisual_C::Item' has a wrong offset!");

}

