#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamMemberInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTeamMemberInfo.AthenaTeamMemberInfo_C
// 0x0088 (0x04A0 - 0x0418)
class UAthenaTeamMemberInfo_C final : public UAthenaPlayerInfoBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DangerPulse;                                       // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PulseMember;                                       // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Active;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeIcon;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_HealthShields;                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ResurrectChip_Uncollected;                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainVertBox;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PlayerPortraitExtensions;                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PlayerStateExtensions;                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_PlayerStates;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DBNOPulseTimer;                                    // 0x0470(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  RelevantPlaylistTags;                              // 0x0478(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsTalking;                                        // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowBackgroundOverridden;                         // 0x0499(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetBackgroundVisibility(bool bOverride, bool bBackgroundVisible);
	void Pulse();
	void OverrideShowBackground(bool bShowBackground);
	void ExecuteUbergraph_AthenaTeamMemberInfo(int32 EntryPoint);
	void DoFlash();
	void Danger_Pulse();
	void ClearDBNOFlashing();
	void BP_HandleTalkingVisualDisplayChanged(bool bTalkingVisualsActive);
	void BP_HandleSeasonLevelUIDisplayChanged(int32 Level);
	void BP_HandleResurrectionStateChanged(const struct FFortResurrectionUIData& ResurrectionStateData);
	void BP_HandlePlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void BP_HandlePlaylistExtensionWidgetCreated(class UUserWidget* Widget, EUIExtensionSlot SlotType);
	void BP_HandleGameModeIconChanged(class UTexture2D* GameModeIcon_0);
	void BP_HandleDBNOStateChanged(bool bDBNO);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaTeamMemberInfo_C">();
	}
	static class UAthenaTeamMemberInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTeamMemberInfo_C>();
	}
};
static_assert(alignof(UAthenaTeamMemberInfo_C) == 0x000008, "Wrong alignment on UAthenaTeamMemberInfo_C");
static_assert(sizeof(UAthenaTeamMemberInfo_C) == 0x0004A0, "Wrong size on UAthenaTeamMemberInfo_C");
static_assert(offsetof(UAthenaTeamMemberInfo_C, UberGraphFrame) == 0x000418, "Member 'UAthenaTeamMemberInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, DangerPulse) == 0x000420, "Member 'UAthenaTeamMemberInfo_C::DangerPulse' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, PulseMember) == 0x000428, "Member 'UAthenaTeamMemberInfo_C::PulseMember' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, BG_Active) == 0x000430, "Member 'UAthenaTeamMemberInfo_C::BG_Active' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, GameModeIcon) == 0x000438, "Member 'UAthenaTeamMemberInfo_C::GameModeIcon' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, HorizontalBox_HealthShields) == 0x000440, "Member 'UAthenaTeamMemberInfo_C::HorizontalBox_HealthShields' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, Image_ResurrectChip_Uncollected) == 0x000448, "Member 'UAthenaTeamMemberInfo_C::Image_ResurrectChip_Uncollected' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, MainVertBox) == 0x000450, "Member 'UAthenaTeamMemberInfo_C::MainVertBox' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, Overlay_PlayerPortraitExtensions) == 0x000458, "Member 'UAthenaTeamMemberInfo_C::Overlay_PlayerPortraitExtensions' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, Overlay_PlayerStateExtensions) == 0x000460, "Member 'UAthenaTeamMemberInfo_C::Overlay_PlayerStateExtensions' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, SizeBox_PlayerStates) == 0x000468, "Member 'UAthenaTeamMemberInfo_C::SizeBox_PlayerStates' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, DBNOPulseTimer) == 0x000470, "Member 'UAthenaTeamMemberInfo_C::DBNOPulseTimer' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, RelevantPlaylistTags) == 0x000478, "Member 'UAthenaTeamMemberInfo_C::RelevantPlaylistTags' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, bIsTalking) == 0x000498, "Member 'UAthenaTeamMemberInfo_C::bIsTalking' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberInfo_C, bShowBackgroundOverridden) == 0x000499, "Member 'UAthenaTeamMemberInfo_C::bShowBackgroundOverridden' has a wrong offset!");

}

