#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryItemTileButton_Currency

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryItemTileButton_Currency.AthenaInventoryItemTileButton_Currency_C
// 0x0020 (0x0F30 - 0x0F10)
class UAthenaInventoryItemTileButton_Currency_C final : public UAthenaInventoryItemTileButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_0;                                          // 0x0F18(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisualAttachment*                InputActionWrapper;                                // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply OnMouseButtonDown_Border(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void UpdateInteractionWidgetVisibility();
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void HandleIntro();
	void ExecuteUbergraph_AthenaInventoryItemTileButton_Currency(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryItemTileButton_Currency_C">();
	}
	static class UAthenaInventoryItemTileButton_Currency_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryItemTileButton_Currency_C>();
	}
};
static_assert(alignof(UAthenaInventoryItemTileButton_Currency_C) == 0x000010, "Wrong alignment on UAthenaInventoryItemTileButton_Currency_C");
static_assert(sizeof(UAthenaInventoryItemTileButton_Currency_C) == 0x000F30, "Wrong size on UAthenaInventoryItemTileButton_Currency_C");
static_assert(offsetof(UAthenaInventoryItemTileButton_Currency_C, UberGraphFrame) == 0x000F10, "Member 'UAthenaInventoryItemTileButton_Currency_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryItemTileButton_Currency_C, Border_0) == 0x000F18, "Member 'UAthenaInventoryItemTileButton_Currency_C::Border_0' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryItemTileButton_Currency_C, InputActionWrapper) == 0x000F20, "Member 'UAthenaInventoryItemTileButton_Currency_C::InputActionWrapper' has a wrong offset!");

}

