#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemDetailsHeader

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaItemDetailsHeader.AthenaItemDetailsHeader_C
// 0x01A8 (0x04E8 - 0x0340)
class UAthenaItemDetailsHeader_C final : public UFortItemDetailsHostPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       AmmoLoadedText;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       AmmoLoadedText_2;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemCategoryIndicator*             CategoryIndicator;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemCategoryIndicator*             CategoryIndicatorTertiary;                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemCategoryIndicator*             CategoryIndicatorTertiary_2;                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_Stack;                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CraftingIngredientBox;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CraftingLabel;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Tertiary2;                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                IconSpacer;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_MinimalIconPreview;                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RarityGlow;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemCostWidget_C*                      ItemCostWidget;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemCostWidget_C*                      ItemCostWidgetShort;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemDetailsHeaderItemDisplayText_C*    ItemDetailsHeaderItemDisplayText;                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemDetailsStackCounter_C*             ItemDetailsStackCounter;                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          LevelBar;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          RarityBorder;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        RatingSwitcher;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SlotsCount;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TagListBox;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TertiaryRow;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ItemNameShort;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ItemNameShort_Amount;                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_WeaponName;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_WeaponRarityValue;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortTierIndicator*                     TierIndicator;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RarityBorderMID;                                   // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRarityItemData                    RarityData;                                        // 0x0428(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               Level_Bar_MID;                                     // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LockItemColor;                                     // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Ammo_Header;                                  // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          MinimalAmmoTooltip;                                // 0x04C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2[0x6];                                      // 0x04C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InifinteText;                                      // 0x04C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	int32                                         NoAmmoSwitcherIndex;                               // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateItemsForWidgets();
	void SetStyles();
	void SetItemCost(class AActor* Actor);
	void OnInitialized();
	void HandleItemToDetailChangedBP();
	void HandleDifferentItemToDetailSet();
	void HandleDifferentItemToCompareSet();
	void ExecuteUbergraph_AthenaItemDetailsHeader(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaItemDetailsHeader_C">();
	}
	static class UAthenaItemDetailsHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemDetailsHeader_C>();
	}
};
static_assert(alignof(UAthenaItemDetailsHeader_C) == 0x000008, "Wrong alignment on UAthenaItemDetailsHeader_C");
static_assert(sizeof(UAthenaItemDetailsHeader_C) == 0x0004E8, "Wrong size on UAthenaItemDetailsHeader_C");
static_assert(offsetof(UAthenaItemDetailsHeader_C, UberGraphFrame) == 0x000340, "Member 'UAthenaItemDetailsHeader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, AmmoLoadedText) == 0x000348, "Member 'UAthenaItemDetailsHeader_C::AmmoLoadedText' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, AmmoLoadedText_2) == 0x000350, "Member 'UAthenaItemDetailsHeader_C::AmmoLoadedText_2' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, CategoryIndicator) == 0x000358, "Member 'UAthenaItemDetailsHeader_C::CategoryIndicator' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, CategoryIndicatorTertiary) == 0x000360, "Member 'UAthenaItemDetailsHeader_C::CategoryIndicatorTertiary' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, CategoryIndicatorTertiary_2) == 0x000368, "Member 'UAthenaItemDetailsHeader_C::CategoryIndicatorTertiary_2' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, CommonWidgetSwitcher_Stack) == 0x000370, "Member 'UAthenaItemDetailsHeader_C::CommonWidgetSwitcher_Stack' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, CraftingIngredientBox) == 0x000378, "Member 'UAthenaItemDetailsHeader_C::CraftingIngredientBox' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, CraftingLabel) == 0x000380, "Member 'UAthenaItemDetailsHeader_C::CraftingLabel' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, HorizontalBox_Tertiary2) == 0x000388, "Member 'UAthenaItemDetailsHeader_C::HorizontalBox_Tertiary2' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, IconSpacer) == 0x000390, "Member 'UAthenaItemDetailsHeader_C::IconSpacer' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, Image_MinimalIconPreview) == 0x000398, "Member 'UAthenaItemDetailsHeader_C::Image_MinimalIconPreview' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, Image_RarityGlow) == 0x0003A0, "Member 'UAthenaItemDetailsHeader_C::Image_RarityGlow' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, ItemCostWidget) == 0x0003A8, "Member 'UAthenaItemDetailsHeader_C::ItemCostWidget' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, ItemCostWidgetShort) == 0x0003B0, "Member 'UAthenaItemDetailsHeader_C::ItemCostWidgetShort' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, ItemDetailsHeaderItemDisplayText) == 0x0003B8, "Member 'UAthenaItemDetailsHeader_C::ItemDetailsHeaderItemDisplayText' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, ItemDetailsStackCounter) == 0x0003C0, "Member 'UAthenaItemDetailsHeader_C::ItemDetailsStackCounter' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, LevelBar) == 0x0003C8, "Member 'UAthenaItemDetailsHeader_C::LevelBar' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, RarityBorder) == 0x0003D0, "Member 'UAthenaItemDetailsHeader_C::RarityBorder' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, RatingSwitcher) == 0x0003D8, "Member 'UAthenaItemDetailsHeader_C::RatingSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, SlotsCount) == 0x0003E0, "Member 'UAthenaItemDetailsHeader_C::SlotsCount' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, TagListBox) == 0x0003E8, "Member 'UAthenaItemDetailsHeader_C::TagListBox' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, TertiaryRow) == 0x0003F0, "Member 'UAthenaItemDetailsHeader_C::TertiaryRow' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, Text_ItemNameShort) == 0x0003F8, "Member 'UAthenaItemDetailsHeader_C::Text_ItemNameShort' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, Text_ItemNameShort_Amount) == 0x000400, "Member 'UAthenaItemDetailsHeader_C::Text_ItemNameShort_Amount' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, Text_WeaponName) == 0x000408, "Member 'UAthenaItemDetailsHeader_C::Text_WeaponName' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, Text_WeaponRarityValue) == 0x000410, "Member 'UAthenaItemDetailsHeader_C::Text_WeaponRarityValue' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, TierIndicator) == 0x000418, "Member 'UAthenaItemDetailsHeader_C::TierIndicator' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, RarityBorderMID) == 0x000420, "Member 'UAthenaItemDetailsHeader_C::RarityBorderMID' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, RarityData) == 0x000428, "Member 'UAthenaItemDetailsHeader_C::RarityData' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, Level_Bar_MID) == 0x0004A8, "Member 'UAthenaItemDetailsHeader_C::Level_Bar_MID' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, LockItemColor) == 0x0004B0, "Member 'UAthenaItemDetailsHeader_C::LockItemColor' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, Show_Ammo_Header) == 0x0004C0, "Member 'UAthenaItemDetailsHeader_C::Show_Ammo_Header' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, MinimalAmmoTooltip) == 0x0004C1, "Member 'UAthenaItemDetailsHeader_C::MinimalAmmoTooltip' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, InifinteText) == 0x0004C8, "Member 'UAthenaItemDetailsHeader_C::InifinteText' has a wrong offset!");
static_assert(offsetof(UAthenaItemDetailsHeader_C, NoAmmoSwitcherIndex) == 0x0004E0, "Member 'UAthenaItemDetailsHeader_C::NoAmmoSwitcherIndex' has a wrong offset!");

}

