#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDItemList

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaHUDItemList.AthenaHUDItemList_C.ExecuteUbergraph_AthenaHUDItemList
// 0x0010 (0x0010 - 0x0000)
struct AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList) == 0x000004, "Wrong alignment on AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList");
static_assert(sizeof(AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList) == 0x000010, "Wrong size on AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList");
static_assert(offsetof(AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList, EntryPoint) == 0x000000, "Member 'AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList, Temp_bool_Variable) == 0x000004, "Member 'AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList, Temp_byte_Variable) == 0x000005, "Member 'AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList, Temp_byte_Variable_1) == 0x000006, "Member 'AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList, CallFunc_GetNumItems_ReturnValue) == 0x000008, "Member 'AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList, K2Node_Select_Default) == 0x00000D, "Member 'AthenaHUDItemList_C_ExecuteUbergraph_AthenaHUDItemList::K2Node_Select_Default' has a wrong offset!");

}

