#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemIconResource_Currency

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaItemIconResource_Currency.AthenaItemIconResource_Currency_C
// 0x0048 (0x0308 - 0x02C0)
class UAthenaItemIconResource_Currency_C final : public UAthenaItemIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_Empty;                                       // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Empty;                                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Populated;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       X;                                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         RandomFloat_Top;                                   // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Left;                                  // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Right;                                 // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Bottom;                                // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetFontMaterial();
	void SetHoveredState(bool bIsHovered);
	void RandomizeAngleFloats();
	void OnPostItemToRepresentChanged(const class UFortItem* ItemToRepresent);
	void IntroAnim();
	void ExecuteUbergraph_AthenaItemIconResource_Currency(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaItemIconResource_Currency_C">();
	}
	static class UAthenaItemIconResource_Currency_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemIconResource_Currency_C>();
	}
};
static_assert(alignof(UAthenaItemIconResource_Currency_C) == 0x000008, "Wrong alignment on UAthenaItemIconResource_Currency_C");
static_assert(sizeof(UAthenaItemIconResource_Currency_C) == 0x000308, "Wrong size on UAthenaItemIconResource_Currency_C");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, UberGraphFrame) == 0x0002C0, "Member 'UAthenaItemIconResource_Currency_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, Hover_Empty) == 0x0002C8, "Member 'UAthenaItemIconResource_Currency_C::Hover_Empty' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, Intro) == 0x0002D0, "Member 'UAthenaItemIconResource_Currency_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, Hover) == 0x0002D8, "Member 'UAthenaItemIconResource_Currency_C::Hover' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, Empty) == 0x0002E0, "Member 'UAthenaItemIconResource_Currency_C::Empty' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, Populated) == 0x0002E8, "Member 'UAthenaItemIconResource_Currency_C::Populated' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, X) == 0x0002F0, "Member 'UAthenaItemIconResource_Currency_C::X' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, RandomFloat_Top) == 0x0002F8, "Member 'UAthenaItemIconResource_Currency_C::RandomFloat_Top' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, RandomFloat_Left) == 0x0002FC, "Member 'UAthenaItemIconResource_Currency_C::RandomFloat_Left' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, RandomFloat_Right) == 0x000300, "Member 'UAthenaItemIconResource_Currency_C::RandomFloat_Right' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, RandomFloat_Bottom) == 0x000304, "Member 'UAthenaItemIconResource_Currency_C::RandomFloat_Bottom' has a wrong offset!");

}

