#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaVehicleFeedback

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaVehicleFeedback.AthenaVehicleFeedback_C.OnPiPBlockPlayer
// 0x0001 (0x0001 - 0x0000)
struct AthenaVehicleFeedback_C_OnPiPBlockPlayer final
{
public:
	bool                                          PIPIsBlocking;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaVehicleFeedback_C_OnPiPBlockPlayer) == 0x000001, "Wrong alignment on AthenaVehicleFeedback_C_OnPiPBlockPlayer");
static_assert(sizeof(AthenaVehicleFeedback_C_OnPiPBlockPlayer) == 0x000001, "Wrong size on AthenaVehicleFeedback_C_OnPiPBlockPlayer");
static_assert(offsetof(AthenaVehicleFeedback_C_OnPiPBlockPlayer, PIPIsBlocking) == 0x000000, "Member 'AthenaVehicleFeedback_C_OnPiPBlockPlayer::PIPIsBlocking' has a wrong offset!");

// Function AthenaVehicleFeedback.AthenaVehicleFeedback_C.OnLocalChallengesVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaVehicleFeedback_C_OnLocalChallengesVisibilityChanged final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaVehicleFeedback_C_OnLocalChallengesVisibilityChanged) == 0x000001, "Wrong alignment on AthenaVehicleFeedback_C_OnLocalChallengesVisibilityChanged");
static_assert(sizeof(AthenaVehicleFeedback_C_OnLocalChallengesVisibilityChanged) == 0x000001, "Wrong size on AthenaVehicleFeedback_C_OnLocalChallengesVisibilityChanged");
static_assert(offsetof(AthenaVehicleFeedback_C_OnLocalChallengesVisibilityChanged, bIsVisible) == 0x000000, "Member 'AthenaVehicleFeedback_C_OnLocalChallengesVisibilityChanged::bIsVisible' has a wrong offset!");

// Function AthenaVehicleFeedback.AthenaVehicleFeedback_C.ExecuteUbergraph_AthenaVehicleFeedback
// 0x0150 (0x0150 - 0x0000)
struct AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue;         // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDFeedbackLine_C*               CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool PIPIsBlocking)>           K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalChallengesVisible_ReturnValue;     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsVisible;                     // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsVisible)>              K2Node_CreateDelegate_OutputDelegate_5;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULiveStreamPiPBlockManager*             CallFunc_GetPiPBlockManager_ReturnValue;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULiveStreamPiPBlockManager*             CallFunc_GetPiPBlockManager_ReturnValue_1;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerBlocked_ReturnValue;              // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_PIPIsBlocking;                  // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_2;                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool PIPIsBlocking)>           K2Node_CreateDelegate_OutputDelegate_6;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback) == 0x000008, "Wrong alignment on AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback");
static_assert(sizeof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback) == 0x000150, "Wrong size on AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, EntryPoint) == 0x000000, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_K2_GetPawn_ReturnValue) == 0x000028, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000030, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000048, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetVehicleUInterface_ReturnValue) == 0x000068, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetVehicleUInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CreateDelegate_OutputDelegate_2) == 0x000078, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000088, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, Temp_int_Array_Index_Variable) == 0x000098, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Array_Get_Item) == 0x00009C, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetChildrenCount_ReturnValue) == 0x0000A4, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000A8, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, Temp_int_Loop_Counter_Variable) == 0x0000AC, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetContext_ReturnValue) == 0x0000B0, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C8, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_AddChild_ReturnValue) == 0x0000D0, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E8, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetContext_ReturnValue_1) == 0x0000F8, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, Temp_byte_Variable) == 0x000100, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_IsLocalChallengesVisible_ReturnValue) == 0x000101, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_IsLocalChallengesVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CustomEvent_bIsVisible) == 0x000102, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CustomEvent_bIsVisible' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CreateDelegate_OutputDelegate_5) == 0x000104, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, Temp_byte_Variable_1) == 0x000114, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetPiPBlockManager_ReturnValue) == 0x000118, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetPiPBlockManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetPiPBlockManager_ReturnValue_1) == 0x000120, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetPiPBlockManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_IsValid_ReturnValue_2) == 0x000128, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_IsValid_ReturnValue_3) == 0x000129, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_IsPlayerBlocked_ReturnValue) == 0x00012A, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_IsPlayerBlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CustomEvent_PIPIsBlocking) == 0x00012B, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CustomEvent_PIPIsBlocking' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetContext_ReturnValue_2) == 0x000130, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, Temp_bool_Variable) == 0x000138, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CreateDelegate_OutputDelegate_6) == 0x00013C, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_Select_Default) == 0x00014C, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_Select_Default' has a wrong offset!");

// Function AthenaVehicleFeedback.AthenaVehicleFeedback_C.GetKeybindInputType
// 0x0030 (0x0030 - 0x0000)
struct AthenaVehicleFeedback_C_GetKeybindInputType final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDFeedbackLine_C*               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDFeedbackLine_C*               CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaVehicleFeedback_C_GetKeybindInputType) == 0x000008, "Wrong alignment on AthenaVehicleFeedback_C_GetKeybindInputType");
static_assert(sizeof(AthenaVehicleFeedback_C_GetKeybindInputType) == 0x000030, "Wrong size on AthenaVehicleFeedback_C_GetKeybindInputType");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, InputType) == 0x000000, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::InputType' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_GetCurrentInputType_ReturnValue) == 0x000018, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

