#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEquipProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaEquipProgress.AthenaEquipProgress_C
// 0x0010 (0x0318 - 0x0308)
class UAthenaEquipProgress_C final : public UFortHUDEquipProgressBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TextScaleUnderOneSecond;                           // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TextScaleOverOneSecond;                            // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTextScale(float TimeRemaining);
	void OnTimeRemainingChanged(const float TimeRemaining);
	void OnProgressStarted(const float Duration);
	void OnProgressEnded();
	void OnInitialized();
	void ExecuteUbergraph_AthenaEquipProgress(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaEquipProgress_C">();
	}
	static class UAthenaEquipProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEquipProgress_C>();
	}
};
static_assert(alignof(UAthenaEquipProgress_C) == 0x000008, "Wrong alignment on UAthenaEquipProgress_C");
static_assert(sizeof(UAthenaEquipProgress_C) == 0x000318, "Wrong size on UAthenaEquipProgress_C");
static_assert(offsetof(UAthenaEquipProgress_C, UberGraphFrame) == 0x000308, "Member 'UAthenaEquipProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, TextScaleUnderOneSecond) == 0x000310, "Member 'UAthenaEquipProgress_C::TextScaleUnderOneSecond' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, TextScaleOverOneSecond) == 0x000314, "Member 'UAthenaEquipProgress_C::TextScaleOverOneSecond' has a wrong offset!");

}

