#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuickbarSecondary

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AthenaQuickbarSecondary.AthenaQuickbarSecondary_C.Show Secondary Quickbar Rail
// 0x0005 (0x0005 - 0x0000)
struct AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail) == 0x000001, "Wrong alignment on AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail");
static_assert(sizeof(AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail) == 0x000005, "Wrong size on AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail");
static_assert(offsetof(AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail, Show) == 0x000000, "Member 'AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail::Show' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail, Temp_bool_Variable) == 0x000001, "Member 'AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail, Temp_byte_Variable) == 0x000002, "Member 'AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail, Temp_byte_Variable_1) == 0x000003, "Member 'AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail, K2Node_Select_Default) == 0x000004, "Member 'AthenaQuickbarSecondary_C_Show_Secondary_Quickbar_Rail::K2Node_Select_Default' has a wrong offset!");

// Function AthenaQuickbarSecondary.AthenaQuickbarSecondary_C.SetQuickBarNativeMode
// 0x0001 (0x0001 - 0x0000)
struct AthenaQuickbarSecondary_C_SetQuickBarNativeMode final
{
public:
	bool                                          bNativeMode;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarSecondary_C_SetQuickBarNativeMode) == 0x000001, "Wrong alignment on AthenaQuickbarSecondary_C_SetQuickBarNativeMode");
static_assert(sizeof(AthenaQuickbarSecondary_C_SetQuickBarNativeMode) == 0x000001, "Wrong size on AthenaQuickbarSecondary_C_SetQuickBarNativeMode");
static_assert(offsetof(AthenaQuickbarSecondary_C_SetQuickBarNativeMode, bNativeMode) == 0x000000, "Member 'AthenaQuickbarSecondary_C_SetQuickBarNativeMode::bNativeMode' has a wrong offset!");

// Function AthenaQuickbarSecondary.AthenaQuickbarSecondary_C.OnUnableToPerformAction
// 0x0038 (0x0038 - 0x0000)
struct AthenaQuickbarSecondary_C_OnUnableToPerformAction final
{
public:
	struct FGameplayTagContainer                  FailedReason;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   FailureText;                                       // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaQuickbarSecondary_C_OnUnableToPerformAction) == 0x000008, "Wrong alignment on AthenaQuickbarSecondary_C_OnUnableToPerformAction");
static_assert(sizeof(AthenaQuickbarSecondary_C_OnUnableToPerformAction) == 0x000038, "Wrong size on AthenaQuickbarSecondary_C_OnUnableToPerformAction");
static_assert(offsetof(AthenaQuickbarSecondary_C_OnUnableToPerformAction, FailedReason) == 0x000000, "Member 'AthenaQuickbarSecondary_C_OnUnableToPerformAction::FailedReason' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_OnUnableToPerformAction, FailureText) == 0x000020, "Member 'AthenaQuickbarSecondary_C_OnUnableToPerformAction::FailureText' has a wrong offset!");

// Function AthenaQuickbarSecondary.AthenaQuickbarSecondary_C.OnQuickBarSlotFocusChanged_Bind
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuickbarSecondary_C_OnQuickBarSlotFocusChanged_Bind final
{
public:
	EFortQuickBars                                QuickbarIndex;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Slot_0;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarSecondary_C_OnQuickBarSlotFocusChanged_Bind) == 0x000004, "Wrong alignment on AthenaQuickbarSecondary_C_OnQuickBarSlotFocusChanged_Bind");
static_assert(sizeof(AthenaQuickbarSecondary_C_OnQuickBarSlotFocusChanged_Bind) == 0x000008, "Wrong size on AthenaQuickbarSecondary_C_OnQuickBarSlotFocusChanged_Bind");
static_assert(offsetof(AthenaQuickbarSecondary_C_OnQuickBarSlotFocusChanged_Bind, QuickbarIndex) == 0x000000, "Member 'AthenaQuickbarSecondary_C_OnQuickBarSlotFocusChanged_Bind::QuickbarIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_OnQuickBarSlotFocusChanged_Bind, Slot_0) == 0x000004, "Member 'AthenaQuickbarSecondary_C_OnQuickBarSlotFocusChanged_Bind::Slot_0' has a wrong offset!");

// Function AthenaQuickbarSecondary.AthenaQuickbarSecondary_C.OnQuickbarContentsChanged
// 0x0018 (0x0018 - 0x0000)
struct AthenaQuickbarSecondary_C_OnQuickbarContentsChanged final
{
public:
	EFortQuickBars                                QuickbarIndex;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ChangedSlots;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaQuickbarSecondary_C_OnQuickbarContentsChanged) == 0x000008, "Wrong alignment on AthenaQuickbarSecondary_C_OnQuickbarContentsChanged");
static_assert(sizeof(AthenaQuickbarSecondary_C_OnQuickbarContentsChanged) == 0x000018, "Wrong size on AthenaQuickbarSecondary_C_OnQuickbarContentsChanged");
static_assert(offsetof(AthenaQuickbarSecondary_C_OnQuickbarContentsChanged, QuickbarIndex) == 0x000000, "Member 'AthenaQuickbarSecondary_C_OnQuickbarContentsChanged::QuickbarIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_OnQuickbarContentsChanged, ChangedSlots) == 0x000008, "Member 'AthenaQuickbarSecondary_C_OnQuickbarContentsChanged::ChangedSlots' has a wrong offset!");

// Function AthenaQuickbarSecondary.AthenaQuickbarSecondary_C.HandleShowHideRail
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuickbarSecondary_C_HandleShowHideRail final
{
public:
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarSecondary_C_HandleShowHideRail) == 0x000008, "Wrong alignment on AthenaQuickbarSecondary_C_HandleShowHideRail");
static_assert(sizeof(AthenaQuickbarSecondary_C_HandleShowHideRail) == 0x000010, "Wrong size on AthenaQuickbarSecondary_C_HandleShowHideRail");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleShowHideRail, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'AthenaQuickbarSecondary_C_HandleShowHideRail::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleShowHideRail, CallFunc_GetCurrentInputType_ReturnValue) == 0x000008, "Member 'AthenaQuickbarSecondary_C_HandleShowHideRail::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleShowHideRail, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'AthenaQuickbarSecondary_C_HandleShowHideRail::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AthenaQuickbarSecondary.AthenaQuickbarSecondary_C.HandleKeyBindsChange
// 0x0030 (0x0030 - 0x0000)
struct AthenaQuickbarSecondary_C_HandleKeyBindsChange final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuickBarSlotBase*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSwitchQuickBarActionName_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarSecondary_C_HandleKeyBindsChange) == 0x000008, "Wrong alignment on AthenaQuickbarSecondary_C_HandleKeyBindsChange");
static_assert(sizeof(AthenaQuickbarSecondary_C_HandleKeyBindsChange) == 0x000030, "Wrong size on AthenaQuickbarSecondary_C_HandleKeyBindsChange");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleKeyBindsChange, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaQuickbarSecondary_C_HandleKeyBindsChange::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleKeyBindsChange, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaQuickbarSecondary_C_HandleKeyBindsChange::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleKeyBindsChange, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaQuickbarSecondary_C_HandleKeyBindsChange::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleKeyBindsChange, CallFunc_GetSwitchQuickBarActionName_ReturnValue) == 0x000018, "Member 'AthenaQuickbarSecondary_C_HandleKeyBindsChange::CallFunc_GetSwitchQuickBarActionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleKeyBindsChange, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'AthenaQuickbarSecondary_C_HandleKeyBindsChange::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleKeyBindsChange, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'AthenaQuickbarSecondary_C_HandleKeyBindsChange::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleKeyBindsChange, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'AthenaQuickbarSecondary_C_HandleKeyBindsChange::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleKeyBindsChange, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaQuickbarSecondary_C_HandleKeyBindsChange::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaQuickbarSecondary.AthenaQuickbarSecondary_C.HandleInputMethodChanged_Bind
// 0x0001 (0x0001 - 0x0000)
struct AthenaQuickbarSecondary_C_HandleInputMethodChanged_Bind final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarSecondary_C_HandleInputMethodChanged_Bind) == 0x000001, "Wrong alignment on AthenaQuickbarSecondary_C_HandleInputMethodChanged_Bind");
static_assert(sizeof(AthenaQuickbarSecondary_C_HandleInputMethodChanged_Bind) == 0x000001, "Wrong size on AthenaQuickbarSecondary_C_HandleInputMethodChanged_Bind");
static_assert(offsetof(AthenaQuickbarSecondary_C_HandleInputMethodChanged_Bind, InputType) == 0x000000, "Member 'AthenaQuickbarSecondary_C_HandleInputMethodChanged_Bind::InputType' has a wrong offset!");

// Function AthenaQuickbarSecondary.AthenaQuickbarSecondary_C.GetSpecificSlot
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuickbarSecondary_C_GetSpecificSlot final
{
public:
	int32                                         SlotNumber;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuickBarSlotBase*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarSecondary_C_GetSpecificSlot) == 0x000008, "Wrong alignment on AthenaQuickbarSecondary_C_GetSpecificSlot");
static_assert(sizeof(AthenaQuickbarSecondary_C_GetSpecificSlot) == 0x000010, "Wrong size on AthenaQuickbarSecondary_C_GetSpecificSlot");
static_assert(offsetof(AthenaQuickbarSecondary_C_GetSpecificSlot, SlotNumber) == 0x000000, "Member 'AthenaQuickbarSecondary_C_GetSpecificSlot::SlotNumber' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_GetSpecificSlot, ReturnValue) == 0x000008, "Member 'AthenaQuickbarSecondary_C_GetSpecificSlot::ReturnValue' has a wrong offset!");

// Function AthenaQuickbarSecondary.AthenaQuickbarSecondary_C.ExecuteUbergraph_AthenaQuickbarSecondary
// 0x0190 (0x0190 - 0x0000)
struct AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	ECommonInputType                              K2Node_CustomEvent_InputType;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	EFortQuickBars                                K2Node_CustomEvent_QuickbarIndex;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Slot;                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortQuickBars QuickbarIndex, int32 Slot)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	EFortQuickBars                                K2Node_Event_QuickbarIndex;                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_Event_ChangedSlots;                         // 0x0088(0x0010)(ConstParm, ReferenceParm)
	TArray<class UFortQuickBarSlotBase*>          K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTagContainer                  K2Node_CustomEvent_FailedReason;                   // 0x00B8(0x0020)()
	class FText                                   K2Node_CustomEvent_FailureText;                    // 0x00D8(0x0018)(ConstParm)
	TDelegate<void(const struct FGameplayTagContainer& FailedReason, class FText& FailureText)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& FailedReason, class FText& FailureText)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_1;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_2;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue_2;                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_3;                 // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary) == 0x000008, "Wrong alignment on AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary");
static_assert(sizeof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary) == 0x000190, "Wrong size on AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, EntryPoint) == 0x000000, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, Temp_bool_Variable) == 0x000020, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CustomEvent_InputType) == 0x000040, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CustomEvent_InputType' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CustomEvent_QuickbarIndex) == 0x000064, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CustomEvent_QuickbarIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CustomEvent_Slot) == 0x000068, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CustomEvent_Slot' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006C, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CreateDelegate_OutputDelegate_4) == 0x000070, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_Event_QuickbarIndex) == 0x000080, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_Event_QuickbarIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_Event_ChangedSlots) == 0x000088, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_Event_ChangedSlots' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_MakeArray_Array) == 0x000098, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000A8, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CustomEvent_FailedReason) == 0x0000B8, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CustomEvent_FailedReason' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CustomEvent_FailureText) == 0x0000D8, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CustomEvent_FailureText' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000F0, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_HasTag_ReturnValue) == 0x000100, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_GetContext_ReturnValue_1) == 0x000108, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_CreateDelegate_OutputDelegate_7) == 0x000110, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000120, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000128, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_GetOwningPlayerPawn_ReturnValue_1) == 0x000130, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_GetOwningPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000138, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue) == 0x000140, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_IsValid_ReturnValue_1) == 0x000149, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_GetOwningPlayerPawn_ReturnValue_2) == 0x000150, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_GetOwningPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000158, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_GetContext_ReturnValue_2) == 0x000170, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000178, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_GetContext_ReturnValue_3) == 0x000180, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000188, "Member 'AthenaQuickbarSecondary_C_ExecuteUbergraph_AthenaQuickbarSecondary::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");

// Function AthenaQuickbarSecondary.AthenaQuickbarSecondary_C.BuildModeUpdated
// 0x0048 (0x0048 - 0x0000)
struct AthenaQuickbarSecondary_C_BuildModeUpdated final
{
public:
	bool                                          bBuildingBlocked;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuickBarSlotBase*                  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaQuickBarSlot_C*                  K2Node_DynamicCast_AsAthena_Quick_Bar_Slot;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarSecondary_C_BuildModeUpdated) == 0x000008, "Wrong alignment on AthenaQuickbarSecondary_C_BuildModeUpdated");
static_assert(sizeof(AthenaQuickbarSecondary_C_BuildModeUpdated) == 0x000048, "Wrong size on AthenaQuickbarSecondary_C_BuildModeUpdated");
static_assert(offsetof(AthenaQuickbarSecondary_C_BuildModeUpdated, bBuildingBlocked) == 0x000000, "Member 'AthenaQuickbarSecondary_C_BuildModeUpdated::bBuildingBlocked' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_BuildModeUpdated, Temp_bool_Variable) == 0x000001, "Member 'AthenaQuickbarSecondary_C_BuildModeUpdated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarSecondary_C_BuildModeUpdated, Temp_byte_Variable) == 0x000002, "Member 'AthenaQuickbarSecondary_C_BuildModeUpdated::Temp_byte_Variable' has a wrong offset!");
