#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpecialEventChallengeEntry

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaSpecialEventChallengeEntry.AthenaSpecialEventChallengeEntry_C.StyleLastElement
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpecialEventChallengeEntry_C_StyleLastElement final
{
public:
	bool                                          isLast;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpecialEventChallengeEntry_C_StyleLastElement) == 0x000001, "Wrong alignment on AthenaSpecialEventChallengeEntry_C_StyleLastElement");
static_assert(sizeof(AthenaSpecialEventChallengeEntry_C_StyleLastElement) == 0x000001, "Wrong size on AthenaSpecialEventChallengeEntry_C_StyleLastElement");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_StyleLastElement, isLast) == 0x000000, "Member 'AthenaSpecialEventChallengeEntry_C_StyleLastElement::isLast' has a wrong offset!");

// Function AthenaSpecialEventChallengeEntry.AthenaSpecialEventChallengeEntry_C.OnUpdateBountyThreatLevel
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpecialEventChallengeEntry_C_OnUpdateBountyThreatLevel final
{
public:
	EPlayerBountyThreatLevel                      NewPlayerBountyThreatLevel;                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpecialEventChallengeEntry_C_OnUpdateBountyThreatLevel) == 0x000001, "Wrong alignment on AthenaSpecialEventChallengeEntry_C_OnUpdateBountyThreatLevel");
static_assert(sizeof(AthenaSpecialEventChallengeEntry_C_OnUpdateBountyThreatLevel) == 0x000001, "Wrong size on AthenaSpecialEventChallengeEntry_C_OnUpdateBountyThreatLevel");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_OnUpdateBountyThreatLevel, NewPlayerBountyThreatLevel) == 0x000000, "Member 'AthenaSpecialEventChallengeEntry_C_OnUpdateBountyThreatLevel::NewPlayerBountyThreatLevel' has a wrong offset!");

// Function AthenaSpecialEventChallengeEntry.AthenaSpecialEventChallengeEntry_C.OnLoaded_CF580B9642CB35C0D01098B54EFEBF2D
// 0x0008 (0x0008 - 0x0000)
struct AthenaSpecialEventChallengeEntry_C_OnLoaded_CF580B9642CB35C0D01098B54EFEBF2D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpecialEventChallengeEntry_C_OnLoaded_CF580B9642CB35C0D01098B54EFEBF2D) == 0x000008, "Wrong alignment on AthenaSpecialEventChallengeEntry_C_OnLoaded_CF580B9642CB35C0D01098B54EFEBF2D");
static_assert(sizeof(AthenaSpecialEventChallengeEntry_C_OnLoaded_CF580B9642CB35C0D01098B54EFEBF2D) == 0x000008, "Wrong size on AthenaSpecialEventChallengeEntry_C_OnLoaded_CF580B9642CB35C0D01098B54EFEBF2D");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_OnLoaded_CF580B9642CB35C0D01098B54EFEBF2D, Loaded) == 0x000000, "Member 'AthenaSpecialEventChallengeEntry_C_OnLoaded_CF580B9642CB35C0D01098B54EFEBF2D::Loaded' has a wrong offset!");

// Function AthenaSpecialEventChallengeEntry.AthenaSpecialEventChallengeEntry_C.OnEntrySetup
// 0x0138 (0x0138 - 0x0000)
struct AthenaSpecialEventChallengeEntry_C_OnEntrySetup final
{
public:
	struct FUrgentQuestData                       UrgentQuestData;                                   // 0x0000(0x0130)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bUrgentQuestRecentlyStarted;                       // 0x0130(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpecialEventChallengeEntry_C_OnEntrySetup) == 0x000008, "Wrong alignment on AthenaSpecialEventChallengeEntry_C_OnEntrySetup");
static_assert(sizeof(AthenaSpecialEventChallengeEntry_C_OnEntrySetup) == 0x000138, "Wrong size on AthenaSpecialEventChallengeEntry_C_OnEntrySetup");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_OnEntrySetup, UrgentQuestData) == 0x000000, "Member 'AthenaSpecialEventChallengeEntry_C_OnEntrySetup::UrgentQuestData' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_OnEntrySetup, bUrgentQuestRecentlyStarted) == 0x000130, "Member 'AthenaSpecialEventChallengeEntry_C_OnEntrySetup::bUrgentQuestRecentlyStarted' has a wrong offset!");

// Function AthenaSpecialEventChallengeEntry.AthenaSpecialEventChallengeEntry_C.OnBountyThreatInformationVisibilityChange
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpecialEventChallengeEntry_C_OnBountyThreatInformationVisibilityChange final
{
public:
	ESlateVisibility                              NewVisibilty;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpecialEventChallengeEntry_C_OnBountyThreatInformationVisibilityChange) == 0x000001, "Wrong alignment on AthenaSpecialEventChallengeEntry_C_OnBountyThreatInformationVisibilityChange");
static_assert(sizeof(AthenaSpecialEventChallengeEntry_C_OnBountyThreatInformationVisibilityChange) == 0x000001, "Wrong size on AthenaSpecialEventChallengeEntry_C_OnBountyThreatInformationVisibilityChange");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_OnBountyThreatInformationVisibilityChange, NewVisibilty) == 0x000000, "Member 'AthenaSpecialEventChallengeEntry_C_OnBountyThreatInformationVisibilityChange::NewVisibilty' has a wrong offset!");

// Function AthenaSpecialEventChallengeEntry.AthenaSpecialEventChallengeEntry_C.HandleDefaultCase
// 0x0040 (0x0040 - 0x0000)
struct AthenaSpecialEventChallengeEntry_C_HandleDefaultCase final
{
public:
	struct FLinearColor                           inAlertIconBorderColor;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
	bool                                          CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x002C(0x0014)()
};
static_assert(alignof(AthenaSpecialEventChallengeEntry_C_HandleDefaultCase) == 0x000004, "Wrong alignment on AthenaSpecialEventChallengeEntry_C_HandleDefaultCase");
static_assert(sizeof(AthenaSpecialEventChallengeEntry_C_HandleDefaultCase) == 0x000040, "Wrong size on AthenaSpecialEventChallengeEntry_C_HandleDefaultCase");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_HandleDefaultCase, inAlertIconBorderColor) == 0x000000, "Member 'AthenaSpecialEventChallengeEntry_C_HandleDefaultCase::inAlertIconBorderColor' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_HandleDefaultCase, Temp_bool_Variable) == 0x000010, "Member 'AthenaSpecialEventChallengeEntry_C_HandleDefaultCase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_HandleDefaultCase, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'AthenaSpecialEventChallengeEntry_C_HandleDefaultCase::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_HandleDefaultCase, CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue) == 0x000028, "Member 'AthenaSpecialEventChallengeEntry_C_HandleDefaultCase::CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_HandleDefaultCase, K2Node_Select_Default) == 0x00002C, "Member 'AthenaSpecialEventChallengeEntry_C_HandleDefaultCase::K2Node_Select_Default' has a wrong offset!");

// Function AthenaSpecialEventChallengeEntry.AthenaSpecialEventChallengeEntry_C.ExecuteUbergraph_AthenaSpecialEventChallengeEntry
// 0x0210 (0x0210 - 0x0000)
struct AthenaSpecialEventChallengeEntry_C_ExecuteUbergraph_AthenaSpecialEventChallengeEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerBountyThreatLevel                      Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerBountyThreatLevel                      Temp_byte_Variable_4;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerBountyThreatLevel                      K2Node_Event_NewPlayerBountyThreatLevel;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isLast;                         // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUrgentQuestData                       K2Node_Event_UrgentQuestData;                      // 0x0058(0x0130)(ConstParm)
	bool                                          K2Node_Event_bUrgentQuestRecentlyStarted;          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x01AC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Event_NewVisibilty;                         // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerBountyThreatLevel                      Temp_byte_Variable_5;                              // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_3;                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpecialEventChallengeEntry_C_ExecuteUbergraph_AthenaSpecialEventChallengeEntry) == 0x000008, "Wrong alignment on AthenaSpecialEventChallengeEntry_C_ExecuteUbergraph_AthenaSpecialEventChallengeEntry");
static_assert(sizeof(AthenaSpecialEventChallengeEntry_C_ExecuteUbergraph_AthenaSpecialEventChallengeEntry) == 0x000210, "Wrong size on AthenaSpecialEventChallengeEntry_C_ExecuteUbergraph_AthenaSpecialEventChallengeEntry");
static_assert(offsetof(AthenaSpecialEventChallengeEntry_C_ExecuteUbergraph_AthenaSpecialEventChallengeEntry, EntryPoint) == 0x000000, "Member 'AthenaSpecialEventChallengeEntry_C_ExecuteUbergraph_AthenaSpecialEventChallengeEntry::EntryPoint' has a wrong offset!");
