#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaGamePhaseChangeWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C
// 0x00C8 (0x03C8 - 0x0300)
class UAthenaGamePhaseChangeWidget_C final : public UAthenaHUDGamePhaseChangingBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BusIntro;                                          // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconSlide;                                         // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconPulse;                                         // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ModeChanged;                                       // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Content;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Feedback;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Bus;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SkewBG;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SkewBG_Shadow;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Skydive;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Message;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPapaya_ServerWarning_C*                ServerStatus;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_AlertType;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_BusIconState;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Bus_Line1;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_BusLine2;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_BusTimer;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TimeText;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTagContainer                  HideForSetupTags;                                  // 0x03A0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	EAthenaGamePhaseStep                          CurrentPhase;                                      // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ToggleCompass(bool Hide);
	void SequenceEvent__ENTRYPOINTAthenaGamePhaseChangeWidget_0();
	void PlayIntroAnimation(EAthenaGamePhaseStep Step);
	void PlayGamePhaseAlertSound(EAthenaGamePhaseStep Step);
	void On_AnimFinished();
	void ExecuteUbergraph_AthenaGamePhaseChangeWidget(int32 EntryPoint);
	void EventHandleJump();
	void Construct();
	void BusIntro_Audio();
	void BP_UpdateMessaging(const EAthenaGamePhaseStep Step, const class FText& Message_0, const class FText& TimeText_0);
	void BP_HandleGamePhaseStepChanged(const EAthenaGamePhaseStep Step);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaGamePhaseChangeWidget_C">();
	}
	static class UAthenaGamePhaseChangeWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGamePhaseChangeWidget_C>();
	}
};
static_assert(alignof(UAthenaGamePhaseChangeWidget_C) == 0x000008, "Wrong alignment on UAthenaGamePhaseChangeWidget_C");
static_assert(sizeof(UAthenaGamePhaseChangeWidget_C) == 0x0003C8, "Wrong size on UAthenaGamePhaseChangeWidget_C");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, UberGraphFrame) == 0x000300, "Member 'UAthenaGamePhaseChangeWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, BusIntro) == 0x000308, "Member 'UAthenaGamePhaseChangeWidget_C::BusIntro' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, IconSlide) == 0x000310, "Member 'UAthenaGamePhaseChangeWidget_C::IconSlide' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, IconPulse) == 0x000318, "Member 'UAthenaGamePhaseChangeWidget_C::IconPulse' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, ModeChanged) == 0x000320, "Member 'UAthenaGamePhaseChangeWidget_C::ModeChanged' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Content) == 0x000328, "Member 'UAthenaGamePhaseChangeWidget_C::Content' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Feedback) == 0x000330, "Member 'UAthenaGamePhaseChangeWidget_C::Feedback' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Icon) == 0x000338, "Member 'UAthenaGamePhaseChangeWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Image_Bus) == 0x000340, "Member 'UAthenaGamePhaseChangeWidget_C::Image_Bus' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Image_SkewBG) == 0x000348, "Member 'UAthenaGamePhaseChangeWidget_C::Image_SkewBG' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Image_SkewBG_Shadow) == 0x000350, "Member 'UAthenaGamePhaseChangeWidget_C::Image_SkewBG_Shadow' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Image_Skydive) == 0x000358, "Member 'UAthenaGamePhaseChangeWidget_C::Image_Skydive' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Message) == 0x000360, "Member 'UAthenaGamePhaseChangeWidget_C::Message' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, ServerStatus) == 0x000368, "Member 'UAthenaGamePhaseChangeWidget_C::ServerStatus' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Switcher_AlertType) == 0x000370, "Member 'UAthenaGamePhaseChangeWidget_C::Switcher_AlertType' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Switcher_BusIconState) == 0x000378, "Member 'UAthenaGamePhaseChangeWidget_C::Switcher_BusIconState' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Text_Bus_Line1) == 0x000380, "Member 'UAthenaGamePhaseChangeWidget_C::Text_Bus_Line1' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Text_BusLine2) == 0x000388, "Member 'UAthenaGamePhaseChangeWidget_C::Text_BusLine2' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, Text_BusTimer) == 0x000390, "Member 'UAthenaGamePhaseChangeWidget_C::Text_BusTimer' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, TimeText) == 0x000398, "Member 'UAthenaGamePhaseChangeWidget_C::TimeText' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, HideForSetupTags) == 0x0003A0, "Member 'UAthenaGamePhaseChangeWidget_C::HideForSetupTags' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseChangeWidget_C, CurrentPhase) == 0x0003C0, "Member 'UAthenaGamePhaseChangeWidget_C::CurrentPhase' has a wrong offset!");

}

