#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaStormSurgePhase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaStormSurgePhase.AthenaStormSurgePhase_C
// 0x0058 (0x0350 - 0x02F8)
class UAthenaStormSurgePhase_C final : public UAthenaStormSurgeWarningBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StormDMGAlert;                                     // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       AlertText;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HelpText;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LightningBack;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StormIcon;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsDisplaying;                                     // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              StartStormSurgeDisplay;                            // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              StopStormSurgeDisplay;                             // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void StopDisplayAfterTime();
	void OnStopDisplaying();
	void OnStartDisplaying(const class FText& TitleText, const class FText& SubTitleText, bool bDisplaySubtitle, bool bPlayDamageActiveSound);
	void ExecuteUbergraph_AthenaStormSurgePhase(int32 EntryPoint);
	void Anim_Load();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaStormSurgePhase_C">();
	}
	static class UAthenaStormSurgePhase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaStormSurgePhase_C>();
	}
};
static_assert(alignof(UAthenaStormSurgePhase_C) == 0x000008, "Wrong alignment on UAthenaStormSurgePhase_C");
static_assert(sizeof(UAthenaStormSurgePhase_C) == 0x000350, "Wrong size on UAthenaStormSurgePhase_C");
static_assert(offsetof(UAthenaStormSurgePhase_C, UberGraphFrame) == 0x0002F8, "Member 'UAthenaStormSurgePhase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgePhase_C, StormDMGAlert) == 0x000300, "Member 'UAthenaStormSurgePhase_C::StormDMGAlert' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgePhase_C, AlertText) == 0x000308, "Member 'UAthenaStormSurgePhase_C::AlertText' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgePhase_C, HelpText) == 0x000310, "Member 'UAthenaStormSurgePhase_C::HelpText' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgePhase_C, LightningBack) == 0x000318, "Member 'UAthenaStormSurgePhase_C::LightningBack' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgePhase_C, StormIcon) == 0x000320, "Member 'UAthenaStormSurgePhase_C::StormIcon' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgePhase_C, bIsDisplaying) == 0x000328, "Member 'UAthenaStormSurgePhase_C::bIsDisplaying' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgePhase_C, StartStormSurgeDisplay) == 0x000330, "Member 'UAthenaStormSurgePhase_C::StartStormSurgeDisplay' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgePhase_C, StopStormSurgeDisplay) == 0x000340, "Member 'UAthenaStormSurgePhase_C::StopStormSurgeDisplay' has a wrong offset!");

}

