#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamMemberIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C
// 0x0040 (0x0368 - 0x0328)
class UAthenaTeamMemberIndicator_C final : public UAthenaPlayerIndicatorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortSimpleWidgetAnimationsPanel*       AnimationsPanel_DBNO;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_Marker;                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaTeamMemberDBNOCountdown_C*       DBNOCountdown;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaTeamMemberDBNOState_C*           DBNOIndicator;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Speech;                                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquadMarker;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaTeamMemberIndicator(int32 EntryPoint);
	void BP_UpdateWorldNameVisibility(bool bDisplayWorldName);
	void BP_OnHandleTalkingStateChanged(bool bIsTalking);
	void BP_OnHandlePlayerStateSet(class AFortPlayerStateAthena* PlayerStateAthena);
	void BP_OnHandlePlayerNameReplicated(const class FString& PlayerName_0);
	void BP_OnHandlePinColorChanged(const struct FLinearColor& PinColor);
	void BP_OnHandleDBNOStateChanged(bool bIsDBNO);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaTeamMemberIndicator_C">();
	}
	static class UAthenaTeamMemberIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTeamMemberIndicator_C>();
	}
};
static_assert(alignof(UAthenaTeamMemberIndicator_C) == 0x000008, "Wrong alignment on UAthenaTeamMemberIndicator_C");
static_assert(sizeof(UAthenaTeamMemberIndicator_C) == 0x000368, "Wrong size on UAthenaTeamMemberIndicator_C");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, UberGraphFrame) == 0x000328, "Member 'UAthenaTeamMemberIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, AnimationsPanel_DBNO) == 0x000330, "Member 'UAthenaTeamMemberIndicator_C::AnimationsPanel_DBNO' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, CommonWidgetSwitcher_Marker) == 0x000338, "Member 'UAthenaTeamMemberIndicator_C::CommonWidgetSwitcher_Marker' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, DBNOCountdown) == 0x000340, "Member 'UAthenaTeamMemberIndicator_C::DBNOCountdown' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, DBNOIndicator) == 0x000348, "Member 'UAthenaTeamMemberIndicator_C::DBNOIndicator' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, PlayerName) == 0x000350, "Member 'UAthenaTeamMemberIndicator_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, Speech) == 0x000358, "Member 'UAthenaTeamMemberIndicator_C::Speech' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, SquadMarker) == 0x000360, "Member 'UAthenaTeamMemberIndicator_C::SquadMarker' has a wrong offset!");

}

