#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLevelEffects

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLevelEffects.AthenaLevelEffects_C
// 0x0028 (0x02F0 - 0x02C8)
class UAthenaLevelEffects_C final : public UAthenaLevelEffects
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Backgroundshadow;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_spikeball1;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_spikeball2;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaLevelEffects(int32 EntryPoint);
	void BP_HandleEffectsLevelChanged(int32 EffectsLevel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLevelEffects_C">();
	}
	static class UAthenaLevelEffects_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLevelEffects_C>();
	}
};
static_assert(alignof(UAthenaLevelEffects_C) == 0x000008, "Wrong alignment on UAthenaLevelEffects_C");
static_assert(sizeof(UAthenaLevelEffects_C) == 0x0002F0, "Wrong size on UAthenaLevelEffects_C");
static_assert(offsetof(UAthenaLevelEffects_C, UberGraphFrame) == 0x0002C8, "Member 'UAthenaLevelEffects_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLevelEffects_C, Image_Backgroundshadow) == 0x0002D0, "Member 'UAthenaLevelEffects_C::Image_Backgroundshadow' has a wrong offset!");
static_assert(offsetof(UAthenaLevelEffects_C, Image_Glow) == 0x0002D8, "Member 'UAthenaLevelEffects_C::Image_Glow' has a wrong offset!");
static_assert(offsetof(UAthenaLevelEffects_C, Image_spikeball1) == 0x0002E0, "Member 'UAthenaLevelEffects_C::Image_spikeball1' has a wrong offset!");
static_assert(offsetof(UAthenaLevelEffects_C, Image_spikeball2) == 0x0002E8, "Member 'UAthenaLevelEffects_C::Image_spikeball2' has a wrong offset!");

}

