#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEquippedItemWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaEquippedItemWidget.AthenaEquippedItemWidget_C
// 0x0058 (0x0438 - 0x03E0)
class UAthenaEquippedItemWidget_C final : public UAthenaEquippedItemInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NameOutro;                                         // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NameIntro;                                         // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_ExtensionWidgets;                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Split1;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SwitchPopUp;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SwitchPopUpText;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           OutOfAmmoColor;                                    // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SmallBrushSize;                                    // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LargeBrushSize;                                    // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateWidgetColor(bool HasAmmo);
	void OnPopUpOnSwitchDone();
	void OnExtensionWidgetAdded(class UUserWidget* ExtensionWidget);
	void ExecuteUbergraph_AthenaEquippedItemWidget(int32 EntryPoint);
	void Construct();
	void BP_HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void BP_HandleResourceTypeChanged(const class UFortResourceItemDefinition* Item, int32 ResourceCount);
	void BP_HandleHideReserveAmmoChanged(bool bHideReserveAmmo);
	void BP_HandleHasBulletsPerClipChanged(bool bHasBulletsPerClip);
	void BP_HandleHasAmmoChanged(bool bHasAmmo);
	void BP_HandleAmmoCountChanged(int32 MagazineAmmoCount, int32 SurplusAmmoCount, int32 TotalRemaining);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaEquippedItemWidget_C">();
	}
	static class UAthenaEquippedItemWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEquippedItemWidget_C>();
	}
};
static_assert(alignof(UAthenaEquippedItemWidget_C) == 0x000008, "Wrong alignment on UAthenaEquippedItemWidget_C");
static_assert(sizeof(UAthenaEquippedItemWidget_C) == 0x000438, "Wrong size on UAthenaEquippedItemWidget_C");
static_assert(offsetof(UAthenaEquippedItemWidget_C, UberGraphFrame) == 0x0003E0, "Member 'UAthenaEquippedItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaEquippedItemWidget_C, NameOutro) == 0x0003E8, "Member 'UAthenaEquippedItemWidget_C::NameOutro' has a wrong offset!");
static_assert(offsetof(UAthenaEquippedItemWidget_C, NameIntro) == 0x0003F0, "Member 'UAthenaEquippedItemWidget_C::NameIntro' has a wrong offset!");
static_assert(offsetof(UAthenaEquippedItemWidget_C, HBox_ExtensionWidgets) == 0x0003F8, "Member 'UAthenaEquippedItemWidget_C::HBox_ExtensionWidgets' has a wrong offset!");
static_assert(offsetof(UAthenaEquippedItemWidget_C, Split1) == 0x000400, "Member 'UAthenaEquippedItemWidget_C::Split1' has a wrong offset!");
static_assert(offsetof(UAthenaEquippedItemWidget_C, SwitchPopUp) == 0x000408, "Member 'UAthenaEquippedItemWidget_C::SwitchPopUp' has a wrong offset!");
static_assert(offsetof(UAthenaEquippedItemWidget_C, SwitchPopUpText) == 0x000410, "Member 'UAthenaEquippedItemWidget_C::SwitchPopUpText' has a wrong offset!");
static_assert(offsetof(UAthenaEquippedItemWidget_C, OutOfAmmoColor) == 0x000418, "Member 'UAthenaEquippedItemWidget_C::OutOfAmmoColor' has a wrong offset!");
static_assert(offsetof(UAthenaEquippedItemWidget_C, SmallBrushSize) == 0x000428, "Member 'UAthenaEquippedItemWidget_C::SmallBrushSize' has a wrong offset!");
static_assert(offsetof(UAthenaEquippedItemWidget_C, LargeBrushSize) == 0x000430, "Member 'UAthenaEquippedItemWidget_C::LargeBrushSize' has a wrong offset!");

}

