#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Assault_RedDotAR_Athena_Weap

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Assault_RedDotAR_Athena_Weap.B_Assault_RedDotAR_Athena_Weap_C.ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap
// 0x04C0 (0x04C0 - 0x0000)
struct B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuartzGunfireEnabled_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewIsTargeting;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_2;         // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_3;         // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_2;     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_7;             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_8;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_9;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_GetWeaponDataWeaponStatHandle_ReturnValue; // 0x0140(0x0010)(NoDestructor)
	struct FFortRangedWeaponStats                 CallFunc_GetRangedWeaponStatsRow_OutRow;           // 0x0150(0x0320)()
	bool                                          CallFunc_GetRangedWeaponStatsRow_ReturnValue;      // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x049D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsTargeting_ReturnValue;               // 0x049E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x049F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x04A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsQuartzGunfireEnabled_ReturnValue_1;     // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x04B8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap) == 0x000008, "Wrong alignment on B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap");
static_assert(sizeof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap) == 0x0004C0, "Wrong size on B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, EntryPoint) == 0x000000, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_IsQuartzGunfireEnabled_ReturnValue) == 0x000004, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_IsQuartzGunfireEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, K2Node_Event_bNewIsTargeting) == 0x000005, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::K2Node_Event_bNewIsTargeting' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_IsServer_ReturnValue) == 0x00000C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetControlRotation_ReturnValue) == 0x000018, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetPlayerController_ReturnValue_1) == 0x000028, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetControlRotation_ReturnValue_1) == 0x000030, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetControlRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Roll) == 0x00003C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Pitch) == 0x000040, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Yaw) == 0x000044, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Roll_1) == 0x000048, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Pitch_1) == 0x00004C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Yaw_1) == 0x000050, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue) == 0x000054, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000058, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00005C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Lerp_ReturnValue) == 0x000060, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Lerp_ReturnValue_1) == 0x000064, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000068, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_FInterpTo_ReturnValue) == 0x00006C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetPlayerController_ReturnValue_2) == 0x000070, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_K2_GetPawn_ReturnValue) == 0x000078, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Roll_2) == 0x000080, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Pitch_2) == 0x000084, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Yaw_2) == 0x000088, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetVelocity_ReturnValue) == 0x00008C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000098, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetControlRotation_ReturnValue_2) == 0x00009C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetControlRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, Temp_bool_Variable) == 0x0000A8, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Roll_3) == 0x0000AC, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Pitch_3) == 0x0000B0, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakRotator_Yaw_3) == 0x0000B4, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x0000B8, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000BC, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_NearlyEqual_FloatFloat_ReturnValue_1) == 0x0000BD, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_NearlyEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x0000C0, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakVector_X) == 0x0000CC, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakVector_Y) == 0x0000D0, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_BreakVector_Z) == 0x0000D4, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetPlayerController_ReturnValue_3) == 0x0000D8, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000E0, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetControlRotation_ReturnValue_3) == 0x0000E4, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetControlRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_NearlyEqual_FloatFloat_ReturnValue_2) == 0x0000F0, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_NearlyEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x0000F4, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, Temp_bool_Has_Been_Initd_Variable) == 0x0000F8, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetPlayerController_ReturnValue_4) == 0x000100, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000108, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000110, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000121, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x000124, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_6) == 0x000128, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_7) == 0x00012C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_8) == 0x000130, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_9) == 0x000134, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_FInterpTo_ReturnValue_1) == 0x000138, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, K2Node_Event_bPersistentFire) == 0x00013C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, K2Node_Event_bSecondaryFire) == 0x00013D, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetWeaponDataWeaponStatHandle_ReturnValue) == 0x000140, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetWeaponDataWeaponStatHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetRangedWeaponStatsRow_OutRow) == 0x000150, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetRangedWeaponStatsRow_OutRow' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetRangedWeaponStatsRow_ReturnValue) == 0x000470, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetRangedWeaponStatsRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000474, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Lerp_ReturnValue_2) == 0x000478, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Lerp_ReturnValue_3) == 0x00047C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetPlayerController_ReturnValue_5) == 0x000480, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_RandomFloatInRange_ReturnValue) == 0x000488, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Lerp_ReturnValue_4) == 0x00048C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_StartCameraShake_ReturnValue) == 0x000490, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000498, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_IsLocallyControlled_ReturnValue) == 0x00049C, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x00049D, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_GetIsTargeting_ReturnValue) == 0x00049E, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_GetIsTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, Temp_bool_IsClosed_Variable) == 0x00049F, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, K2Node_CreateDelegate_OutputDelegate) == 0x0004A0, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_IsQuartzGunfireEnabled_ReturnValue_1) == 0x0004B0, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_IsQuartzGunfireEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0004B8, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ExecuteUbergraph_B_Assault_RedDotAR_Athena_Weap::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function B_Assault_RedDotAR_Athena_Weap.B_Assault_RedDotAR_Athena_Weap_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_Assault_RedDotAR_Athena_Weap_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Assault_RedDotAR_Athena_Weap_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Assault_RedDotAR_Athena_Weap_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Assault_RedDotAR_Athena_Weap_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_Assault_RedDotAR_Athena_Weap_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Assault_RedDotAR_Athena_Weap_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_Assault_RedDotAR_Athena_Weap_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

// Function B_Assault_RedDotAR_Athena_Weap.B_Assault_RedDotAR_Athena_Weap_C.OnSetTargeting
// 0x0001 (0x0001 - 0x0000)
struct B_Assault_RedDotAR_Athena_Weap_C_OnSetTargeting final
{
public:
	bool                                          bNewIsTargeting;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Assault_RedDotAR_Athena_Weap_C_OnSetTargeting) == 0x000001, "Wrong alignment on B_Assault_RedDotAR_Athena_Weap_C_OnSetTargeting");
static_assert(sizeof(B_Assault_RedDotAR_Athena_Weap_C_OnSetTargeting) == 0x000001, "Wrong size on B_Assault_RedDotAR_Athena_Weap_C_OnSetTargeting");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_OnSetTargeting, bNewIsTargeting) == 0x000000, "Member 'B_Assault_RedDotAR_Athena_Weap_C_OnSetTargeting::bNewIsTargeting' has a wrong offset!");

// Function B_Assault_RedDotAR_Athena_Weap.B_Assault_RedDotAR_Athena_Weap_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Assault_RedDotAR_Athena_Weap_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Assault_RedDotAR_Athena_Weap_C_ReceiveTick) == 0x000004, "Wrong alignment on B_Assault_RedDotAR_Athena_Weap_C_ReceiveTick");
static_assert(sizeof(B_Assault_RedDotAR_Athena_Weap_C_ReceiveTick) == 0x000004, "Wrong size on B_Assault_RedDotAR_Athena_Weap_C_ReceiveTick");
static_assert(offsetof(B_Assault_RedDotAR_Athena_Weap_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Assault_RedDotAR_Athena_Weap_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

