#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HidingProp_Portapotty

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_HidingProp_Portapotty.B_HidingProp_Portapotty_C.ExecuteUbergraph_B_HidingProp_Portapotty
// 0x0260 (0x0260 - 0x0000)
struct B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      K2Node_CustomEvent_OwningQuestManager;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFoundAllQuestsOnProfile;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0054(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortQuestManager* OwningQuestManager, bool bFoundAllQuestsOnProfile)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesPlayerHaveQuest_QuestValid;           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_DoesPlayerHaveQuest_PlayerControllerRef;  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestItemDefinition*>       K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ConstParm, ReferenceParm)
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentQuestsReady*    CallFunc_CurrentQuestsReadyAsync_ReturnValue;      // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomCharacterPart*                   CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCustomCharacterPart>    CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x01B0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesPlayerHaveQuest_QuestValid_1;         // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_DoesPlayerHaveQuest_PlayerControllerRef_1; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput; // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	const class UFortWorldItem*                   CallFunc_GiveItemToInventoryOwner_ReturnValue;     // 0x0200(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut_1; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective_1; // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_CustomEvent_PlayerController;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_HidingProp_Portapotty_C*             K2Node_DynamicCast_AsB_Hiding_Prop_Portapotty;     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_Pawn;                                 // 0x0250(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty) == 0x000008, "Wrong alignment on B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty");
static_assert(sizeof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty) == 0x000260, "Wrong size on B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, EntryPoint) == 0x000000, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, Temp_bool_Variable) == 0x000004, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, Temp_object_Variable) == 0x000008, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, Temp_int_Array_Index_Variable) == 0x000010, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_CustomEvent_OwningQuestManager) == 0x000018, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_CustomEvent_OwningQuestManager' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_CustomEvent_bFoundAllQuestsOnProfile) == 0x000020, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_CustomEvent_bFoundAllQuestsOnProfile' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_CustomEvent_Loaded) == 0x000028, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_HasAuthority_ReturnValue) == 0x000030, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_RLerp_ReturnValue) == 0x000034, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_HasAuthority_ReturnValue_1) == 0x000040, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_HasAuthority_ReturnValue_2) == 0x000041, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000054, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_IsServer_ReturnValue) == 0x0000F0, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_IsServer_ReturnValue_1) == 0x0000F1, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000F8, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000108, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000110, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000120, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_GetQuestManager_ReturnValue) == 0x000128, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000130, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000131, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_CreateDelegate_OutputDelegate_1) == 0x000134, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_HasAuthority_ReturnValue_3) == 0x000144, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000148, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_GetQuestManager_ReturnValue_1) == 0x000158, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_GetQuestManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_DoesPlayerHaveQuest_QuestValid) == 0x000160, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_DoesPlayerHaveQuest_QuestValid' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_DoesPlayerHaveQuest_PlayerControllerRef) == 0x000168, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_DoesPlayerHaveQuest_PlayerControllerRef' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_MakeArray_Array) == 0x000170, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut) == 0x000180, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective) == 0x000188, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_CurrentQuestsReadyAsync_ReturnValue) == 0x000190, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_CurrentQuestsReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_Not_PreBool_ReturnValue) == 0x000198, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_BooleanAND_ReturnValue) == 0x000199, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_IsValid_ReturnValue_1) == 0x00019A, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_Array_Length_ReturnValue) == 0x0001A8, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0001B0, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, Temp_int_Loop_Counter_Variable) == 0x0001D8, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_Less_IntInt_ReturnValue) == 0x0001DC, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_Add_IntInt_ReturnValue) == 0x0001E0, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_DoesPlayerHaveQuest_QuestValid_1) == 0x0001E4, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_DoesPlayerHaveQuest_QuestValid_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_DoesPlayerHaveQuest_PlayerControllerRef_1) == 0x0001E8, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_DoesPlayerHaveQuest_PlayerControllerRef_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput) == 0x0001F0, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_GiveItemToInventoryOwner_ReturnValue) == 0x000200, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_GiveItemToInventoryOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut_1) == 0x000208, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective_1) == 0x000210, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_Not_PreBool_ReturnValue_1) == 0x000211, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_BooleanAND_ReturnValue_1) == 0x000212, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_CustomEvent_PlayerController) == 0x000218, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1) == 0x000220, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000228, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, Temp_object_Variable_1) == 0x000230, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_HasAuthority_ReturnValue_4) == 0x000238, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_DynamicCast_AsB_Hiding_Prop_Portapotty) == 0x000240, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_DynamicCast_AsB_Hiding_Prop_Portapotty' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_DynamicCast_bSuccess_1) == 0x000248, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_IsValid_ReturnValue_2) == 0x000249, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, K2Node_Event_Pawn) == 0x000250, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty, CallFunc_IsValid_ReturnValue_3) == 0x000258, "Member 'B_HidingProp_Portapotty_C_ExecuteUbergraph_B_HidingProp_Portapotty::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function B_HidingProp_Portapotty.B_HidingProp_Portapotty_C.OnCurrentQuestsReady_1000E6E648CCAD899938C18A7CE97267
// 0x0010 (0x0010 - 0x0000)
struct B_HidingProp_Portapotty_C_OnCurrentQuestsReady_1000E6E648CCAD899938C18A7CE97267 final
{
public:
	class UFortQuestManager*                      OwningQuestManager;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFoundAllQuestsOnProfile;                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HidingProp_Portapotty_C_OnCurrentQuestsReady_1000E6E648CCAD899938C18A7CE97267) == 0x000008, "Wrong alignment on B_HidingProp_Portapotty_C_OnCurrentQuestsReady_1000E6E648CCAD899938C18A7CE97267");
static_assert(sizeof(B_HidingProp_Portapotty_C_OnCurrentQuestsReady_1000E6E648CCAD899938C18A7CE97267) == 0x000010, "Wrong size on B_HidingProp_Portapotty_C_OnCurrentQuestsReady_1000E6E648CCAD899938C18A7CE97267");
static_assert(offsetof(B_HidingProp_Portapotty_C_OnCurrentQuestsReady_1000E6E648CCAD899938C18A7CE97267, OwningQuestManager) == 0x000000, "Member 'B_HidingProp_Portapotty_C_OnCurrentQuestsReady_1000E6E648CCAD899938C18A7CE97267::OwningQuestManager' has a wrong offset!");
static_assert(offsetof(B_HidingProp_Portapotty_C_OnCurrentQuestsReady_1000E6E648CCAD899938C18A7CE97267, bFoundAllQuestsOnProfile) == 0x000008, "Member 'B_HidingProp_Portapotty_C_OnCurrentQuestsReady_1000E6E648CCAD899938C18A7CE97267::bFoundAllQuestsOnProfile' has a wrong offset!");

// Function B_HidingProp_Portapotty.B_HidingProp_Portapotty_C.OnLoaded_3A158F7946A9198D94E107B013508851
// 0x0008 (0x0008 - 0x0000)
struct B_HidingProp_Portapotty_C_OnLoaded_3A158F7946A9198D94E107B013508851 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HidingProp_Portapotty_C_OnLoaded_3A158F7946A9198D94E107B013508851) == 0x000008, "Wrong alignment on B_HidingProp_Portapotty_C_OnLoaded_3A158F7946A9198D94E107B013508851");
static_assert(sizeof(B_HidingProp_Portapotty_C_OnLoaded_3A158F7946A9198D94E107B013508851) == 0x000008, "Wrong size on B_HidingProp_Portapotty_C_OnLoaded_3A158F7946A9198D94E107B013508851");
static_assert(offsetof(B_HidingProp_Portapotty_C_OnLoaded_3A158F7946A9198D94E107B013508851, Loaded) == 0x000000, "Member 'B_HidingProp_Portapotty_C_OnLoaded_3A158F7946A9198D94E107B013508851::Loaded' has a wrong offset!");

// Function B_HidingProp_Portapotty.B_HidingProp_Portapotty_C.SetPlayDonutSoundBool
// 0x0008 (0x0008 - 0x0000)
struct B_HidingProp_Portapotty_C_SetPlayDonutSoundBool final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HidingProp_Portapotty_C_SetPlayDonutSoundBool) == 0x000008, "Wrong alignment on B_HidingProp_Portapotty_C_SetPlayDonutSoundBool");
static_assert(sizeof(B_HidingProp_Portapotty_C_SetPlayDonutSoundBool) == 0x000008, "Wrong size on B_HidingProp_Portapotty_C_SetPlayDonutSoundBool");
static_assert(offsetof(B_HidingProp_Portapotty_C_SetPlayDonutSoundBool, PlayerController) == 0x000000, "Member 'B_HidingProp_Portapotty_C_SetPlayDonutSoundBool::PlayerController' has a wrong offset!");

// Function B_HidingProp_Portapotty.B_HidingProp_Portapotty_C.StopHiding
// 0x0008 (0x0008 - 0x0000)
struct B_HidingProp_Portapotty_C_StopHiding final
{
public:
	const class AFortPawn*                        Pawn_0;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HidingProp_Portapotty_C_StopHiding) == 0x000008, "Wrong alignment on B_HidingProp_Portapotty_C_StopHiding");
static_assert(sizeof(B_HidingProp_Portapotty_C_StopHiding) == 0x000008, "Wrong size on B_HidingProp_Portapotty_C_StopHiding");
static_assert(offsetof(B_HidingProp_Portapotty_C_StopHiding, Pawn_0) == 0x000000, "Member 'B_HidingProp_Portapotty_C_StopHiding::Pawn_0' has a wrong offset!");

}

