#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ranged_FringePlankSecondary_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Prj_Athena_Generic_CurieFireball_Parent_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Ranged_FringePlankSecondary_Athena.B_Prj_Ranged_FringePlankSecondary_Athena_C
// 0x0050 (0x0990 - 0x0940)
class AB_Prj_Ranged_FringePlankSecondary_Athena_C final : public AB_Prj_Athena_Generic_CurieFireball_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Ranged_FringePlankSecondary_Athena_C; // 0x0940(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_GL_Ribbon_SmokeTrail;                            // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SurfaceTypeSoundComponent_C*        BP_SurfaceTypeSoundComponent;                      // 0x0950(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        LoopingAudioTell;                                  // 0x0958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        IntoWaterEffects;                                  // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HitWater_NoFire_Sound;                             // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BurnoutTime;                                       // 0x0970(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact_Point;                                      // 0x0974(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Impact_Sound;                                      // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void Burnout();
	void ExecuteUbergraph_B_Prj_Ranged_FringePlankSecondary_Athena(int32 EntryPoint);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void OnStop(const struct FHitResult& Hit);
	void Play_Impact_Sound();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Ranged_FringePlankSecondary_Athena_C">();
	}
	static class AB_Prj_Ranged_FringePlankSecondary_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Ranged_FringePlankSecondary_Athena_C>();
	}
};
static_assert(alignof(AB_Prj_Ranged_FringePlankSecondary_Athena_C) == 0x000010, "Wrong alignment on AB_Prj_Ranged_FringePlankSecondary_Athena_C");
static_assert(sizeof(AB_Prj_Ranged_FringePlankSecondary_Athena_C) == 0x000990, "Wrong size on AB_Prj_Ranged_FringePlankSecondary_Athena_C");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, UberGraphFrame_B_Prj_Ranged_FringePlankSecondary_Athena_C) == 0x000940, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::UberGraphFrame_B_Prj_Ranged_FringePlankSecondary_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, P_GL_Ribbon_SmokeTrail) == 0x000948, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::P_GL_Ribbon_SmokeTrail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, BP_SurfaceTypeSoundComponent) == 0x000950, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::BP_SurfaceTypeSoundComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, LoopingAudioTell) == 0x000958, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::LoopingAudioTell' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, IntoWaterEffects) == 0x000960, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::IntoWaterEffects' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, HitWater_NoFire_Sound) == 0x000968, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::HitWater_NoFire_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, BurnoutTime) == 0x000970, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::BurnoutTime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, Impact_Point) == 0x000974, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::Impact_Point' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, Impact_Sound) == 0x000980, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::Impact_Sound' has a wrong offset!");

}

