#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_CampsiteImprovement_Parent

#include "Basic.hpp"

#include "Enum_Campsite_Improvements_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "B_Prj_Athena_BGASpawner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_CampsiteImprovement_Parent.B_Prj_Athena_CampsiteImprovement_Parent_C
// 0x00F8 (0x0A48 - 0x0950)
class AB_Prj_Athena_CampsiteImprovement_Parent_C : public AB_Prj_Athena_BGASpawner_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Athena_CampsiteImprovement_Parent_C; // 0x0950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          TeamHasBeenSet;                                    // 0x0960(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0961(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bindToSurfaceOnStart_;                             // 0x0962(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_963[0x1];                                      // 0x0963(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Max_Bounces;                                       // 0x0964(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               PickupWID;                                         // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Campsite_Improvements                    Improvement_Type_To_Build;                         // 0x0970(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_971[0x7];                                      // 0x0971(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxFriendlyCampsiteExclusionRange;                 // 0x0978(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxEnemyCampsiteExclusionRange;                    // 0x09A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Hit;                                               // 0x09C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnDoOnce;                                       // 0x09C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnteredWater;                                      // 0x09CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9CB[0x1];                                      // 0x09CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BounceCount;                                       // 0x09CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MinDeploymentDistanceFromObstacles;                // 0x09D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  Too_Many_Tents_Failed_Reason;                      // 0x09F8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           GC_Revert_To_Pickup;                               // 0x0A18(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Water_Splash;                                   // 0x0A20(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Invalid_Surface_Failed_Reason;                     // 0x0A28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void DeployFailedFeedback(int32 FailReason);
	void ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent(int32 EntryPoint);
	void HasEnteredWater();
	void OnStop(const struct FHitResult& Hit_0);
	void ParentHit();
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit_0);
	void RevertToPickupAndDestroyProj();
	class AActor* SpawnBGA_(const struct FVector& Normal, class AActor* HitActor, class UPrimitiveComponent* HitComp, const struct FVector& Pos, bool FromWater, const struct FHitResult& Hit_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_CampsiteImprovement_Parent_C">();
	}
	static class AB_Prj_Athena_CampsiteImprovement_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_CampsiteImprovement_Parent_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_CampsiteImprovement_Parent_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_CampsiteImprovement_Parent_C");
static_assert(sizeof(AB_Prj_Athena_CampsiteImprovement_Parent_C) == 0x000A48, "Wrong size on AB_Prj_Athena_CampsiteImprovement_Parent_C");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, UberGraphFrame_B_Prj_Athena_CampsiteImprovement_Parent_C) == 0x000950, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::UberGraphFrame_B_Prj_Athena_CampsiteImprovement_Parent_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, StaticMesh) == 0x000958, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, TeamHasBeenSet) == 0x000960, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::TeamHasBeenSet' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, Debug) == 0x000961, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::Debug' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, bindToSurfaceOnStart_) == 0x000962, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::bindToSurfaceOnStart_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, Max_Bounces) == 0x000964, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::Max_Bounces' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, PickupWID) == 0x000968, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::PickupWID' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, Improvement_Type_To_Build) == 0x000970, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::Improvement_Type_To_Build' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, MaxFriendlyCampsiteExclusionRange) == 0x000978, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::MaxFriendlyCampsiteExclusionRange' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, MaxEnemyCampsiteExclusionRange) == 0x0009A0, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::MaxEnemyCampsiteExclusionRange' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, Hit) == 0x0009C8, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::Hit' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, SpawnDoOnce) == 0x0009C9, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::SpawnDoOnce' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, EnteredWater) == 0x0009CA, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::EnteredWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, BounceCount) == 0x0009CC, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::BounceCount' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, MinDeploymentDistanceFromObstacles) == 0x0009D0, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::MinDeploymentDistanceFromObstacles' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, Too_Many_Tents_Failed_Reason) == 0x0009F8, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::Too_Many_Tents_Failed_Reason' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, GC_Revert_To_Pickup) == 0x000A18, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::GC_Revert_To_Pickup' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, GC_Water_Splash) == 0x000A20, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::GC_Water_Splash' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_CampsiteImprovement_Parent_C, Invalid_Surface_Failed_Reason) == 0x000A28, "Member 'AB_Prj_Athena_CampsiteImprovement_Parent_C::Invalid_Surface_Failed_Reason' has a wrong offset!");

}

