#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_Grenade_MolotovCocktail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Prj_Athena_Grenade_Base_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_Grenade_MolotovCocktail.B_Prj_Athena_Grenade_MolotovCocktail_C
// 0x01B0 (0x0BF0 - 0x0A40)
class AB_Prj_Athena_Grenade_MolotovCocktail_C final : public AB_Prj_Athena_Grenade_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Athena_Grenade_MolotovCocktail_C; // 0x0A40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara_Projectile_Particles;                      // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hit_Location;                                      // 0x0A50(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5C[0x4];                                      // 0x0A5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Bottle_Smash_Audio_Cue;                            // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Ignite_Audio_Cue;                                  // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hit_Normal;                                        // 0x0A70(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A7C[0x4];                                      // 0x0A7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        ProjectileSpawnVectors;                            // 0x0A80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SpawnedProjectileMinSpeed;                         // 0x0A90(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SpawnedProjectileMaxSpeed;                         // 0x0AB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ConeHalfAngleInDegrees;                            // 0x0AE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         FireBallsToSpawn;                                  // 0x0B08(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CurieActivated;                                    // 0x0B30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B31[0x7];                                      // 0x0B31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DoWeUseHomingProjectile;                           // 0x0B38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                ReflectionVector;                                  // 0x0B60(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireflyProjectileAngleExtreme;                     // 0x0B6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireflyProjectileDirection;                        // 0x0B70(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireflyProjectileRadius_Min;                       // 0x0B7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireflyProjectileRadius_Max;                       // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireflyProjectileEndPoint;                         // 0x0B84(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumProjectileSpawned;                              // 0x0B90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumProjectilesToSpawn;                             // 0x0B94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewTemp;                                           // 0x0B98(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnteredWater;                                      // 0x0BA4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit;                                               // 0x0BA5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA6[0x2];                                      // 0x0BA6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         Sound_EnterWater;                                  // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemToSpawn_Molotov;                               // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInteractWithWater;                              // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB9[0x7];                                      // 0x0BB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnBGATransform;                                 // 0x0BC0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void Defer_BGA_Spawn();
	void Drunk_Projectiles();
	void ExecuteUbergraph_B_Prj_Athena_Grenade_MolotovCocktail(int32 EntryPoint);
	void FireflyProjectileLogic();
	void HasEnteredWater();
	void OnCurieActive_7575DCC3440AA42836D7988BCA6485E5();
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_Grenade_MolotovCocktail_C">();
	}
	static class AB_Prj_Athena_Grenade_MolotovCocktail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_Grenade_MolotovCocktail_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_Grenade_MolotovCocktail_C) == 0x000010, "Wrong alignment on AB_Prj_Athena_Grenade_MolotovCocktail_C");
static_assert(sizeof(AB_Prj_Athena_Grenade_MolotovCocktail_C) == 0x000BF0, "Wrong size on AB_Prj_Athena_Grenade_MolotovCocktail_C");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, UberGraphFrame_B_Prj_Athena_Grenade_MolotovCocktail_C) == 0x000A40, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::UberGraphFrame_B_Prj_Athena_Grenade_MolotovCocktail_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Niagara_Projectile_Particles) == 0x000A48, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Niagara_Projectile_Particles' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Hit_Location) == 0x000A50, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Hit_Location' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Bottle_Smash_Audio_Cue) == 0x000A60, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Bottle_Smash_Audio_Cue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Ignite_Audio_Cue) == 0x000A68, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Ignite_Audio_Cue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Hit_Normal) == 0x000A70, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Hit_Normal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ProjectileSpawnVectors) == 0x000A80, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ProjectileSpawnVectors' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, SpawnedProjectileMinSpeed) == 0x000A90, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::SpawnedProjectileMinSpeed' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, SpawnedProjectileMaxSpeed) == 0x000AB8, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::SpawnedProjectileMaxSpeed' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ConeHalfAngleInDegrees) == 0x000AE0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ConeHalfAngleInDegrees' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireBallsToSpawn) == 0x000B08, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireBallsToSpawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, CurieActivated) == 0x000B30, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::CurieActivated' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, DoWeUseHomingProjectile) == 0x000B38, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::DoWeUseHomingProjectile' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ReflectionVector) == 0x000B60, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ReflectionVector' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileAngleExtreme) == 0x000B6C, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileAngleExtreme' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileDirection) == 0x000B70, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileDirection' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileRadius_Min) == 0x000B7C, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileRadius_Min' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileRadius_Max) == 0x000B80, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileRadius_Max' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileEndPoint) == 0x000B84, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileEndPoint' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, NumProjectileSpawned) == 0x000B90, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::NumProjectileSpawned' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, NumProjectilesToSpawn) == 0x000B94, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::NumProjectilesToSpawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, NewTemp) == 0x000B98, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::NewTemp' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, EnteredWater) == 0x000BA4, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::EnteredWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Hit) == 0x000BA5, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Hit' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Sound_EnterWater) == 0x000BA8, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Sound_EnterWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ItemToSpawn_Molotov) == 0x000BB0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ItemToSpawn_Molotov' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, CanInteractWithWater) == 0x000BB8, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::CanInteractWithWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, SpawnBGATransform) == 0x000BC0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::SpawnBGATransform' has a wrong offset!");

}

