#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_Consumable_Thrown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_Consumable_Thrown.B_Prj_Athena_Consumable_Thrown_C
// 0x00A0 (0x0968 - 0x08C8)
class AB_Prj_Athena_Consumable_Thrown_C : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara_Trail;                                     // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_Trail;                                          // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemDefinition;                                    // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Projectile_Max_Lifetime;                           // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasExploded_;                                     // 0x08FC(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FD[0x3];                                      // 0x08FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Impact_Location;                                   // 0x0900(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         FX_Linger_Time;                                    // 0x090C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Lifespan_Timer;                                    // 0x0910(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnPositionOffset;                               // 0x0918(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_924[0x4];                                      // 0x0924(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            PickUp;                                            // 0x0928(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         SpawnFX;                                           // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         SpawnFX_Water;                                     // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         Bounce_Off_FX;                                     // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpawnSound;                                        // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Splash_Sound_;                                     // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterSpawnDelay;                                   // 0x0958(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95C[0x4];                                      // 0x095C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ThrowSoundAttachedToPlayer;                        // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void Broadcast_Pickup_Projectile_Created();
	void Deactivate_Trail_FX_System();
	void ExecuteUbergraph_B_Prj_Athena_Consumable_Thrown(int32 EntryPoint);
	void Get_Spawned_Pickup_Optional_Owner_PC(class AFortPlayerController** Optional_Owner_PC);
	void Mark(class AActor* NewParam);
	void On_Pickup_Spawned(class AFortPickup* Spawned_Pickup);
	void OnBounce(const struct FHitResult& Hit);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void OnHomingPassedTarget();
	void OnReachedLockTargetDistanceThreshold();
	void OnRep_Impact_Location();
	void OnRep_Pickup();
	void OnStop(const struct FHitResult& Hit);
	void PlayThrowSound();
	void ReceiveBeginPlay();
	void SetItemDefinition(class UFortWorldItemDefinition* In_Item_Definition);
	void SpawnedItemFx();
	void SpawnItem();
	void Timeout();
	void WaterImpactItemFX();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_Consumable_Thrown_C">();
	}
	static class AB_Prj_Athena_Consumable_Thrown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_Consumable_Thrown_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_Consumable_Thrown_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_Consumable_Thrown_C");
static_assert(sizeof(AB_Prj_Athena_Consumable_Thrown_C) == 0x000968, "Wrong size on AB_Prj_Athena_Consumable_Thrown_C");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, UberGraphFrame) == 0x0008C8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Niagara_Trail) == 0x0008D0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Niagara_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SkeletalMesh) == 0x0008D8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, StaticMesh) == 0x0008E0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, FX_Trail) == 0x0008E8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::FX_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, ItemDefinition) == 0x0008F0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::ItemDefinition' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Projectile_Max_Lifetime) == 0x0008F8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Projectile_Max_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, bHasExploded_) == 0x0008FC, "Member 'AB_Prj_Athena_Consumable_Thrown_C::bHasExploded_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Impact_Location) == 0x000900, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Impact_Location' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, FX_Linger_Time) == 0x00090C, "Member 'AB_Prj_Athena_Consumable_Thrown_C::FX_Linger_Time' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Lifespan_Timer) == 0x000910, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Lifespan_Timer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnPositionOffset) == 0x000918, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnPositionOffset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, PickUp) == 0x000928, "Member 'AB_Prj_Athena_Consumable_Thrown_C::PickUp' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnFX) == 0x000930, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnFX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnFX_Water) == 0x000938, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnFX_Water' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Bounce_Off_FX) == 0x000940, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Bounce_Off_FX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnSound) == 0x000948, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Splash_Sound_) == 0x000950, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Splash_Sound_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, WaterSpawnDelay) == 0x000958, "Member 'AB_Prj_Athena_Consumable_Thrown_C::WaterSpawnDelay' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, ThrowSoundAttachedToPlayer) == 0x000960, "Member 'AB_Prj_Athena_Consumable_Thrown_C::ThrowSoundAttachedToPlayer' has a wrong offset!");

}

