#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_Dual_Generic_Athena

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "En_ShellTypes_01_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Ranged_Dual_Generic_Athena.B_Ranged_Dual_Generic_Athena_C
// 0x0230 (0x1AB8 - 0x1888)
class AB_Ranged_Dual_Generic_Athena_C : public AFortWeaponRangedDual
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1888(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               LeftReload_Empty_;                                 // 0x1890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LeftMuzzle_Empty_;                                 // 0x1898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Reload_Empty_;                                     // 0x18A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ScopeMesh1P;                                       // 0x18A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Muzzle_Empty_;                                     // 0x18B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         AnimateScopePostProcess_DownSightPostProcessAmount_BF13147D4D2F78A8F8CECFABA0F6D055; // 0x18B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AnimateScopePostProcess__Direction_BF13147D4D2F78A8F8CECFABA0F6D055; // 0x18BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18BD[0x3];                                     // 0x18BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AnimateScopePostProcess;                           // 0x18C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem;                              // 0x18C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffect;                     // 0x18D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffectIcon;                 // 0x18D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDestroyEffect;                                  // 0x18E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Reload_Particles;                              // 0x18E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E2[0x6];                                     // 0x18E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Reload_ParticleSystem;                             // 0x18E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastPlayFXTime;                                    // 0x18F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinPlayFXTime;                                     // 0x18F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SpawnedShellsPS_R;                                 // 0x18F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SpawnedShellsPS_L;                                 // 0x1900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShellsOnFire_;                                  // 0x1908(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShellsOnReload_;                                // 0x1909(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShellsOnPump_;                                  // 0x190A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_190B[0x5];                                     // 0x190B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ShellsParticleSystemTemplate;                      // 0x1910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReloadSocketName;                                  // 0x1918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortAIPawn*>                    Array_Of_Active_Enemy_AI;                          // 0x1920(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Scope___Render_Enemies_To_Custom_Depth_Buffer;     // 0x1930(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_1931[0x3];                                     // 0x1931(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Shells_Socket_Name;                                // 0x1934(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	En_ShellTypes_01                              ShellTypeSelect;                                   // 0x193C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193D[0x3];                                     // 0x193D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Shells_Spawn_Rate_Scale;                           // 0x1940(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ShellsRotationRate;                                // 0x1944(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Velocity;                                   // 0x1950(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Gravity;                                    // 0x195C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Lifetime;                                   // 0x1968(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Size;                                       // 0x196C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Time_Dilation;                              // 0x1978(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target_Scope_Vignette_Blur_Screen_Percentage;      // 0x197C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scope_Camera_Offset_Amount;                        // 0x1980(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SmallShells;                                       // 0x1984(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MediumShells;                                      // 0x1985(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LargeShells;                                       // 0x1986(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShotgunShells;                                     // 0x1987(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnergyShells;                                      // 0x1988(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1989[0x3];                                     // 0x1989(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Inherit_Parent_Velocity;                           // 0x198C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Radius;                                // 0x1990(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Height;                                // 0x1994(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugShellsSocket_;                                // 0x1998(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1999[0x7];                                     // 0x1999(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_ScopeZoomIn;                                 // 0x19A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_ScopeZoomOut;                                // 0x19A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ReticleHUDElementTags;                             // 0x19B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Is_Wind_Enabled;                                   // 0x19D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D1[0x7];                                     // 0x19D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        MuzzleWindParticleSystem;                          // 0x19D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem1P;                            // 0x19E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHideReticleAfterDelay;                       // 0x19E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19E9[0x7];                                     // 0x19E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               MuzzleWindParticleSpawned;                         // 0x19F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StencilBufferValue;                                // 0x19F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDualWeaponHand                               LastHandFired;                                     // 0x19FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldReEnableLeftWeapVis;                        // 0x19FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceFeedbackShouldPersist;                       // 0x19FE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19FF[0x1];                                     // 0x19FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Shell_Color;                                       // 0x1A00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_PS_Max_Draw_Distance;                       // 0x1A10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A14[0x4];                                     // 0x1A14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<En_ShellTypes_01, bool>                  Shell_Bools;                                       // 0x1A18(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<En_ShellTypes_01, class FName>           Shell_Burst_Names;                                 // 0x1A68(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AbortScopeFX();
	void ActivateOrDeactivateWindParticle(bool bNewActive);
	void ActivateReloadSmokeFX();
	void ActivateShellsFX(bool Bool, bool OffHand);
	void AddRandomScale(bool OffHand);
	void AnimateScopePostProcess__FinishedFunc();
	void AnimateScopePostProcess__UpdateFunc();
	void Bind_on_Effects_Quality();
	void BindOnHandFired();
	void DeactivateMuzzleFX();
	void DeactivateReloadSmokeFX();
	void DeactivateShellsFX();
	void ExecuteUbergraph_B_Ranged_Dual_Generic_Athena(int32 EntryPoint);
	void ForceScopeFX();
	void HandFired(EDualWeaponHand Hand, bool bPersistantFire);
	void HideFirstPersonStuff();
	void HideReticle();
	void HideThirdPersonStuff();
	void HideWeapon();
	void HideWeaponMesh();
	void InitializeScopeVariables();
	void K2_OnUnEquip();
	void Muzzle_Flash_FX(bool Persistent_Fire, bool OffHand);
	void Muzzle_Play_Reload_FX(EFortReloadFXState Selection);
	void OnEquippedWeaponDestory();
	void OnPlayReloadFX(EFortReloadFXState ReloadStage);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnSetTargeting(bool bNewIsTargeting);
	void OnStopWeaponFireFX();
	void OnWeaponAttached();
	void PlayScopePP();
	void ReceiveBeginPlay();
	void ResetDoonceScopeSound();
	void ReverseScopePP();
	void SetPostProcessParams(float InputPin);
	void SetupShellFX(bool OffHand);
	void SetWeaponPierceThrough(bool Enable, int32 TargetLimit);
	void SetWeaponPierceThrough_ClientRep(bool Enable, int32 TargetLimit);
	void SetWpnRarity();
	void ShellEjectionFixOn();
	void ShellEjectionOff();
	void ShellsON__onPump_();
	void ShowReticle();
	void ShowWeapon();
	void ShowWeaponMesh();
	void UnhideFirstPersonStuffPart1();
	void UnhideFirstPersonStuffPart2();
	void UnhideThirdPersonStuff();
	void Update_Enemy_Custom_Depths(bool Enable_Or_Disable, int32 StencilBufferValue_0);
	void UpdateShellEmittersFX(class UFXSystemComponent* Target);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Ranged_Dual_Generic_Athena_C">();
	}
	static class AB_Ranged_Dual_Generic_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Ranged_Dual_Generic_Athena_C>();
	}
};
static_assert(alignof(AB_Ranged_Dual_Generic_Athena_C) == 0x000008, "Wrong alignment on AB_Ranged_Dual_Generic_Athena_C");
static_assert(sizeof(AB_Ranged_Dual_Generic_Athena_C) == 0x001AB8, "Wrong size on AB_Ranged_Dual_Generic_Athena_C");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, UberGraphFrame) == 0x001888, "Member 'AB_Ranged_Dual_Generic_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, LeftReload_Empty_) == 0x001890, "Member 'AB_Ranged_Dual_Generic_Athena_C::LeftReload_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, LeftMuzzle_Empty_) == 0x001898, "Member 'AB_Ranged_Dual_Generic_Athena_C::LeftMuzzle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Reload_Empty_) == 0x0018A0, "Member 'AB_Ranged_Dual_Generic_Athena_C::Reload_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ScopeMesh1P) == 0x0018A8, "Member 'AB_Ranged_Dual_Generic_Athena_C::ScopeMesh1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Muzzle_Empty_) == 0x0018B0, "Member 'AB_Ranged_Dual_Generic_Athena_C::Muzzle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, AnimateScopePostProcess_DownSightPostProcessAmount_BF13147D4D2F78A8F8CECFABA0F6D055) == 0x0018B8, "Member 'AB_Ranged_Dual_Generic_Athena_C::AnimateScopePostProcess_DownSightPostProcessAmount_BF13147D4D2F78A8F8CECFABA0F6D055' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, AnimateScopePostProcess__Direction_BF13147D4D2F78A8F8CECFABA0F6D055) == 0x0018BC, "Member 'AB_Ranged_Dual_Generic_Athena_C::AnimateScopePostProcess__Direction_BF13147D4D2F78A8F8CECFABA0F6D055' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, AnimateScopePostProcess) == 0x0018C0, "Member 'AB_Ranged_Dual_Generic_Athena_C::AnimateScopePostProcess' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MuzzleParticleSystem) == 0x0018C8, "Member 'AB_Ranged_Dual_Generic_Athena_C::MuzzleParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, WeaponDurabilityDestroyEffect) == 0x0018D0, "Member 'AB_Ranged_Dual_Generic_Athena_C::WeaponDurabilityDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, WeaponDurabilityDestroyEffectIcon) == 0x0018D8, "Member 'AB_Ranged_Dual_Generic_Athena_C::WeaponDurabilityDestroyEffectIcon' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, UseDestroyEffect) == 0x0018E0, "Member 'AB_Ranged_Dual_Generic_Athena_C::UseDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Use_Reload_Particles) == 0x0018E1, "Member 'AB_Ranged_Dual_Generic_Athena_C::Use_Reload_Particles' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Reload_ParticleSystem) == 0x0018E8, "Member 'AB_Ranged_Dual_Generic_Athena_C::Reload_ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, LastPlayFXTime) == 0x0018F0, "Member 'AB_Ranged_Dual_Generic_Athena_C::LastPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MinPlayFXTime) == 0x0018F4, "Member 'AB_Ranged_Dual_Generic_Athena_C::MinPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, SpawnedShellsPS_R) == 0x0018F8, "Member 'AB_Ranged_Dual_Generic_Athena_C::SpawnedShellsPS_R' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, SpawnedShellsPS_L) == 0x001900, "Member 'AB_Ranged_Dual_Generic_Athena_C::SpawnedShellsPS_L' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, UseShellsOnFire_) == 0x001908, "Member 'AB_Ranged_Dual_Generic_Athena_C::UseShellsOnFire_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, UseShellsOnReload_) == 0x001909, "Member 'AB_Ranged_Dual_Generic_Athena_C::UseShellsOnReload_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, UseShellsOnPump_) == 0x00190A, "Member 'AB_Ranged_Dual_Generic_Athena_C::UseShellsOnPump_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ShellsParticleSystemTemplate) == 0x001910, "Member 'AB_Ranged_Dual_Generic_Athena_C::ShellsParticleSystemTemplate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ReloadSocketName) == 0x001918, "Member 'AB_Ranged_Dual_Generic_Athena_C::ReloadSocketName' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Array_Of_Active_Enemy_AI) == 0x001920, "Member 'AB_Ranged_Dual_Generic_Athena_C::Array_Of_Active_Enemy_AI' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Scope___Render_Enemies_To_Custom_Depth_Buffer) == 0x001930, "Member 'AB_Ranged_Dual_Generic_Athena_C::Scope___Render_Enemies_To_Custom_Depth_Buffer' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Socket_Name) == 0x001934, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Socket_Name' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ShellTypeSelect) == 0x00193C, "Member 'AB_Ranged_Dual_Generic_Athena_C::ShellTypeSelect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Spawn_Rate_Scale) == 0x001940, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Spawn_Rate_Scale' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ShellsRotationRate) == 0x001944, "Member 'AB_Ranged_Dual_Generic_Athena_C::ShellsRotationRate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Velocity) == 0x001950, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Gravity) == 0x00195C, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Gravity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Lifetime) == 0x001968, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Size) == 0x00196C, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Size' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Time_Dilation) == 0x001978, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Time_Dilation' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Target_Scope_Vignette_Blur_Screen_Percentage) == 0x00197C, "Member 'AB_Ranged_Dual_Generic_Athena_C::Target_Scope_Vignette_Blur_Screen_Percentage' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Scope_Camera_Offset_Amount) == 0x001980, "Member 'AB_Ranged_Dual_Generic_Athena_C::Scope_Camera_Offset_Amount' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, SmallShells) == 0x001984, "Member 'AB_Ranged_Dual_Generic_Athena_C::SmallShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MediumShells) == 0x001985, "Member 'AB_Ranged_Dual_Generic_Athena_C::MediumShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, LargeShells) == 0x001986, "Member 'AB_Ranged_Dual_Generic_Athena_C::LargeShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ShotgunShells) == 0x001987, "Member 'AB_Ranged_Dual_Generic_Athena_C::ShotgunShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, EnergyShells) == 0x001988, "Member 'AB_Ranged_Dual_Generic_Athena_C::EnergyShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Inherit_Parent_Velocity) == 0x00198C, "Member 'AB_Ranged_Dual_Generic_Athena_C::Inherit_Parent_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Cylindrical_Radius) == 0x001990, "Member 'AB_Ranged_Dual_Generic_Athena_C::Cylindrical_Radius' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Cylindrical_Height) == 0x001994, "Member 'AB_Ranged_Dual_Generic_Athena_C::Cylindrical_Height' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, DebugShellsSocket_) == 0x001998, "Member 'AB_Ranged_Dual_Generic_Athena_C::DebugShellsSocket_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Sound_ScopeZoomIn) == 0x0019A0, "Member 'AB_Ranged_Dual_Generic_Athena_C::Sound_ScopeZoomIn' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Sound_ScopeZoomOut) == 0x0019A8, "Member 'AB_Ranged_Dual_Generic_Athena_C::Sound_ScopeZoomOut' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ReticleHUDElementTags) == 0x0019B0, "Member 'AB_Ranged_Dual_Generic_Athena_C::ReticleHUDElementTags' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Is_Wind_Enabled) == 0x0019D0, "Member 'AB_Ranged_Dual_Generic_Athena_C::Is_Wind_Enabled' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MuzzleWindParticleSystem) == 0x0019D8, "Member 'AB_Ranged_Dual_Generic_Athena_C::MuzzleWindParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MuzzleParticleSystem1P) == 0x0019E0, "Member 'AB_Ranged_Dual_Generic_Athena_C::MuzzleParticleSystem1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ShouldHideReticleAfterDelay) == 0x0019E8, "Member 'AB_Ranged_Dual_Generic_Athena_C::ShouldHideReticleAfterDelay' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MuzzleWindParticleSpawned) == 0x0019F0, "Member 'AB_Ranged_Dual_Generic_Athena_C::MuzzleWindParticleSpawned' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, StencilBufferValue) == 0x0019F8, "Member 'AB_Ranged_Dual_Generic_Athena_C::StencilBufferValue' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, LastHandFired) == 0x0019FC, "Member 'AB_Ranged_Dual_Generic_Athena_C::LastHandFired' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, bShouldReEnableLeftWeapVis) == 0x0019FD, "Member 'AB_Ranged_Dual_Generic_Athena_C::bShouldReEnableLeftWeapVis' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, bForceFeedbackShouldPersist) == 0x0019FE, "Member 'AB_Ranged_Dual_Generic_Athena_C::bForceFeedbackShouldPersist' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shell_Color) == 0x001A00, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shell_Color' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_PS_Max_Draw_Distance) == 0x001A10, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_PS_Max_Draw_Distance' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shell_Bools) == 0x001A18, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shell_Bools' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shell_Burst_Names) == 0x001A68, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shell_Burst_Names' has a wrong offset!");

}

