#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Trap_Context_Reinforced_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Trap_Context_Reinforced_Athena.B_Trap_Context_Reinforced_Athena_C
// 0x0018 (0x0E48 - 0x0E30)
class AB_Trap_Context_Reinforced_Athena_C final : public ABuildingTrap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UGameplayEffect>            GE_SetHealth;                                      // 0x0E38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABuildingActor*                         AttachedBuilding;                                  // 0x0E40(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Trap_Context_Reinforced_Athena(int32 EntryPoint);
	void OnAttachToBuilding(class ABuildingActor* AttachedToBuilding);
	void SetHealthImmediately();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Trap_Context_Reinforced_Athena_C">();
	}
	static class AB_Trap_Context_Reinforced_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Trap_Context_Reinforced_Athena_C>();
	}
};
static_assert(alignof(AB_Trap_Context_Reinforced_Athena_C) == 0x000008, "Wrong alignment on AB_Trap_Context_Reinforced_Athena_C");
static_assert(sizeof(AB_Trap_Context_Reinforced_Athena_C) == 0x000E48, "Wrong size on AB_Trap_Context_Reinforced_Athena_C");
static_assert(offsetof(AB_Trap_Context_Reinforced_Athena_C, UberGraphFrame) == 0x000E30, "Member 'AB_Trap_Context_Reinforced_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Trap_Context_Reinforced_Athena_C, GE_SetHealth) == 0x000E38, "Member 'AB_Trap_Context_Reinforced_Athena_C::GE_SetHealth' has a wrong offset!");
static_assert(offsetof(AB_Trap_Context_Reinforced_Athena_C, AttachedBuilding) == 0x000E40, "Member 'AB_Trap_Context_Reinforced_Athena_C::AttachedBuilding' has a wrong offset!");

}

