#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_WaffleTruck_Dub

#include "Basic.hpp"

#include "B_Shotgun_Standard_Athena_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_WaffleTruck_Dub.B_WaffleTruck_Dub_C
// 0x0058 (0x1B08 - 0x1AB0)
class AB_WaffleTruck_Dub_C final : public AB_Shotgun_Standard_Athena_C
{
public:
	bool                                          Debug;                                             // 0x1AB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB1[0x3];                                     // 0x1AB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FXTraceYawFullAngle;                               // 0x1AB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FXTracePitchFullAngle;                             // 0x1AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndOfCenterFXTrace;                                // 0x1ABC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        AllFXTraceEndPoints;                               // 0x1AC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                CurrentFXTraceEnd;                                 // 0x1AD8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentFXTraceWasHit;                              // 0x1AE4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE5[0x3];                                     // 0x1AE5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        AllFXTracerSpawnPoints;                            // 0x1AE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SpawnTracersInsteadOfDummyImpactFX;                // 0x1AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AF9[0x3];                                     // 0x1AF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MysteriousRangeBufferForTracers;                   // 0x1AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RangeLong;                                         // 0x1B00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_WaffleTruck_Dub_C">();
	}
	static class AB_WaffleTruck_Dub_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_WaffleTruck_Dub_C>();
	}
};
static_assert(alignof(AB_WaffleTruck_Dub_C) == 0x000008, "Wrong alignment on AB_WaffleTruck_Dub_C");
static_assert(sizeof(AB_WaffleTruck_Dub_C) == 0x001B08, "Wrong size on AB_WaffleTruck_Dub_C");
static_assert(offsetof(AB_WaffleTruck_Dub_C, Debug) == 0x001AB0, "Member 'AB_WaffleTruck_Dub_C::Debug' has a wrong offset!");
static_assert(offsetof(AB_WaffleTruck_Dub_C, FXTraceYawFullAngle) == 0x001AB4, "Member 'AB_WaffleTruck_Dub_C::FXTraceYawFullAngle' has a wrong offset!");
static_assert(offsetof(AB_WaffleTruck_Dub_C, FXTracePitchFullAngle) == 0x001AB8, "Member 'AB_WaffleTruck_Dub_C::FXTracePitchFullAngle' has a wrong offset!");
static_assert(offsetof(AB_WaffleTruck_Dub_C, EndOfCenterFXTrace) == 0x001ABC, "Member 'AB_WaffleTruck_Dub_C::EndOfCenterFXTrace' has a wrong offset!");
static_assert(offsetof(AB_WaffleTruck_Dub_C, AllFXTraceEndPoints) == 0x001AC8, "Member 'AB_WaffleTruck_Dub_C::AllFXTraceEndPoints' has a wrong offset!");
static_assert(offsetof(AB_WaffleTruck_Dub_C, CurrentFXTraceEnd) == 0x001AD8, "Member 'AB_WaffleTruck_Dub_C::CurrentFXTraceEnd' has a wrong offset!");
static_assert(offsetof(AB_WaffleTruck_Dub_C, CurrentFXTraceWasHit) == 0x001AE4, "Member 'AB_WaffleTruck_Dub_C::CurrentFXTraceWasHit' has a wrong offset!");
static_assert(offsetof(AB_WaffleTruck_Dub_C, AllFXTracerSpawnPoints) == 0x001AE8, "Member 'AB_WaffleTruck_Dub_C::AllFXTracerSpawnPoints' has a wrong offset!");
static_assert(offsetof(AB_WaffleTruck_Dub_C, SpawnTracersInsteadOfDummyImpactFX) == 0x001AF8, "Member 'AB_WaffleTruck_Dub_C::SpawnTracersInsteadOfDummyImpactFX' has a wrong offset!");
static_assert(offsetof(AB_WaffleTruck_Dub_C, MysteriousRangeBufferForTracers) == 0x001AFC, "Member 'AB_WaffleTruck_Dub_C::MysteriousRangeBufferForTracers' has a wrong offset!");
static_assert(offsetof(AB_WaffleTruck_Dub_C, RangeLong) == 0x001B00, "Member 'AB_WaffleTruck_Dub_C::RangeLong' has a wrong offset!");

}

