#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasicInteractionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BasicInteractionWidget.BasicInteractionWidget_C
// 0x0050 (0x02C0 - 0x0270)
class UBasicInteractionWidget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMultiInteractDisplayWidget_C*          MultiInteractDisplayWidget;                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                OuterBorder;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SubDescriptionAlertImage;                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SubTextBox;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDescription;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextSubDescription;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Description;                                       // 0x02A8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void UpdateMultiInteractionCount(int32 NewInteractionCount);
	void UpdateDescription(const class FText& Description_0, const struct FLinearColor& DescriptionColor, const class FText& SubDescription, const struct FLinearColor& SubDescriptionColor, int32 InteractionCount);
	void PreConstruct(bool IsDesignTime);
	void InitBasicInteraction();
	void Construct();
	void ExecuteUbergraph_BasicInteractionWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BasicInteractionWidget_C">();
	}
	static class UBasicInteractionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicInteractionWidget_C>();
	}
};
static_assert(alignof(UBasicInteractionWidget_C) == 0x000008, "Wrong alignment on UBasicInteractionWidget_C");
static_assert(sizeof(UBasicInteractionWidget_C) == 0x0002C0, "Wrong size on UBasicInteractionWidget_C");
static_assert(offsetof(UBasicInteractionWidget_C, UberGraphFrame) == 0x000270, "Member 'UBasicInteractionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBasicInteractionWidget_C, MultiInteractDisplayWidget) == 0x000278, "Member 'UBasicInteractionWidget_C::MultiInteractDisplayWidget' has a wrong offset!");
static_assert(offsetof(UBasicInteractionWidget_C, OuterBorder) == 0x000280, "Member 'UBasicInteractionWidget_C::OuterBorder' has a wrong offset!");
static_assert(offsetof(UBasicInteractionWidget_C, SubDescriptionAlertImage) == 0x000288, "Member 'UBasicInteractionWidget_C::SubDescriptionAlertImage' has a wrong offset!");
static_assert(offsetof(UBasicInteractionWidget_C, SubTextBox) == 0x000290, "Member 'UBasicInteractionWidget_C::SubTextBox' has a wrong offset!");
static_assert(offsetof(UBasicInteractionWidget_C, TextDescription) == 0x000298, "Member 'UBasicInteractionWidget_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UBasicInteractionWidget_C, TextSubDescription) == 0x0002A0, "Member 'UBasicInteractionWidget_C::TextSubDescription' has a wrong offset!");
static_assert(offsetof(UBasicInteractionWidget_C, Description) == 0x0002A8, "Member 'UBasicInteractionWidget_C::Description' has a wrong offset!");

}

