#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SCMachine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_SCMachine.BGA_Athena_SCMachine_C.BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x00C0 (0x00C0 - 0x0000)
struct BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000C0, "Wrong size on BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BGA_Athena_SCMachine.BGA_Athena_SCMachine_C.BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BGA_Athena_SCMachine.BGA_Athena_SCMachine_C.CheckQuestCredit
// 0x0038 (0x0038 - 0x0000)
struct BGA_Athena_SCMachine_C_CheckQuestCredit final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckCreativeMode_CanCompleteQuest; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SCMachine_C_CheckQuestCredit) == 0x000008, "Wrong alignment on BGA_Athena_SCMachine_C_CheckQuestCredit");
static_assert(sizeof(BGA_Athena_SCMachine_C_CheckQuestCredit) == 0x000038, "Wrong size on BGA_Athena_SCMachine_C_CheckQuestCredit");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_Athena_CheckCreativeMode_CanCompleteQuest) == 0x000018, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_Athena_CheckCreativeMode_CanCompleteQuest' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_Array_Get_Item) == 0x000020, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_GetQuestManager_ReturnValue) == 0x000028, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_Less_IntInt_ReturnValue) == 0x000035, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000036, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000037, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");

// Function BGA_Athena_SCMachine.BGA_Athena_SCMachine_C.ExecuteUbergraph_BGA_Athena_SCMachine
// 0x0710 (0x0710 - 0x0000)
struct BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_Event_PlayerPawn;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VictoryDrone_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InteractingPlayerCount, float MultiInteractMultiplier, float InteractingDuration)> K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x00A8(0x0020)()
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x00D8(0x0020)(ConstParm)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0118(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize10                  CallFunc_MakeVector_NetQuantize10_ReturnValue;     // 0x01E8(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x01F8(0x00C0)(ContainsInstancedReference)
	class AFortPawn*                              K2Node_CustomEvent_PhaseInPawn;                    // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_Event_AthenaPC_1;                           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02D8(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerControllerAthena*            K2Node_Event_AthenaPC;                             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize10                  CallFunc_MakeVector_NetQuantize10_ReturnValue_1;   // 0x030C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0318(0x00C0)(ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_TurnOn;                         // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue;         // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x03DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x03DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_1;       // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_2;       // 0x03DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x03DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_3;       // 0x03E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCooldownLength_ReturnValue;            // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x03E8(0x0010)(ConstParm, ReferenceParm)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_4;       // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_5;       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40A[0x2];                                      // 0x040A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_FloatToLinearColor_ReturnValue;      // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0428(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_6;       // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_CustomEvent_player;                         // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0458(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0478(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x0480(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_InteractingPawn;                // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x04B0(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x054D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x054E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54F[0x1];                                      // 0x054F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0558(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0564(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x057C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0598(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x05BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x05D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D5[0x3];                                      // 0x05D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_2;                            // 0x05D8(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x05E8(0x00C0)(ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x3];                                      // 0x06A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x06AC(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x06CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x06CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CE[0x2];                                      // 0x06CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_InFortPawn;                     // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InteractingPlayerCount;         // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MultiInteractMultiplier;        // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InteractingDuration;            // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x06E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E5[0x3];                                      // 0x06E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x06EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x3];                                      // 0x06F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultipleInteractionEnabled_ReturnValue; // 0x0701(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultipleInteractionEnabled_ReturnValue_1; // 0x0702(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine) == 0x000010, "Wrong alignment on BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine");
static_assert(sizeof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine) == 0x000710, "Wrong size on BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, EntryPoint) == 0x000000, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_Event_PlayerPawn) == 0x000020, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_Event_PlayerPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000068, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000088, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, Temp_object_Variable) == 0x000098, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, Temp_object_Variable_1) == 0x0000A0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, Temp_struct_Variable) == 0x0000A8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CustomEvent_GameState) == 0x0000C8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CustomEvent_Playlist) == 0x0000D0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CustomEvent_PlaylistContextTags) == 0x0000D8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0000F8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000100, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000108, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000110, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_bFromSweep) == 0x000114, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_SweepResult) == 0x000118, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001B4, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001C0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherActor) == 0x0001C8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherComp) == 0x0001D0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001D8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_X) == 0x0001DC, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_Y) == 0x0001E0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_Z) == 0x0001E4, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_MakeVector_NetQuantize10_ReturnValue) == 0x0001E8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_MakeVector_NetQuantize10_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_IsServer_ReturnValue) == 0x0001F4, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0001F8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CustomEvent_PhaseInPawn) == 0x0002B8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CustomEvent_PhaseInPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0002C0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_DynamicCast_bSuccess) == 0x0002C8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_IsServer_ReturnValue_1) == 0x0002C9, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_Event_AthenaPC_1) == 0x0002D0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_Event_AthenaPC_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002D8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_Event_AthenaPC) == 0x0002E8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_Event_AthenaPC' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0002F0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_IsActive_ReturnValue) == 0x0002FC, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_X_1) == 0x000300, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_Y_1) == 0x000304, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_Z_1) == 0x000308, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_MakeVector_NetQuantize10_ReturnValue_1) == 0x00030C, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_MakeVector_NetQuantize10_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x000318, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CustomEvent_TurnOn) == 0x0003D8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CustomEvent_TurnOn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetSpawnMachineState_ReturnValue) == 0x0003D9, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetSpawnMachineState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0003DA, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0003DB, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetSpawnMachineState_ReturnValue_1) == 0x0003DC, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetSpawnMachineState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetSpawnMachineState_ReturnValue_2) == 0x0003DD, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetSpawnMachineState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0003DE, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0003DF, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0003E0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BooleanOR_ReturnValue) == 0x0003E1, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetSpawnMachineState_ReturnValue_3) == 0x0003E2, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetSpawnMachineState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_SwitchEnum_CmpSuccess) == 0x0003E3, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetCooldownLength_ReturnValue) == 0x0003E4, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetCooldownLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, Temp_object_Variable_2) == 0x0003E8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetSpawnMachineState_ReturnValue_4) == 0x0003F8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetSpawnMachineState_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0003F9, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000400, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetSpawnMachineState_ReturnValue_5) == 0x000408, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetSpawnMachineState_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000409, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00040C, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
