#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_WestSausage_AttachmentPoint

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BGA_WestSausage_AttachmentPoint.BGA_WestSausage_AttachmentPoint_C.ExecuteUbergraph_BGA_WestSausage_AttachmentPoint
// 0x0558 (0x0558 - 0x0000)
struct BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Swing_GetStartPoint_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0080(0x00C0)(ContainsInstancedReference)
	float                                         K2Node_Event_Damage;                               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0148(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0174(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0220(0x0018)()
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x0238(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue; // 0x02D8(0x00C0)(ContainsInstancedReference)
	class AB_Ranged_WestSausage_Parallel_Athena_C* K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Ranged_WestSausage_Parallel_Athena_C* K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_1; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x03B8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x03CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x03E4(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0494(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BA[0x6];                                      // 0x04BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CA[0x6];                                      // 0x04CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0508(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0528(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Ranged_WestSausage_Parallel_Athena_C* K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_2; // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_542[0x6];                                      // 0x0542(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Ranged_WestSausage_Parallel_Athena_C* K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_3; // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint) == 0x000008, "Wrong alignment on BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint");
static_assert(sizeof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint) == 0x000558, "Wrong size on BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, EntryPoint) == 0x000000, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_HasAuthority_ReturnValue_1) == 0x000038, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000040, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_Swing_GetStartPoint_ReturnValue) == 0x00004C, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_Swing_GetStartPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000064, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000080, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_Event_Damage) == 0x000140, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_Event_DamageTags) == 0x000148, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_Event_Momentum) == 0x000168, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_Event_HitInfo) == 0x000174, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_Event_InstigatedBy) == 0x000210, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_Event_DamageCauser) == 0x000218, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_Event_EffectContext) == 0x000220, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CustomEvent_HitResult) == 0x000238, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CustomEvent_HitResult' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue) == 0x0002D8, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena) == 0x000398, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_bSuccess_1) == 0x0003A0, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, Temp_bool_Has_Been_Initd_Variable) == 0x0003A1, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_1) == 0x0003A8, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_1' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_bSuccess_2) == 0x0003B0, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0003B4, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003B8, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_VSize_ReturnValue) == 0x0003C8, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_Normal_ReturnValue) == 0x0003CC, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_MakeRotFromZ_ReturnValue) == 0x0003D8, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0003E4, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000480, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_FMin_ReturnValue) == 0x000484, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_MakeVector_ReturnValue) == 0x000488, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000494, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0004A0, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, Temp_bool_Has_Been_Initd_Variable_1) == 0x0004AC, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_Add_IntInt_ReturnValue) == 0x0004B0, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_Add_IntInt_ReturnValue_1) == 0x0004B4, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0004B8, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0004B9, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_GetAttachParentActor_ReturnValue) == 0x0004C0, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_BooleanAND_ReturnValue) == 0x0004C8, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, CallFunc_IsValid_ReturnValue) == 0x0004C9, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_AsBuilding_Actor) == 0x0004D0, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_bSuccess_3) == 0x0004D8, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CustomEvent_DestroyedActor) == 0x0004E0, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CustomEvent_DamagedActor) == 0x0004E8, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CustomEvent_Damage) == 0x0004F0, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CustomEvent_InstigatedBy) == 0x0004F8, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CustomEvent_DamageCauser) == 0x000500, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CustomEvent_HitLocation) == 0x000508, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CustomEvent_FHitComponent) == 0x000518, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CustomEvent_BoneName) == 0x000520, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_CustomEvent_Momentum) == 0x000528, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_2) == 0x000538, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_2' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_bSuccess_4) == 0x000540, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, Temp_bool_IsClosed_Variable_1) == 0x000541, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_3) == 0x000548, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_3' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_DynamicCast_bSuccess_5) == 0x000550, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint, K2Node_Event_DeltaSeconds) == 0x000554, "Member 'BGA_WestSausage_AttachmentPoint_C_ExecuteUbergraph_BGA_WestSausage_AttachmentPoint::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BGA_WestSausage_AttachmentPoint.BGA_WestSausage_AttachmentPoint_C.FallMulticast
// 0x009C (0x009C - 0x0000)
struct BGA_WestSausage_AttachmentPoint_C_FallMulticast final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_WestSausage_AttachmentPoint_C_FallMulticast) == 0x000004, "Wrong alignment on BGA_WestSausage_AttachmentPoint_C_FallMulticast");
static_assert(sizeof(BGA_WestSausage_AttachmentPoint_C_FallMulticast) == 0x00009C, "Wrong size on BGA_WestSausage_AttachmentPoint_C_FallMulticast");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_FallMulticast, HitResult) == 0x000000, "Member 'BGA_WestSausage_AttachmentPoint_C_FallMulticast::HitResult' has a wrong offset!");

// Function BGA_WestSausage_AttachmentPoint.BGA_WestSausage_AttachmentPoint_C.OnDamageServer
// 0x00F8 (0x00F8 - 0x0000)
struct BGA_WestSausage_AttachmentPoint_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00E0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BGA_WestSausage_AttachmentPoint_C_OnDamageServer) == 0x000008, "Wrong alignment on BGA_WestSausage_AttachmentPoint_C_OnDamageServer");
static_assert(sizeof(BGA_WestSausage_AttachmentPoint_C_OnDamageServer) == 0x0000F8, "Wrong size on BGA_WestSausage_AttachmentPoint_C_OnDamageServer");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_OnDamageServer, Damage) == 0x000000, "Member 'BGA_WestSausage_AttachmentPoint_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_OnDamageServer, DamageTags) == 0x000008, "Member 'BGA_WestSausage_AttachmentPoint_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_OnDamageServer, Momentum) == 0x000028, "Member 'BGA_WestSausage_AttachmentPoint_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_OnDamageServer, HitInfo) == 0x000034, "Member 'BGA_WestSausage_AttachmentPoint_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_OnDamageServer, InstigatedBy) == 0x0000D0, "Member 'BGA_WestSausage_AttachmentPoint_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_OnDamageServer, DamageCauser) == 0x0000D8, "Member 'BGA_WestSausage_AttachmentPoint_C_OnDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_OnDamageServer, EffectContext) == 0x0000E0, "Member 'BGA_WestSausage_AttachmentPoint_C_OnDamageServer::EffectContext' has a wrong offset!");

// Function BGA_WestSausage_AttachmentPoint.BGA_WestSausage_AttachmentPoint_C.ParentDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BGA_WestSausage_AttachmentPoint_C_ParentDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_WestSausage_AttachmentPoint_C_ParentDestroyed) == 0x000008, "Wrong alignment on BGA_WestSausage_AttachmentPoint_C_ParentDestroyed");
static_assert(sizeof(BGA_WestSausage_AttachmentPoint_C_ParentDestroyed) == 0x000008, "Wrong size on BGA_WestSausage_AttachmentPoint_C_ParentDestroyed");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ParentDestroyed, DestroyedActor) == 0x000000, "Member 'BGA_WestSausage_AttachmentPoint_C_ParentDestroyed::DestroyedActor' has a wrong offset!");

// Function BGA_WestSausage_AttachmentPoint.BGA_WestSausage_AttachmentPoint_C.ParentDied
// 0x0050 (0x0050 - 0x0000)
struct BGA_WestSausage_AttachmentPoint_C_ParentDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_WestSausage_AttachmentPoint_C_ParentDied) == 0x000008, "Wrong alignment on BGA_WestSausage_AttachmentPoint_C_ParentDied");
static_assert(sizeof(BGA_WestSausage_AttachmentPoint_C_ParentDied) == 0x000050, "Wrong size on BGA_WestSausage_AttachmentPoint_C_ParentDied");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ParentDied, DamagedActor) == 0x000000, "Member 'BGA_WestSausage_AttachmentPoint_C_ParentDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ParentDied, Damage) == 0x000008, "Member 'BGA_WestSausage_AttachmentPoint_C_ParentDied::Damage' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ParentDied, InstigatedBy) == 0x000010, "Member 'BGA_WestSausage_AttachmentPoint_C_ParentDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ParentDied, DamageCauser) == 0x000018, "Member 'BGA_WestSausage_AttachmentPoint_C_ParentDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ParentDied, HitLocation) == 0x000020, "Member 'BGA_WestSausage_AttachmentPoint_C_ParentDied::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ParentDied, FHitComponent) == 0x000030, "Member 'BGA_WestSausage_AttachmentPoint_C_ParentDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ParentDied, BoneName) == 0x000038, "Member 'BGA_WestSausage_AttachmentPoint_C_ParentDied::BoneName' has a wrong offset!");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ParentDied, Momentum) == 0x000040, "Member 'BGA_WestSausage_AttachmentPoint_C_ParentDied::Momentum' has a wrong offset!");

// Function BGA_WestSausage_AttachmentPoint.BGA_WestSausage_AttachmentPoint_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BGA_WestSausage_AttachmentPoint_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_WestSausage_AttachmentPoint_C_ReceiveTick) == 0x000004, "Wrong alignment on BGA_WestSausage_AttachmentPoint_C_ReceiveTick");
static_assert(sizeof(BGA_WestSausage_AttachmentPoint_C_ReceiveTick) == 0x000004, "Wrong size on BGA_WestSausage_AttachmentPoint_C_ReceiveTick");
static_assert(offsetof(BGA_WestSausage_AttachmentPoint_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BGA_WestSausage_AttachmentPoint_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

