#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_ValetMod_OffRoadTire_Pickup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnInteract");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnInteract) == 0x000010, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnInteract");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.BlueprintOnLocalInteract
// 0x01D0 (0x01D0 - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract final
{
public:
	class AFortPlayerPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortItemEntry                         CallFunc_CreateItemEntry_ReturnValue;              // 0x0018(0x01A0)()
	int32                                         CallFunc_CountInventoryOverflowFromAddingItem_ReturnValue; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract) == 0x000008, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract) == 0x0001D0, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract, InteractingPawn) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract, InteractionBeingAttempted) == 0x000008, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract, ReturnValue) == 0x000009, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000010, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract, CallFunc_CreateItemEntry_ReturnValue) == 0x000018, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract::CallFunc_CreateItemEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract, CallFunc_CountInventoryOverflowFromAddingItem_ReturnValue) == 0x0001B8, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract::CallFunc_CountInventoryOverflowFromAddingItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract, CallFunc_Greater_IntInt_ReturnValue) == 0x0001BC, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001C0, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BlueprintOnLocalInteract::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature
// 0x009C (0x009C - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature) == 0x000004, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature) == 0x00009C, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature::ImpactResult' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileBounceDelegate__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileBounceDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactVelocity;                                    // 0x009C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileBounceDelegate__DelegateSignature) == 0x000004, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileBounceDelegate__DelegateSignature");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileBounceDelegate__DelegateSignature) == 0x0000A8, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileBounceDelegate__DelegateSignature");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileBounceDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileBounceDelegate__DelegateSignature::ImpactResult' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileBounceDelegate__DelegateSignature, ImpactVelocity) == 0x00009C, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileBounceDelegate__DelegateSignature::ImpactVelocity' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         WaterInteractionComponent;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature, WaterInteractionComponent) == 0x000008, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature::WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_4_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00C0 (0x00C0 - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000C0, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_BndEvt__JumpCollision_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.CalcVehicleImpulse
// 0x0060 (0x0060 - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse final
{
public:
	class AActor*                                 Vehicle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityMultiplier;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vector;                                            // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse) == 0x000008, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse) == 0x000060, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, Vehicle) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::Vehicle' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, VelocityMultiplier) == 0x000008, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::VelocityMultiplier' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, Vector) == 0x00000C, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::Vector' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_GetVelocity_ReturnValue) == 0x000018, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_BreakVector_X) == 0x000024, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_BreakVector_Y) == 0x000028, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_BreakVector_Z) == 0x00002C, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_VSize_ReturnValue) == 0x000030, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000034, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000038, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00003C, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000040, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_FClamp_ReturnValue) == 0x000044, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse, CallFunc_ClampVectorSize_ReturnValue) == 0x000054, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CalcVehicleImpulse::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.CeilingCheck
// 0x0140 (0x0140 - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0070(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_CapsuleTraceSingle_OutHit;                // 0x0080(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingle_ReturnValue;           // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors_1;            // 0x0128(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck) == 0x000008, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck) == 0x000140, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, Success) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::Success' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, ActorsToIgnore) == 0x000008, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000028, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000034, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_BreakVector_X) == 0x000040, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_BreakVector_Y) == 0x000044, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_BreakVector_Z) == 0x000048, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_Add_FloatFloat_ReturnValue) == 0x000050, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000054, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_MakeVector_ReturnValue_1) == 0x000064, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_GetAttachedActors_OutActors) == 0x000070, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_CapsuleTraceSingle_OutHit) == 0x000080, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_CapsuleTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_CapsuleTraceSingle_ReturnValue) == 0x00011C, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_CapsuleTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_Array_Get_Item) == 0x000120, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_GetAttachedActors_OutActors_1) == 0x000128, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_GetAttachedActors_OutActors_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_Array_Length_ReturnValue) == 0x000138, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck, CallFunc_Less_IntInt_ReturnValue) == 0x00013C, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_CeilingCheck::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.DebugJumpCapsule
// 0x001C (0x001C - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_DebugJumpCapsule final
{
public:
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_DebugJumpCapsule) == 0x000004, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_DebugJumpCapsule");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_DebugJumpCapsule) == 0x00001C, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_DebugJumpCapsule");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_DebugJumpCapsule, CallFunc_IsServer_ReturnValue) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_DebugJumpCapsule::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_DebugJumpCapsule, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000004, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_DebugJumpCapsule::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_DebugJumpCapsule, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_DebugJumpCapsule::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.EventAttachedActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedActorDestroyed) == 0x000008, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedActorDestroyed");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedActorDestroyed) == 0x000008, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedActorDestroyed");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedActorDestroyed, DestroyedActor) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedActorDestroyed::DestroyedActor' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.EventAttachedBADied
// 0x0050 (0x0050 - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied) == 0x000008, "Wrong alignment on BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied");
static_assert(sizeof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied) == 0x000050, "Wrong size on BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied, DamagedActor) == 0x000000, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied::DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied, Damage) == 0x000008, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied::Damage' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied, InstigatedBy) == 0x000010, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied, DamageCauser) == 0x000018, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied, HitLocation) == 0x000020, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied, FHitComponent) == 0x000030, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied::FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied, BoneName) == 0x000038, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied::BoneName' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied, Momentum) == 0x000040, "Member 'BGA_ValetMod_OffRoadTire_Pickup_C_EventAttachedBADied::Momentum' has a wrong offset!");

// Function BGA_ValetMod_OffRoadTire_Pickup.BGA_ValetMod_OffRoadTire_Pickup_C.ExecuteUbergraph_BGA_ValetMod_OffRoadTire_Pickup
// 0x0B10 (0x0B10 - 0x0000)
struct BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_BGA_ValetMod_OffRoadTire_Pickup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_StartFrame;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_EndFrame;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0030(0x00C0)(ContainsInstancedReference)
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput; // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	const class UFortWorldItem*                   CallFunc_GiveItemToInventoryOwner_ReturnValue;     // 0x0100(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_AddItemToInventoryOwner_InventoryOwner_CastInput; // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_AddItemToInventoryOwner_ReturnValue;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage_1;                             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0120(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x014C(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x01F8(0x0018)()
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0240(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DE[0x2];                                      // 0x02DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanActorSimulatePhysics_ReturnValue;      // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x039C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LaunchHoverboard_Success;                 // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x03B4(0x0010)(ZeroConstructor, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x03C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
