#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SCMachine_Redux

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BGA_Athena_SCMachine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_SCMachine_Redux.BGA_Athena_SCMachine_Redux_C
// 0x0048 (0x0D90 - 0x0D48)
class ABGA_Athena_SCMachine_Redux_C final : public ABGA_Athena_SCMachine_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Athena_SCMachine_Redux_C;       // 0x0D48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Rift;                                           // 0x0D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Rift_Idle_Loop;                                  // 0x0D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_RiftClosingUp;                                   // 0x0D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RiftScale_Scale_224939934C3BAF72F8694E85ABD099D0;  // 0x0D68(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RiftScale__Direction_224939934C3BAF72F8694E85ABD099D0; // 0x0D74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D75[0x3];                                      // 0x0D75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RiftScale;                                         // 0x0D78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_SpawnRift;                                       // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rift_Play_Rate;                                    // 0x0D88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_Athena_SCMachine_Redux(int32 EntryPoint);
	void OnSpawnMachineStateChanged();
	void ReceiveBeginPlay();
	void Reset_Rift();
	void RiftScale__FinishedFunc();
	void RiftScale__UpdateFunc();
	void SpawnRift(class AFortPawn* InFortPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_SCMachine_Redux_C">();
	}
	static class ABGA_Athena_SCMachine_Redux_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_SCMachine_Redux_C>();
	}
};
static_assert(alignof(ABGA_Athena_SCMachine_Redux_C) == 0x000008, "Wrong alignment on ABGA_Athena_SCMachine_Redux_C");
static_assert(sizeof(ABGA_Athena_SCMachine_Redux_C) == 0x000D90, "Wrong size on ABGA_Athena_SCMachine_Redux_C");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, UberGraphFrame_BGA_Athena_SCMachine_Redux_C) == 0x000D48, "Member 'ABGA_Athena_SCMachine_Redux_C::UberGraphFrame_BGA_Athena_SCMachine_Redux_C' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, SM_Rift) == 0x000D50, "Member 'ABGA_Athena_SCMachine_Redux_C::SM_Rift' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, P_Rift_Idle_Loop) == 0x000D58, "Member 'ABGA_Athena_SCMachine_Redux_C::P_Rift_Idle_Loop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, P_RiftClosingUp) == 0x000D60, "Member 'ABGA_Athena_SCMachine_Redux_C::P_RiftClosingUp' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, RiftScale_Scale_224939934C3BAF72F8694E85ABD099D0) == 0x000D68, "Member 'ABGA_Athena_SCMachine_Redux_C::RiftScale_Scale_224939934C3BAF72F8694E85ABD099D0' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, RiftScale__Direction_224939934C3BAF72F8694E85ABD099D0) == 0x000D74, "Member 'ABGA_Athena_SCMachine_Redux_C::RiftScale__Direction_224939934C3BAF72F8694E85ABD099D0' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, RiftScale) == 0x000D78, "Member 'ABGA_Athena_SCMachine_Redux_C::RiftScale' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, P_SpawnRift) == 0x000D80, "Member 'ABGA_Athena_SCMachine_Redux_C::P_SpawnRift' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, Rift_Play_Rate) == 0x000D88, "Member 'ABGA_Athena_SCMachine_Redux_C::Rift_Play_Rate' has a wrong offset!");

}

