#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_GenericCurieFuel_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C
// 0x0090 (0x0950 - 0x08C0)
class ABGA_GenericCurieFuel_Parent_C : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Curie_Mesh;                                        // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortProjectileMovementComponent*       FortProjectileMovement;                            // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ActorLifespanAfterIgnition;                        // 0x08E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_8E4[0x4];                                      // 0x08E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingWall*                          LocalWall;                                         // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgniteSelf;                                        // 0x08F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F1[0x3];                                      // 0x08F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SelfFireMagnitude;                                 // 0x08F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         SelfPropagationFuel;                               // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         SelfCurieLandscapeIgnitionRadius;                  // 0x08FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShouldFireFallWithGravity;                         // 0x0900(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgniteNearbyMaterialsImmediately;                  // 0x0901(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_902[0x2];                                      // 0x0902(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IgniteNearbyMaterialsRadius;                       // 0x0904(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         IgniteNearbyMaterialsFireMagnitude;                // 0x0908(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         IgniteNearbyMaterialsPropogationFuel;              // 0x090C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         IgniteNearbyMaterialsLandscapeIgnitionRadius;      // 0x0910(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_914[0x4];                                      // 0x0914(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      IgniteMaterialsObjectTypes;                        // 0x0918(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 IgniteMaterialsClassFilter;                        // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ResumeSimulation;                                  // 0x0930(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          CurieActive;                                       // 0x0931(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurieHitVehicle;                                   // 0x0932(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_933[0x5];                                      // 0x0933(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 HitActor;                                          // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreHits;                                        // 0x0948(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AttachedComponentDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void BaseDied(class AActor* DestroyedActor);
	void BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature(const struct FHitResult& ImpactResult, const struct FVector& ImpactVelocity);
	void BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature(const struct FHitResult& ImpactResult);
	void ExecuteUbergraph_BGA_GenericCurieFuel_Parent(int32 EntryPoint);
	void HandleHits(class UObject* ObjectRef, class UPrimitiveComponent* PrimitiveObjectRef);
	void HitBuildingActor(class UObject* ObjectRef, class UPrimitiveComponent* PrimitiveObjectRef, bool* Success);
	void HitBuildingWall(class UObject* ObjectRef, class UPrimitiveComponent* PrimitiveObjectRef, bool* Success);
	void HitVehicle(class UObject* ObjectRef, class UPrimitiveComponent* PrimitiveObjectRef, bool* Success);
	void IgniteNearbyMaterials(const struct FVector& SpherePos);
	void OnCurieActive_112B241847E303B58BF962A699068D1C();
	void OnCurieElementDetached_BP(const struct FCurieContainerHandle& CurieContainerHandle, const struct FGameplayTag& ElementTag);
	void OnRep_ResumeSimulation();
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void SelfIgnite();

	void ShouldPlayNativeCurieFX(EFortCurieNativeFXType FXType, struct FFortNativeCurieFXResponse* OutResponse) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_GenericCurieFuel_Parent_C">();
	}
	static class ABGA_GenericCurieFuel_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_GenericCurieFuel_Parent_C>();
	}
};
static_assert(alignof(ABGA_GenericCurieFuel_Parent_C) == 0x000008, "Wrong alignment on ABGA_GenericCurieFuel_Parent_C");
static_assert(sizeof(ABGA_GenericCurieFuel_Parent_C) == 0x000950, "Wrong size on ABGA_GenericCurieFuel_Parent_C");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, UberGraphFrame) == 0x0008C0, "Member 'ABGA_GenericCurieFuel_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, Curie_Mesh) == 0x0008C8, "Member 'ABGA_GenericCurieFuel_Parent_C::Curie_Mesh' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, Sphere) == 0x0008D0, "Member 'ABGA_GenericCurieFuel_Parent_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, FortProjectileMovement) == 0x0008D8, "Member 'ABGA_GenericCurieFuel_Parent_C::FortProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, ActorLifespanAfterIgnition) == 0x0008E0, "Member 'ABGA_GenericCurieFuel_Parent_C::ActorLifespanAfterIgnition' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, LocalWall) == 0x0008E8, "Member 'ABGA_GenericCurieFuel_Parent_C::LocalWall' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, IgniteSelf) == 0x0008F0, "Member 'ABGA_GenericCurieFuel_Parent_C::IgniteSelf' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, SelfFireMagnitude) == 0x0008F4, "Member 'ABGA_GenericCurieFuel_Parent_C::SelfFireMagnitude' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, SelfPropagationFuel) == 0x0008F8, "Member 'ABGA_GenericCurieFuel_Parent_C::SelfPropagationFuel' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, SelfCurieLandscapeIgnitionRadius) == 0x0008FC, "Member 'ABGA_GenericCurieFuel_Parent_C::SelfCurieLandscapeIgnitionRadius' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, ShouldFireFallWithGravity) == 0x000900, "Member 'ABGA_GenericCurieFuel_Parent_C::ShouldFireFallWithGravity' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, IgniteNearbyMaterialsImmediately) == 0x000901, "Member 'ABGA_GenericCurieFuel_Parent_C::IgniteNearbyMaterialsImmediately' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, IgniteNearbyMaterialsRadius) == 0x000904, "Member 'ABGA_GenericCurieFuel_Parent_C::IgniteNearbyMaterialsRadius' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, IgniteNearbyMaterialsFireMagnitude) == 0x000908, "Member 'ABGA_GenericCurieFuel_Parent_C::IgniteNearbyMaterialsFireMagnitude' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, IgniteNearbyMaterialsPropogationFuel) == 0x00090C, "Member 'ABGA_GenericCurieFuel_Parent_C::IgniteNearbyMaterialsPropogationFuel' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, IgniteNearbyMaterialsLandscapeIgnitionRadius) == 0x000910, "Member 'ABGA_GenericCurieFuel_Parent_C::IgniteNearbyMaterialsLandscapeIgnitionRadius' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, IgniteMaterialsObjectTypes) == 0x000918, "Member 'ABGA_GenericCurieFuel_Parent_C::IgniteMaterialsObjectTypes' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, IgniteMaterialsClassFilter) == 0x000928, "Member 'ABGA_GenericCurieFuel_Parent_C::IgniteMaterialsClassFilter' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, ResumeSimulation) == 0x000930, "Member 'ABGA_GenericCurieFuel_Parent_C::ResumeSimulation' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, CurieActive) == 0x000931, "Member 'ABGA_GenericCurieFuel_Parent_C::CurieActive' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, CurieHitVehicle) == 0x000932, "Member 'ABGA_GenericCurieFuel_Parent_C::CurieHitVehicle' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, HitActor) == 0x000938, "Member 'ABGA_GenericCurieFuel_Parent_C::HitActor' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, HitComponent) == 0x000940, "Member 'ABGA_GenericCurieFuel_Parent_C::HitComponent' has a wrong offset!");
static_assert(offsetof(ABGA_GenericCurieFuel_Parent_C, IgnoreHits) == 0x000948, "Member 'ABGA_GenericCurieFuel_Parent_C::IgnoreHits' has a wrong offset!");

}

