#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_FlopperSpawn_World

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BGA_Athena_FlopperSpawn_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_FlopperSpawn_World.BGA_Athena_FlopperSpawn_World_C
// 0x0158 (0x0E98 - 0x0D40)
class ABGA_Athena_FlopperSpawn_World_C final : public ABGA_Athena_FlopperSpawn_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Athena_FlopperSpawn_World_C;    // 0x0D40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio_FlopperLoop;                                 // 0x0D48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Flopper_Spot;                                   // 0x0D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Time_Interval;                                     // 0x0D58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetDistance;                                    // 0x0D5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeIntervalOffset;                                // 0x0D60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D64[0x4];                                      // 0x0D64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         NS_FX_Jump;                                        // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_Jump;                                           // 0x0D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceOffsetAmount;                                 // 0x0D78(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D84[0x4];                                      // 0x0D84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    FortWaterBody;                                     // 0x0D88(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterPlaneOffset;                                  // 0x0D90(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9C[0x4];                                      // 0x0D9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_AmbientFishFlop;                             // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ExplosionItemSpawnOffset;                          // 0x0DA8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB4[0x4];                                      // 0x0DB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  T_FlopperSpawn;                                    // 0x0DB8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MinDistanceToExplosion;                            // 0x0DD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DDC[0x4];                                      // 0x0DDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class FName>        MAP_TagToLootExplode;                              // 0x0DE0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   ExplodeItemsToDrop;                                // 0x0E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExplodeRolls;                                      // 0x0E38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterNormalHit;                                    // 0x0E3C(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasWrittenAnalytic;                               // 0x0E48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E49[0x7];                                      // 0x0E49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  BattleLabProjectileTag;                            // 0x0E50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  ExplosionSpawnTag;                                 // 0x0E70(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                          TestForWaterOnStart;                               // 0x0E90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SpawnJumpingFish();
	void SpawnFromExplosion(class AActor* Instigator_0, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	float RandomTimeInterval();
	void OnRep_FortWaterBody();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void GetLootTier(bool IsExplosion, bool IsProFishingRod, class FName* Output_Get);
	void ExplosionQuestProgress(class AActor* Instigator_0, class AActor* DamageCauser);
	void ExecuteUbergraph_BGA_Athena_FlopperSpawn_World(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_FlopperSpawn_World_C">();
	}
	static class ABGA_Athena_FlopperSpawn_World_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_FlopperSpawn_World_C>();
	}
};
static_assert(alignof(ABGA_Athena_FlopperSpawn_World_C) == 0x000008, "Wrong alignment on ABGA_Athena_FlopperSpawn_World_C");
static_assert(sizeof(ABGA_Athena_FlopperSpawn_World_C) == 0x000E98, "Wrong size on ABGA_Athena_FlopperSpawn_World_C");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, UberGraphFrame_BGA_Athena_FlopperSpawn_World_C) == 0x000D40, "Member 'ABGA_Athena_FlopperSpawn_World_C::UberGraphFrame_BGA_Athena_FlopperSpawn_World_C' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, Audio_FlopperLoop) == 0x000D48, "Member 'ABGA_Athena_FlopperSpawn_World_C::Audio_FlopperLoop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, NS_Flopper_Spot) == 0x000D50, "Member 'ABGA_Athena_FlopperSpawn_World_C::NS_Flopper_Spot' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, Time_Interval) == 0x000D58, "Member 'ABGA_Athena_FlopperSpawn_World_C::Time_Interval' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, OffsetDistance) == 0x000D5C, "Member 'ABGA_Athena_FlopperSpawn_World_C::OffsetDistance' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, TimeIntervalOffset) == 0x000D60, "Member 'ABGA_Athena_FlopperSpawn_World_C::TimeIntervalOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, NS_FX_Jump) == 0x000D68, "Member 'ABGA_Athena_FlopperSpawn_World_C::NS_FX_Jump' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, FX_Jump) == 0x000D70, "Member 'ABGA_Athena_FlopperSpawn_World_C::FX_Jump' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, TraceOffsetAmount) == 0x000D78, "Member 'ABGA_Athena_FlopperSpawn_World_C::TraceOffsetAmount' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, FortWaterBody) == 0x000D88, "Member 'ABGA_Athena_FlopperSpawn_World_C::FortWaterBody' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, WaterPlaneOffset) == 0x000D90, "Member 'ABGA_Athena_FlopperSpawn_World_C::WaterPlaneOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, Sound_AmbientFishFlop) == 0x000DA0, "Member 'ABGA_Athena_FlopperSpawn_World_C::Sound_AmbientFishFlop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, ExplosionItemSpawnOffset) == 0x000DA8, "Member 'ABGA_Athena_FlopperSpawn_World_C::ExplosionItemSpawnOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, T_FlopperSpawn) == 0x000DB8, "Member 'ABGA_Athena_FlopperSpawn_World_C::T_FlopperSpawn' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, MinDistanceToExplosion) == 0x000DD8, "Member 'ABGA_Athena_FlopperSpawn_World_C::MinDistanceToExplosion' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, MAP_TagToLootExplode) == 0x000DE0, "Member 'ABGA_Athena_FlopperSpawn_World_C::MAP_TagToLootExplode' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, ExplodeItemsToDrop) == 0x000E30, "Member 'ABGA_Athena_FlopperSpawn_World_C::ExplodeItemsToDrop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, ExplodeRolls) == 0x000E38, "Member 'ABGA_Athena_FlopperSpawn_World_C::ExplodeRolls' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, WaterNormalHit) == 0x000E3C, "Member 'ABGA_Athena_FlopperSpawn_World_C::WaterNormalHit' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, bHasWrittenAnalytic) == 0x000E48, "Member 'ABGA_Athena_FlopperSpawn_World_C::bHasWrittenAnalytic' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, BattleLabProjectileTag) == 0x000E50, "Member 'ABGA_Athena_FlopperSpawn_World_C::BattleLabProjectileTag' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, ExplosionSpawnTag) == 0x000E70, "Member 'ABGA_Athena_FlopperSpawn_World_C::ExplosionSpawnTag' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, TestForWaterOnStart) == 0x000E90, "Member 'ABGA_Athena_FlopperSpawn_World_C::TestForWaterOnStart' has a wrong offset!");

}

