#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollectionItemToast_Fishing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AthenaCollectionItemToast_Fishing.BP_AthenaCollectionItemToast_Fishing_C
// 0x00A0 (0x0408 - 0x0368)
class UBP_AthenaCollectionItemToast_Fishing_C final : public UAthenaCollectionItemToastFishing
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StarScale;                                         // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeaderTransition;                                  // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewFish;                                           // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_3starglow;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RelativeSizeMeter;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RelativeSizePointer;                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_StarRating;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NewType;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_ClueText;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_LeaderType;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_MobileClueText;                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_SizeInfo;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CollectionPrompt;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FirstCatch;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MobileCollectionPrompt;                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NewClue;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NewClue_1;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              VisibilitySwitcher_ToastType;                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFortCollectedState                           CollectedState;                                    // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsClueQueued;                                      // 0x0401(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsToastInProgress;                                 // 0x0402(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_403[0x1];                                      // 0x0403(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Star_Rating;                                       // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowStars();
	void SequenceEvent__ENTRYPOINTBP_AthenaCollectionItemToast_Fishing_1();
	void SequenceEvent__ENTRYPOINTBP_AthenaCollectionItemToast_Fishing_0();
	void ResetAnims();
	void ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing(int32 EntryPoint);
	void Play_Catch_Audio();
	void BP_OnUnlockedNewClue();
	void BP_OnToastUpdated(EFortCollectedState CollectedState_0, int32 NumCollected);
	void BP_OnToastReset();
	void BP_OnStarRatingSet(int32 StarRating);
	void BP_OnRankSet(int32 Rank, int32 NumEntries);
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength);
	void BP_OnDisplayToast();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AthenaCollectionItemToast_Fishing_C">();
	}
	static class UBP_AthenaCollectionItemToast_Fishing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AthenaCollectionItemToast_Fishing_C>();
	}
};
static_assert(alignof(UBP_AthenaCollectionItemToast_Fishing_C) == 0x000008, "Wrong alignment on UBP_AthenaCollectionItemToast_Fishing_C");
static_assert(sizeof(UBP_AthenaCollectionItemToast_Fishing_C) == 0x000408, "Wrong size on UBP_AthenaCollectionItemToast_Fishing_C");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, UberGraphFrame) == 0x000368, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, StarScale) == 0x000370, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::StarScale' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, LeaderTransition) == 0x000378, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::LeaderTransition' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, NewFish) == 0x000380, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::NewFish' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Image_3starglow) == 0x000388, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Image_3starglow' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Image_RelativeSizeMeter) == 0x000390, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Image_RelativeSizeMeter' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Image_RelativeSizePointer) == 0x000398, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Image_RelativeSizePointer' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Image_StarRating) == 0x0003A0, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Image_StarRating' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Overlay_NewType) == 0x0003A8, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Overlay_NewType' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Switcher_ClueText) == 0x0003B0, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Switcher_ClueText' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Switcher_LeaderType) == 0x0003B8, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Switcher_LeaderType' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Switcher_MobileClueText) == 0x0003C0, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Switcher_MobileClueText' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Switcher_SizeInfo) == 0x0003C8, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Switcher_SizeInfo' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Text_CollectionPrompt) == 0x0003D0, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Text_CollectionPrompt' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Text_FirstCatch) == 0x0003D8, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Text_FirstCatch' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Text_MobileCollectionPrompt) == 0x0003E0, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Text_MobileCollectionPrompt' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Text_NewClue) == 0x0003E8, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Text_NewClue' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Text_NewClue_1) == 0x0003F0, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Text_NewClue_1' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, VisibilitySwitcher_ToastType) == 0x0003F8, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::VisibilitySwitcher_ToastType' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, CollectedState) == 0x000400, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::CollectedState' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, IsClueQueued) == 0x000401, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::IsClueQueued' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, IsToastInProgress) == 0x000402, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::IsToastInProgress' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_Fishing_C, Star_Rating) == 0x000404, "Member 'UBP_AthenaCollectionItemToast_Fishing_C::Star_Rating' has a wrong offset!");

}

