#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollectionItemToast_Fishing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaCollectionItemToast_Fishing.BP_AthenaCollectionItemToast_Fishing_C.ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing
// 0x01F0 (0x01F0 - 0x0000)
struct BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_5;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           Temp_byte_Variable_2;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_10;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_14;                              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_6;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           K2Node_Event_CollectedState;                       // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NumCollected;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_StarRating;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_4;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_5;                           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_6;                           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_7;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_8;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_9;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_10;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_11;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_12;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NormalizedLength;                     // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NormalizedMinLength;                  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NormalizedMaxLength;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0174(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Rank;                                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumEntries;                           // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_9;                           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_2;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_3;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_4;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPCallableIsDesignTime_ReturnValue;       // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPCallableIsDesignTime_ReturnValue_1;     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_13;                           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_10;                          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           Temp_byte_Variable_9;                              // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_11;                          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing) == 0x000008, "Wrong alignment on BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing");
static_assert(sizeof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing) == 0x0001F0, "Wrong size on BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, EntryPoint) == 0x000000, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable) == 0x000008, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_1) == 0x000010, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable) == 0x000018, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_2) == 0x000020, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_3) == 0x000028, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_4) == 0x000030, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_5) == 0x000038, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_bool_Variable) == 0x000040, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_byte_Variable) == 0x000041, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_byte_Variable_1) == 0x000042, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_byte_Variable_2) == 0x000043, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_1) == 0x000044, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_2) == 0x000048, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_3) == 0x00004C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_4) == 0x000050, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_5) == 0x000054, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_6) == 0x000058, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_7) == 0x00005C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_8) == 0x000060, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_9) == 0x000064, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_bool_Variable_1) == 0x000068, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_10) == 0x00006C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_11) == 0x000070, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_bool_Variable_2) == 0x000074, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_byte_Variable_3) == 0x000075, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_byte_Variable_4) == 0x000076, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_bool_Variable_3) == 0x000077, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_float_Variable) == 0x000078, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_float_Variable_1) == 0x00007C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_bool_Variable_4) == 0x000080, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_float_Variable_2) == 0x000084, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_float_Variable_3) == 0x000088, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_MakeLiteralByte_ReturnValue) == 0x00008C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_bool_Variable_5) == 0x00008D, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_byte_Variable_5) == 0x00008E, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_byte_Variable_6) == 0x00008F, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_bool_Variable_6) == 0x000090, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_byte_Variable_7) == 0x000091, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_byte_Variable_8) == 0x000092, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_bool_Variable_7) == 0x000093, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_12) == 0x000094, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_13) == 0x000098, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_bool_Variable_8) == 0x00009C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_14) == 0x0000A0, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_int_Variable_15) == 0x0000A4, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_int_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default) == 0x0000B0, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_6) == 0x0000B8, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_GetEndTime_ReturnValue) == 0x0000C0, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000C8, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000D0, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Event_CollectedState) == 0x0000D4, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Event_CollectedState' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Event_NumCollected) == 0x0000D8, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Event_NumCollected' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Event_StarRating) == 0x0000DC, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Event_StarRating' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E0, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E1, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default_1) == 0x0000E2, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default_2) == 0x0000E4, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default_3) == 0x0000E8, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default_4) == 0x0000EC, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default_5) == 0x0000F4, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default_6) == 0x0000F8, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000FC, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_Greater_ByteByte_ReturnValue) == 0x0000FD, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default_7) == 0x0000FE, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default_8) == 0x0000FF, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_7) == 0x000100, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000108, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_8) == 0x000110, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_9) == 0x000118, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000120, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_BreakVector2D_X) == 0x000128, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_BreakVector2D_Y) == 0x00012C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_10) == 0x000130, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_11) == 0x000138, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_12) == 0x000140, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Event_NormalizedLength) == 0x000148, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Event_NormalizedLength' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Event_NormalizedMinLength) == 0x00014C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Event_NormalizedMinLength' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Event_NormalizedMaxLength) == 0x000150, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Event_NormalizedMaxLength' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_BreakVector2D_X_1) == 0x000154, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_BreakVector2D_Y_1) == 0x000158, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_MapRangeClamped_ReturnValue) == 0x00015C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000160, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_Lerp_ReturnValue) == 0x000164, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000168, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_Lerp_ReturnValue_1) == 0x00016C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000170, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_MakeVector2D_ReturnValue) == 0x000174, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Event_Rank) == 0x00017C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Event_Rank' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Event_NumEntries) == 0x000180, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Event_NumEntries' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000184, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default_9) == 0x000188, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_GetEndTime_ReturnValue_1) == 0x00018C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_PlayAnimation_ReturnValue_2) == 0x000190, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000198, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_GetEndTime_ReturnValue_2) == 0x00019C, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_GetEndTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_GetEndTime_ReturnValue_3) == 0x0001A0, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_GetEndTime_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_PlayAnimation_ReturnValue_3) == 0x0001A8, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_PlayAnimation_ReturnValue_4) == 0x0001B0, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_GetEndTime_ReturnValue_4) == 0x0001B8, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_GetEndTime_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_BPCallableIsDesignTime_ReturnValue) == 0x0001BC, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_BPCallableIsDesignTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_PlayAnimation_ReturnValue_5) == 0x0001C0, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_BPCallableIsDesignTime_ReturnValue_1) == 0x0001C8, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_BPCallableIsDesignTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_object_Variable_13) == 0x0001D0, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default_10) == 0x0001D8, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, Temp_byte_Variable_9) == 0x0001DC, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, K2Node_Select_Default_11) == 0x0001E0, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::K2Node_Select_Default_11' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing, CallFunc_IsValid_ReturnValue) == 0x0001E8, "Member 'BP_AthenaCollectionItemToast_Fishing_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Fishing::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AthenaCollectionItemToast_Fishing.BP_AthenaCollectionItemToast_Fishing_C.BP_OnToastUpdated
// 0x0008 (0x0008 - 0x0000)
struct BP_AthenaCollectionItemToast_Fishing_C_BP_OnToastUpdated final
{
public:
	EFortCollectedState                           CollectedState_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumCollected;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionItemToast_Fishing_C_BP_OnToastUpdated) == 0x000004, "Wrong alignment on BP_AthenaCollectionItemToast_Fishing_C_BP_OnToastUpdated");
static_assert(sizeof(BP_AthenaCollectionItemToast_Fishing_C_BP_OnToastUpdated) == 0x000008, "Wrong size on BP_AthenaCollectionItemToast_Fishing_C_BP_OnToastUpdated");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_BP_OnToastUpdated, CollectedState_0) == 0x000000, "Member 'BP_AthenaCollectionItemToast_Fishing_C_BP_OnToastUpdated::CollectedState_0' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Fishing_C_BP_OnToastUpdated, NumCollected) == 0x000004, "Member 'BP_AthenaCollectionItemToast_Fishing_C_BP_OnToastUpdated::NumCollected' has a wrong offset!");

// Function BP_AthenaCollectionItemToast_Fishing.BP_AthenaCollectionItemToast_Fishing_C.BP_OnStarRatingSet
// 0x0004 (0x0004 - 0x0000)
struct BP_AthenaCollectionItemToast_Fishing_C_BP_OnStarRatingSet final
{
public:
