#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollectionItemToast_Character

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaCollectionItemToast_Character.BP_AthenaCollectionItemToast_Character_C.ExecuteUbergraph_BP_AthenaCollectionItemToast_Character
// 0x0070 (0x0070 - 0x0000)
struct BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           K2Node_Event_CollectedState;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NumCollected;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPCallableIsDesignTime_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0040(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_3;                           // 0x005C(0x0014)()
};
static_assert(alignof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character) == 0x000008, "Wrong alignment on BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character");
static_assert(sizeof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character) == 0x000070, "Wrong size on BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, EntryPoint) == 0x000000, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, Temp_bool_Variable) == 0x000004, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, Temp_byte_Variable) == 0x000005, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, Temp_byte_Variable_1) == 0x000006, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, Temp_byte_Variable_2) == 0x000007, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, Temp_byte_Variable_3) == 0x000008, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, K2Node_Event_CollectedState) == 0x000009, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::K2Node_Event_CollectedState' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, K2Node_Event_NumCollected) == 0x00000C, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::K2Node_Event_NumCollected' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000011, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000012, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000013, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_BooleanOR_ReturnValue) == 0x000014, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_BooleanOR_ReturnValue_1) == 0x000015, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, K2Node_Select_Default) == 0x000016, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, Temp_byte_Variable_4) == 0x000017, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_BPCallableIsDesignTime_ReturnValue) == 0x000018, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_BPCallableIsDesignTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_GetEndTime_ReturnValue) == 0x00001C, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_GetEndTime_ReturnValue_1) == 0x000028, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, Temp_byte_Variable_5) == 0x00003C, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, Temp_bool_Variable_1) == 0x00003D, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, K2Node_Select_Default_1) == 0x000040, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, K2Node_Select_Default_2) == 0x000058, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character, K2Node_Select_Default_3) == 0x00005C, "Member 'BP_AthenaCollectionItemToast_Character_C_ExecuteUbergraph_BP_AthenaCollectionItemToast_Character::K2Node_Select_Default_3' has a wrong offset!");

// Function BP_AthenaCollectionItemToast_Character.BP_AthenaCollectionItemToast_Character_C.BP_OnToastUpdated
// 0x0008 (0x0008 - 0x0000)
struct BP_AthenaCollectionItemToast_Character_C_BP_OnToastUpdated final
{
public:
	EFortCollectedState                           CollectedState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumCollected;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionItemToast_Character_C_BP_OnToastUpdated) == 0x000004, "Wrong alignment on BP_AthenaCollectionItemToast_Character_C_BP_OnToastUpdated");
static_assert(sizeof(BP_AthenaCollectionItemToast_Character_C_BP_OnToastUpdated) == 0x000008, "Wrong size on BP_AthenaCollectionItemToast_Character_C_BP_OnToastUpdated");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_BP_OnToastUpdated, CollectedState) == 0x000000, "Member 'BP_AthenaCollectionItemToast_Character_C_BP_OnToastUpdated::CollectedState' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionItemToast_Character_C_BP_OnToastUpdated, NumCollected) == 0x000004, "Member 'BP_AthenaCollectionItemToast_Character_C_BP_OnToastUpdated::NumCollected' has a wrong offset!");

}

