#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuildingActorCBGASpawnComponent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BuildingActorCBGASpawnComponent.BuildingActorCBGASpawnComponent_C.Damaged
// 0x0050 (0x0050 - 0x0000)
struct BuildingActorCBGASpawnComponent_C_Damaged final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BuildingActorCBGASpawnComponent_C_Damaged) == 0x000008, "Wrong alignment on BuildingActorCBGASpawnComponent_C_Damaged");
static_assert(sizeof(BuildingActorCBGASpawnComponent_C_Damaged) == 0x000050, "Wrong size on BuildingActorCBGASpawnComponent_C_Damaged");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Damaged, DamagedActor) == 0x000000, "Member 'BuildingActorCBGASpawnComponent_C_Damaged::DamagedActor' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Damaged, Damage) == 0x000008, "Member 'BuildingActorCBGASpawnComponent_C_Damaged::Damage' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Damaged, InstigatedBy) == 0x000010, "Member 'BuildingActorCBGASpawnComponent_C_Damaged::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Damaged, DamageCauser) == 0x000018, "Member 'BuildingActorCBGASpawnComponent_C_Damaged::DamageCauser' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Damaged, HitLocation) == 0x000020, "Member 'BuildingActorCBGASpawnComponent_C_Damaged::HitLocation' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Damaged, FHitComponent) == 0x000030, "Member 'BuildingActorCBGASpawnComponent_C_Damaged::FHitComponent' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Damaged, BoneName) == 0x000038, "Member 'BuildingActorCBGASpawnComponent_C_Damaged::BoneName' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Damaged, Momentum) == 0x000040, "Member 'BuildingActorCBGASpawnComponent_C_Damaged::Momentum' has a wrong offset!");

// Function BuildingActorCBGASpawnComponent.BuildingActorCBGASpawnComponent_C.Died
// 0x0050 (0x0050 - 0x0000)
struct BuildingActorCBGASpawnComponent_C_Died final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BuildingActorCBGASpawnComponent_C_Died) == 0x000008, "Wrong alignment on BuildingActorCBGASpawnComponent_C_Died");
static_assert(sizeof(BuildingActorCBGASpawnComponent_C_Died) == 0x000050, "Wrong size on BuildingActorCBGASpawnComponent_C_Died");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Died, DamagedActor) == 0x000000, "Member 'BuildingActorCBGASpawnComponent_C_Died::DamagedActor' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Died, Damage) == 0x000008, "Member 'BuildingActorCBGASpawnComponent_C_Died::Damage' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Died, InstigatedBy) == 0x000010, "Member 'BuildingActorCBGASpawnComponent_C_Died::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Died, DamageCauser) == 0x000018, "Member 'BuildingActorCBGASpawnComponent_C_Died::DamageCauser' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Died, HitLocation) == 0x000020, "Member 'BuildingActorCBGASpawnComponent_C_Died::HitLocation' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Died, FHitComponent) == 0x000030, "Member 'BuildingActorCBGASpawnComponent_C_Died::FHitComponent' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Died, BoneName) == 0x000038, "Member 'BuildingActorCBGASpawnComponent_C_Died::BoneName' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_Died, Momentum) == 0x000040, "Member 'BuildingActorCBGASpawnComponent_C_Died::Momentum' has a wrong offset!");

// Function BuildingActorCBGASpawnComponent.BuildingActorCBGASpawnComponent_C.DynamicallySpawn
// 0x0001 (0x0001 - 0x0000)
struct BuildingActorCBGASpawnComponent_C_DynamicallySpawn final
{
public:
	bool                                          UsesThresholdChecks;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BuildingActorCBGASpawnComponent_C_DynamicallySpawn) == 0x000001, "Wrong alignment on BuildingActorCBGASpawnComponent_C_DynamicallySpawn");
static_assert(sizeof(BuildingActorCBGASpawnComponent_C_DynamicallySpawn) == 0x000001, "Wrong size on BuildingActorCBGASpawnComponent_C_DynamicallySpawn");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_DynamicallySpawn, UsesThresholdChecks) == 0x000000, "Member 'BuildingActorCBGASpawnComponent_C_DynamicallySpawn::UsesThresholdChecks' has a wrong offset!");

// Function BuildingActorCBGASpawnComponent.BuildingActorCBGASpawnComponent_C.ExecuteUbergraph_BuildingActorCBGASpawnComponent
// 0x0290 (0x0290 - 0x0000)
struct BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor_1;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage_1;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy_1;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser_1;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation_1;                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent_1;                // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName_1;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum_1;                     // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_UsesThresholdChecks;            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsCBGA_Parent_Physics;     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ThreshHoldCheck_ValidDrop;                // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x017C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x01B0(0x0020)()
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x01D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x01E0(0x0020)(ConstParm)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Select_Default;                             // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACBGA_Parent_Physics_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent) == 0x000010, "Wrong alignment on BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent");
static_assert(sizeof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent) == 0x000290, "Wrong size on BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, EntryPoint) == 0x000000, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000014, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, Temp_bool_IsClosed_Variable) == 0x000015, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, Temp_int_Variable) == 0x000018, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_IsServer_ReturnValue) == 0x000020, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, Temp_bool_Has_Been_Initd_Variable_1) == 0x000021, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000024, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_FTrunc_ReturnValue) == 0x000028, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00002C, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_Conv_IntToBool_ReturnValue) == 0x000030, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_FTrunc_ReturnValue_1) == 0x000034, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x000040, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_DynamicCast_AsBuilding_Actor) == 0x000048, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_DamagedActor_1) == 0x000058, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_DamagedActor_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_Damage_1) == 0x000060, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_Damage_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_InstigatedBy_1) == 0x000068, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_DamageCauser_1) == 0x000070, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_HitLocation_1) == 0x000078, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_HitLocation_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_FHitComponent_1) == 0x000088, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_FHitComponent_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_BoneName_1) == 0x000090, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_BoneName_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_Momentum_1) == 0x000098, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_Momentum_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A4, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_UsesThresholdChecks) == 0x0000B4, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_UsesThresholdChecks' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, Temp_bool_Variable) == 0x0000B5, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000B8, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000BC, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000C8, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, Temp_class_Variable) == 0x0000D8, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x0000E0, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_ClassDynamicCast_AsCBGA_Parent_Physics) == 0x0000E8, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_ClassDynamicCast_AsCBGA_Parent_Physics' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_ClassDynamicCast_bSuccess) == 0x0000F0, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0000F1, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_ThreshHoldCheck_ValidDrop) == 0x0000F2, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_ThreshHoldCheck_ValidDrop' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F4, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000100, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_Loaded) == 0x000110, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000118, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_IsValidClass_ReturnValue) == 0x000128, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_IsValidClass_ReturnValue_1) == 0x000129, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_DamagedActor) == 0x000130, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_Damage) == 0x000138, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_InstigatedBy) == 0x000140, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_DamageCauser) == 0x000148, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_HitLocation) == 0x000150, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_FHitComponent) == 0x000160, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_BoneName) == 0x000168, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_Momentum) == 0x000170, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x00017C, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, Temp_bool_IsClosed_Variable_1) == 0x00018C, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000190, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, Temp_object_Variable) == 0x000198, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_IsValid_ReturnValue) == 0x0001A0, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, Temp_object_Variable_1) == 0x0001A8, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, Temp_struct_Variable) == 0x0001B0, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_GameState) == 0x0001D0, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_Playlist) == 0x0001D8, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_CustomEvent_PlaylistContextTags) == 0x0001E0, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000200, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_Add_VectorVector_ReturnValue) == 0x00020C, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000218, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000224, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, K2Node_Select_Default) == 0x000230, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x00023C, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_MakeTransform_ReturnValue) == 0x000240, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_FTrunc_ReturnValue_2) == 0x000270, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000278, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000280, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000284, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent, CallFunc_FinishSpawningActor_ReturnValue) == 0x000288, "Member 'BuildingActorCBGASpawnComponent_C_ExecuteUbergraph_BuildingActorCBGASpawnComponent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BuildingActorCBGASpawnComponent.BuildingActorCBGASpawnComponent_C.OnLoaded_A81F30C841A9FB0CB871A296A47EB549
// 0x0008 (0x0008 - 0x0000)
struct BuildingActorCBGASpawnComponent_C_OnLoaded_A81F30C841A9FB0CB871A296A47EB549 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BuildingActorCBGASpawnComponent_C_OnLoaded_A81F30C841A9FB0CB871A296A47EB549) == 0x000008, "Wrong alignment on BuildingActorCBGASpawnComponent_C_OnLoaded_A81F30C841A9FB0CB871A296A47EB549");
static_assert(sizeof(BuildingActorCBGASpawnComponent_C_OnLoaded_A81F30C841A9FB0CB871A296A47EB549) == 0x000008, "Wrong size on BuildingActorCBGASpawnComponent_C_OnLoaded_A81F30C841A9FB0CB871A296A47EB549");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_OnLoaded_A81F30C841A9FB0CB871A296A47EB549, Loaded) == 0x000000, "Member 'BuildingActorCBGASpawnComponent_C_OnLoaded_A81F30C841A9FB0CB871A296A47EB549::Loaded' has a wrong offset!");

// Function BuildingActorCBGASpawnComponent.BuildingActorCBGASpawnComponent_C.OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF
// 0x0030 (0x0030 - 0x0000)
struct BuildingActorCBGASpawnComponent_C_OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BuildingActorCBGASpawnComponent_C_OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF) == 0x000008, "Wrong alignment on BuildingActorCBGASpawnComponent_C_OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF");
static_assert(sizeof(BuildingActorCBGASpawnComponent_C_OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF) == 0x000030, "Wrong size on BuildingActorCBGASpawnComponent_C_OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF, GameState) == 0x000000, "Member 'BuildingActorCBGASpawnComponent_C_OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF::GameState' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF, Playlist) == 0x000008, "Member 'BuildingActorCBGASpawnComponent_C_OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF::Playlist' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF, PlaylistContextTags) == 0x000010, "Member 'BuildingActorCBGASpawnComponent_C_OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF::PlaylistContextTags' has a wrong offset!");

// Function BuildingActorCBGASpawnComponent.BuildingActorCBGASpawnComponent_C.ThreshHoldCheck
// 0x0014 (0x0014 - 0x0000)
struct BuildingActorCBGASpawnComponent_C_ThreshHoldCheck final
{
public:
	bool                                          ValidDrop;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundDrop;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBuildingHealthPercentage_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MaxOfFloatArray_IndexOfMaxValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MaxOfFloatArray_MaxValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BuildingActorCBGASpawnComponent_C_ThreshHoldCheck) == 0x000004, "Wrong alignment on BuildingActorCBGASpawnComponent_C_ThreshHoldCheck");
static_assert(sizeof(BuildingActorCBGASpawnComponent_C_ThreshHoldCheck) == 0x000014, "Wrong size on BuildingActorCBGASpawnComponent_C_ThreshHoldCheck");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ThreshHoldCheck, ValidDrop) == 0x000000, "Member 'BuildingActorCBGASpawnComponent_C_ThreshHoldCheck::ValidDrop' has a wrong offset!");
static_assert(offsetof(BuildingActorCBGASpawnComponent_C_ThreshHoldCheck, FoundDrop) == 0x000001, "Member 'BuildingActorCBGASpawnComponent_C_ThreshHoldCheck::FoundDrop' has a wrong offset!");
