#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CampsiteFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_Campsite_Improvements_structs.hpp"


namespace SDK::Params
{

// Function CampsiteFunctionLibrary.CampsiteFunctionLibrary_C.Best Squadmate And Campsite To Add New Tent
// 0x01C0 (0x01C0 - 0x0000)
struct CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent final
{
public:
	TArray<class ABGA_Campsite_C*>                Campsites_to_Search;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AFortPlayerStateAthena*                 Reference_Player_State;                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Reference_Location;                                // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Campsite_C*                        Campsite;                                          // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           Player;                                            // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DeployTentsForSquadmates_;                         // 0x0040(0x0028)(Edit, BlueprintVisible)
	class AFortPlayerStateAthena*                 RequestingPlayer;                                  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           BestPlayer;                                        // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABGA_Campsite_C*>                ValidCampsites;                                    // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class APlayerState*>                   PlayersWithoutTents;                               // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Campsite_C*                        CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Campsite_C*                        CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Campsite_C*                        CallFunc_GetNearestCampsite_nearest_camp;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCampsite_Improvement_Component_C*      CallFunc_Array_Get_Item_2;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_107[0x1];                                      // 0x0107(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceBetweenActors_Distance;        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_Array_Get_Item_3;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCampsite_Improvement_Component_C*      CallFunc_Array_Get_Item_4;                         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerStateAthena*>         CallFunc_GetSquadMemberPlayerStates_ReturnValue;   // 0x0188(0x0010)(ReferenceParm)
	class APlayerState*                           CallFunc_Array_Get_Item_5;                         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerStateAthena*>         CallFunc_FilterPlayerStatesForActivePlayers_FilteredPlayerStates; // 0x01A0(0x0010)(ReferenceParm)
	float                                         CallFunc_GetDistanceBetweenActors_Distance_1;      // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B6[0x2];                                      // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent) == 0x000008, "Wrong alignment on CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent");
static_assert(sizeof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent) == 0x0001C0, "Wrong size on CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Campsites_to_Search) == 0x000000, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Campsites_to_Search' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Reference_Player_State) == 0x000010, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Reference_Player_State' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Reference_Location) == 0x000018, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Reference_Location' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, __WorldContext) == 0x000028, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::__WorldContext' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Campsite) == 0x000030, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Campsite' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Player) == 0x000038, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Player' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, DeployTentsForSquadmates_) == 0x000040, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::DeployTentsForSquadmates_' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, RequestingPlayer) == 0x000068, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::RequestingPlayer' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Debug) == 0x000070, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Debug' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, BestPlayer) == 0x000078, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::BestPlayer' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, ValidCampsites) == 0x000080, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::ValidCampsites' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, PlayersWithoutTents) == 0x000090, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::PlayersWithoutTents' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Length_ReturnValue_1) == 0x0000A4, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Temp_int_Array_Index_Variable) == 0x0000A8, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Temp_int_Loop_Counter_Variable) == 0x0000AC, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Temp_int_Loop_Counter_Variable_1) == 0x0000B4, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B8, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Temp_int_Array_Index_Variable_1) == 0x0000BC, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Temp_int_Loop_Counter_Variable_2) == 0x0000C0, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Length_ReturnValue_2) == 0x0000D4, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D8, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000DC, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Temp_int_Array_Index_Variable_2) == 0x0000E0, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_GetNearestCampsite_nearest_camp) == 0x0000F0, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_GetNearestCampsite_nearest_camp' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Get_Item_2) == 0x0000F8, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Length_ReturnValue_3) == 0x000100, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Less_IntInt_ReturnValue_2) == 0x000104, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000105, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_GetValueAsBool_ReturnValue) == 0x000106, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_GetDisplayName_ReturnValue) == 0x000108, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Concat_StrStr_ReturnValue) == 0x000118, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_GetDistanceBetweenActors_Distance) == 0x000128, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_GetDistanceBetweenActors_Distance' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Temp_bool_True_if_break_was_hit_Variable) == 0x00012C, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Get_Item_3) == 0x000130, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Not_PreBool_ReturnValue) == 0x000138, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_BooleanAND_ReturnValue) == 0x000139, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Length_ReturnValue_4) == 0x00013C, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Subtract_IntInt_ReturnValue) == 0x000140, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Length_ReturnValue_5) == 0x000144, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Temp_int_Array_Index_Variable_3) == 0x000148, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Greater_IntInt_ReturnValue) == 0x00014C, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Get_Item_4) == 0x000150, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000158, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_RemoveItem_ReturnValue) == 0x000159, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00015A, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_BooleanAND_ReturnValue_1) == 0x00015B, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x00015C, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Contains_ReturnValue) == 0x00015D, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Length_ReturnValue_6) == 0x000160, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000164, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Temp_int_Loop_Counter_Variable_3) == 0x000168, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Less_IntInt_ReturnValue_3) == 0x00016C, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Add_IntInt_ReturnValue_3) == 0x000170, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_GetGameStateAthena_ReturnValue) == 0x000178, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, Temp_int_Variable) == 0x000180, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_GetSquadMemberPlayerStates_ReturnValue) == 0x000188, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_GetSquadMemberPlayerStates_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Array_Get_Item_5) == 0x000198, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_FilterPlayerStatesForActivePlayers_FilteredPlayerStates) == 0x0001A0, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_FilterPlayerStatesForActivePlayers_FilteredPlayerStates' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_GetDistanceBetweenActors_Distance_1) == 0x0001B0, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_GetDistanceBetweenActors_Distance_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001B4, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001B5, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001B8, "Member 'CampsiteFunctionLibrary_C_Best_Squadmate_And_Campsite_To_Add_New_Tent::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");

// Function CampsiteFunctionLibrary.CampsiteFunctionLibrary_C.BestCampsiteForNewImprovement
// 0x00E0 (0x00E0 - 0x0000)
struct CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement final
{
public:
	Enum_Campsite_Improvements                    ImprovementType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABGA_Campsite_C*>                NearbyCampsites;                                   // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                QueryLocation;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Campsite_C*                        BestCampsite;                                      // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Campsite_C*                        closestCampsite;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABGA_Campsite_C*>                ValidCampsites;                                    // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Campsite_C*                        CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Campsite_C*                        CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCampsite_Improvement_Component_C*      CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_DistanceSquared_ReturnValue;       // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_DistanceSquared_ReturnValue_1;     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement) == 0x000008, "Wrong alignment on CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement");
static_assert(sizeof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement) == 0x0000E0, "Wrong size on CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, ImprovementType) == 0x000000, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::ImprovementType' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, NearbyCampsites) == 0x000008, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::NearbyCampsites' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, QueryLocation) == 0x000018, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::QueryLocation' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, __WorldContext) == 0x000028, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::__WorldContext' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, BestCampsite) == 0x000030, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::BestCampsite' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, closestCampsite) == 0x000038, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::closestCampsite' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, ValidCampsites) == 0x000040, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::ValidCampsites' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, Temp_int_Array_Index_Variable) == 0x000050, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, Temp_int_Array_Index_Variable_1) == 0x000058, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, Temp_int_Array_Index_Variable_2) == 0x000068, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Array_Get_Item) == 0x000070, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00008C, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000098, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Vector_DistanceSquared_ReturnValue) == 0x00009C, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Vector_DistanceSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Array_Length_ReturnValue_2) == 0x0000A0, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, Temp_bool_True_if_break_was_hit_Variable) == 0x0000A4, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A8, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Not_PreBool_ReturnValue) == 0x0000B4, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Vector_DistanceSquared_ReturnValue_1) == 0x0000B8, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Vector_DistanceSquared_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000BC, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_IsValid_ReturnValue) == 0x0000BD, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, Temp_int_Loop_Counter_Variable_1) == 0x0000C0, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000C4, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C5, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C8, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_BooleanAND_ReturnValue) == 0x0000CC, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, Temp_int_Loop_Counter_Variable_2) == 0x0000D0, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000D4, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D8, "Member 'CampsiteFunctionLibrary_C_BestCampsiteForNewImprovement::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function CampsiteFunctionLibrary.CampsiteFunctionLibrary_C.FilterPlayerStatesForActivePlayers
// 0x0068 (0x0068 - 0x0000)
struct CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers final
{
public:
	TArray<class AFortPlayerStateAthena*>         InPlayerStates;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerStateAthena*>         FilteredPlayerStates;                              // 0x0018(0x0010)(Parm, OutParm)
	TArray<class AFortPlayerStateAthena*>         OutPlayerStates;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResurrectingNow_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResurrectionChipAvailable_ReturnValue;  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeResurrected_ReturnValue;             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerDead_ReturnValue;                 // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers) == 0x000008, "Wrong alignment on CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers");
static_assert(sizeof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers) == 0x000068, "Wrong size on CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, InPlayerStates) == 0x000000, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::InPlayerStates' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, __WorldContext) == 0x000010, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::__WorldContext' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, FilteredPlayerStates) == 0x000018, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::FilteredPlayerStates' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, OutPlayerStates) == 0x000028, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::OutPlayerStates' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, CallFunc_Array_Get_Item) == 0x000048, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, CallFunc_IsResurrectingNow_ReturnValue) == 0x000050, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::CallFunc_IsResurrectingNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, CallFunc_IsResurrectionChipAvailable_ReturnValue) == 0x000051, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::CallFunc_IsResurrectionChipAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, CallFunc_CanBeResurrected_ReturnValue) == 0x000052, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::CallFunc_CanBeResurrected_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers, CallFunc_IsPlayerDead_ReturnValue) == 0x000053, "Member 'CampsiteFunctionLibrary_C_FilterPlayerStatesForActivePlayers::CallFunc_IsPlayerDead_ReturnValue' has a wrong offset!");
