#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBGA_Parent_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CBGA_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CBGA_Parent_Physics.CBGA_Parent_Physics_C
// 0x0100 (0x0B90 - 0x0A90)
class ACBGA_Parent_Physics_C final : public ACBGA_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CBGA_Parent_Physics_C;              // 0x0A88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortPhysicsObjectComponent*            FortPhysicsObject;                                 // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortLinkToActorComponent*              FortLinkToActor;                                   // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GravImpact_Loc;                                    // 0x0AA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                GravHitNormal;                                     // 0x0AAC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          bResumeSimulation;                                 // 0x0AB8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          ResumeGravSimOnBegin;                              // 0x0AB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_ABA[0x2];                                      // 0x0ABA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             NullHit;                                           // 0x0ABC(0x009C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference, AdvancedDisplay)
	bool                                          RepCollision;                                      // 0x0B58(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B59[0x7];                                      // 0x0B59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        HitgroundFX;                                       // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HitgroundSound;                                    // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        SpawnFX;                                           // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpawnSound;                                        // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnCollision;                                    // 0x0B80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_B81[0x7];                                      // 0x0B81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LinkedActor;                                       // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature(class AActor* DamageCauser);
	void ExecuteUbergraph_CBGA_Parent_Physics(int32 EntryPoint);
	void HandleBinding();
	void Impulse(float DelayBeforeImpulse, float DelayBeforeCollision, const struct FVector& ImpulseOrigin, const struct FVector& ImpulseAmount, bool SetCollisionAfterImpulse);
	void OnAwakeChanged(class UPrimitiveComponent* SimulatingComponent, bool bIsAwake);
	void OnRep_bResumeSimulation();
	void OnRep_RepCollision();
	void PlayHitFX(const struct FVector& Location, const struct FRotator& Rotation);
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void SpawnFXSounds();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CBGA_Parent_Physics_C">();
	}
	static class ACBGA_Parent_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACBGA_Parent_Physics_C>();
	}
};
static_assert(alignof(ACBGA_Parent_Physics_C) == 0x000010, "Wrong alignment on ACBGA_Parent_Physics_C");
static_assert(sizeof(ACBGA_Parent_Physics_C) == 0x000B90, "Wrong size on ACBGA_Parent_Physics_C");
static_assert(offsetof(ACBGA_Parent_Physics_C, UberGraphFrame_CBGA_Parent_Physics_C) == 0x000A88, "Member 'ACBGA_Parent_Physics_C::UberGraphFrame_CBGA_Parent_Physics_C' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, FortPhysicsObject) == 0x000A90, "Member 'ACBGA_Parent_Physics_C::FortPhysicsObject' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, FortLinkToActor) == 0x000A98, "Member 'ACBGA_Parent_Physics_C::FortLinkToActor' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, GravImpact_Loc) == 0x000AA0, "Member 'ACBGA_Parent_Physics_C::GravImpact_Loc' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, GravHitNormal) == 0x000AAC, "Member 'ACBGA_Parent_Physics_C::GravHitNormal' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, bResumeSimulation) == 0x000AB8, "Member 'ACBGA_Parent_Physics_C::bResumeSimulation' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, ResumeGravSimOnBegin) == 0x000AB9, "Member 'ACBGA_Parent_Physics_C::ResumeGravSimOnBegin' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, NullHit) == 0x000ABC, "Member 'ACBGA_Parent_Physics_C::NullHit' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, RepCollision) == 0x000B58, "Member 'ACBGA_Parent_Physics_C::RepCollision' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, HitgroundFX) == 0x000B60, "Member 'ACBGA_Parent_Physics_C::HitgroundFX' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, HitgroundSound) == 0x000B68, "Member 'ACBGA_Parent_Physics_C::HitgroundSound' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, SpawnFX) == 0x000B70, "Member 'ACBGA_Parent_Physics_C::SpawnFX' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, SpawnSound) == 0x000B78, "Member 'ACBGA_Parent_Physics_C::SpawnSound' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, SpawnCollision) == 0x000B80, "Member 'ACBGA_Parent_Physics_C::SpawnCollision' has a wrong offset!");
static_assert(offsetof(ACBGA_Parent_Physics_C, LinkedActor) == 0x000B88, "Member 'ACBGA_Parent_Physics_C::LinkedActor' has a wrong offset!");

}

