#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticNotification

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CosmeticNotification.CosmeticNotification_C.UpdateQuestRewardVisuals
// 0x0010 (0x0010 - 0x0000)
struct CosmeticNotification_C_UpdateQuestRewardVisuals final
{
public:
	const class UFortItemDefinition*              RewardItem;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   QuestRarity;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticNotification_C_UpdateQuestRewardVisuals) == 0x000008, "Wrong alignment on CosmeticNotification_C_UpdateQuestRewardVisuals");
static_assert(sizeof(CosmeticNotification_C_UpdateQuestRewardVisuals) == 0x000010, "Wrong size on CosmeticNotification_C_UpdateQuestRewardVisuals");
static_assert(offsetof(CosmeticNotification_C_UpdateQuestRewardVisuals, RewardItem) == 0x000000, "Member 'CosmeticNotification_C_UpdateQuestRewardVisuals::RewardItem' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_UpdateQuestRewardVisuals, QuestRarity) == 0x000008, "Member 'CosmeticNotification_C_UpdateQuestRewardVisuals::QuestRarity' has a wrong offset!");

// Function CosmeticNotification.CosmeticNotification_C.UpdateLevelUpVisuals
// 0x0008 (0x0008 - 0x0000)
struct CosmeticNotification_C_UpdateLevelUpVisuals final
{
public:
	const class UFortItemDefinition*              RewardItem;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticNotification_C_UpdateLevelUpVisuals) == 0x000008, "Wrong alignment on CosmeticNotification_C_UpdateLevelUpVisuals");
static_assert(sizeof(CosmeticNotification_C_UpdateLevelUpVisuals) == 0x000008, "Wrong size on CosmeticNotification_C_UpdateLevelUpVisuals");
static_assert(offsetof(CosmeticNotification_C_UpdateLevelUpVisuals, RewardItem) == 0x000000, "Member 'CosmeticNotification_C_UpdateLevelUpVisuals::RewardItem' has a wrong offset!");

// Function CosmeticNotification.CosmeticNotification_C.SetStyle_QuestCosmetic
// 0x0090 (0x0090 - 0x0000)
struct CosmeticNotification_C_SetStyle_QuestCosmetic final
{
public:
	EFortRarity                                   Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0008(0x0080)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticNotification_C_SetStyle_QuestCosmetic) == 0x000008, "Wrong alignment on CosmeticNotification_C_SetStyle_QuestCosmetic");
static_assert(sizeof(CosmeticNotification_C_SetStyle_QuestCosmetic) == 0x000090, "Wrong size on CosmeticNotification_C_SetStyle_QuestCosmetic");
static_assert(offsetof(CosmeticNotification_C_SetStyle_QuestCosmetic, Rarity) == 0x000000, "Member 'CosmeticNotification_C_SetStyle_QuestCosmetic::Rarity' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_SetStyle_QuestCosmetic, CallFunc_BPGetRarityData_ReturnValue) == 0x000008, "Member 'CosmeticNotification_C_SetStyle_QuestCosmetic::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_SetStyle_QuestCosmetic, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000088, "Member 'CosmeticNotification_C_SetStyle_QuestCosmetic::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function CosmeticNotification.CosmeticNotification_C.SetStyle_LevelUp
// 0x0008 (0x0008 - 0x0000)
struct CosmeticNotification_C_SetStyle_LevelUp final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticNotification_C_SetStyle_LevelUp) == 0x000008, "Wrong alignment on CosmeticNotification_C_SetStyle_LevelUp");
static_assert(sizeof(CosmeticNotification_C_SetStyle_LevelUp) == 0x000008, "Wrong size on CosmeticNotification_C_SetStyle_LevelUp");
static_assert(offsetof(CosmeticNotification_C_SetStyle_LevelUp, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'CosmeticNotification_C_SetStyle_LevelUp::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function CosmeticNotification.CosmeticNotification_C.ExecuteUbergraph_CosmeticNotification
// 0x0050 (0x0050 - 0x0000)
struct CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortItemDefinition*              K2Node_Event_RewardItem_1;                         // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   K2Node_Event_QuestRarity;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortItemDefinition*              K2Node_Event_RewardItem;                           // 0x0038(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification) == 0x000008, "Wrong alignment on CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification");
static_assert(sizeof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification) == 0x000050, "Wrong size on CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, EntryPoint) == 0x000000, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_Event_RewardItem_1) == 0x000028, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_Event_RewardItem_1' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_Event_QuestRarity) == 0x000030, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_Event_QuestRarity' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_Event_RewardItem) == 0x000038, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_Event_RewardItem' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000048, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

}

