#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CowboyPistol_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct CowboyPistol_AnimBP.CowboyPistol_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x017F (0x0180 - 0x0001)
struct CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_146;                                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_147;                                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_148;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_149;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_150;                                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_151;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_152;                                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_153;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_154;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_155;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_156;                                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_157;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_158;                                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_159;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          StructProperty_160;                                // 0x006C(0x002C)(NoDestructor)
	float                                         FloatProperty_161;                                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_162;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_163;                                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_164;                                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_165;                                  // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_166;                                  // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  ByteProperty_167;                                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_168;                                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_169;                                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   StructProperty_170;                                // 0x00C8(0x0020)(NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00E8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0168(0x0018)()
};
static_assert(alignof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000180, "Wrong size on CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_146) == 0x000004, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_146' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_147) == 0x00000C, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_147' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_148) == 0x000010, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_148' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_149) == 0x000018, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_149' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_150) == 0x000020, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_150' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_151) == 0x000028, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_151' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_152) == 0x000030, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_152' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_153) == 0x000038, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_153' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_154) == 0x000040, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_154' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_155) == 0x000048, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_155' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_156) == 0x000050, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_156' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_157) == 0x000058, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_157' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_158) == 0x000060, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_158' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_159) == 0x000068, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_159' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_160) == 0x00006C, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_160' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_161) == 0x000098, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_161' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_162) == 0x0000A0, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_162' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_163) == 0x0000A8, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_163' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_164) == 0x0000A9, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_164' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_165) == 0x0000AA, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_165' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_166) == 0x0000AC, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_166' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_167) == 0x0000B4, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_167' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_168) == 0x0000B8, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_168' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_169) == 0x0000C0, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_169' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_170) == 0x0000C8, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_170' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000E8, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000168, "Member 'CowboyPistol_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

