#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cr_ChannelBrowser

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ChannelBrowserDetails_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ChannelBrowserChannelStruct_structs.hpp"
#include "ChannelBrowserItemStruct_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.UpdateChannelArray
// 0x0024 (0x0024 - 0x0000)
struct Cr_ChannelBrowser_C_UpdateChannelArray final
{
public:
	int32                                         Channel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TxDelta;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RxDelta;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_UpdateChannelArray) == 0x000004, "Wrong alignment on Cr_ChannelBrowser_C_UpdateChannelArray");
static_assert(sizeof(Cr_ChannelBrowser_C_UpdateChannelArray) == 0x000024, "Wrong size on Cr_ChannelBrowser_C_UpdateChannelArray");
static_assert(offsetof(Cr_ChannelBrowser_C_UpdateChannelArray, Channel) == 0x000000, "Member 'Cr_ChannelBrowser_C_UpdateChannelArray::Channel' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_UpdateChannelArray, TxDelta) == 0x000004, "Member 'Cr_ChannelBrowser_C_UpdateChannelArray::TxDelta' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_UpdateChannelArray, RxDelta) == 0x000008, "Member 'Cr_ChannelBrowser_C_UpdateChannelArray::RxDelta' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_UpdateChannelArray, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'Cr_ChannelBrowser_C_UpdateChannelArray::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_UpdateChannelArray, CallFunc_Array_Get_Item) == 0x000010, "Member 'Cr_ChannelBrowser_C_UpdateChannelArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_UpdateChannelArray, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Cr_ChannelBrowser_C_UpdateChannelArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_UpdateChannelArray, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000018, "Member 'Cr_ChannelBrowser_C_UpdateChannelArray::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_UpdateChannelArray, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000019, "Member 'Cr_ChannelBrowser_C_UpdateChannelArray::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_UpdateChannelArray, CallFunc_Array_Get_Item_1) == 0x00001C, "Member 'Cr_ChannelBrowser_C_UpdateChannelArray::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_UpdateChannelArray, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'Cr_ChannelBrowser_C_UpdateChannelArray::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.TeleportToActor
// 0x0008 (0x0008 - 0x0000)
struct Cr_ChannelBrowser_C_TeleportToActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_TeleportToActor) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_TeleportToActor");
static_assert(sizeof(Cr_ChannelBrowser_C_TeleportToActor) == 0x000008, "Wrong size on Cr_ChannelBrowser_C_TeleportToActor");
static_assert(offsetof(Cr_ChannelBrowser_C_TeleportToActor, InActor) == 0x000000, "Member 'Cr_ChannelBrowser_C_TeleportToActor::InActor' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.Set Target Channel Count
// 0x0028 (0x0028 - 0x0000)
struct Cr_ChannelBrowser_C_Set_Target_Channel_Count final
{
public:
	TArray<int32>                                 Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Target;                                            // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_Set_Target_Channel_Count) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_Set_Target_Channel_Count");
static_assert(sizeof(Cr_ChannelBrowser_C_Set_Target_Channel_Count) == 0x000028, "Wrong size on Cr_ChannelBrowser_C_Set_Target_Channel_Count");
static_assert(offsetof(Cr_ChannelBrowser_C_Set_Target_Channel_Count, Array) == 0x000000, "Member 'Cr_ChannelBrowser_C_Set_Target_Channel_Count::Array' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_Set_Target_Channel_Count, Index_0) == 0x000010, "Member 'Cr_ChannelBrowser_C_Set_Target_Channel_Count::Index_0' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_Set_Target_Channel_Count, Target) == 0x000014, "Member 'Cr_ChannelBrowser_C_Set_Target_Channel_Count::Target' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_Set_Target_Channel_Count, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'Cr_ChannelBrowser_C_Set_Target_Channel_Count::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_Set_Target_Channel_Count, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'Cr_ChannelBrowser_C_Set_Target_Channel_Count::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_Set_Target_Channel_Count, CallFunc_Array_Get_Item) == 0x000020, "Member 'Cr_ChannelBrowser_C_Set_Target_Channel_Count::CallFunc_Array_Get_Item' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.PrintDebugData
// 0x01A0 (0x01A0 - 0x0000)
struct Cr_ChannelBrowser_C_PrintDebugData final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChannelBrowserItemStruct              CallFunc_Array_Get_Item;                           // 0x0020(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChannelBrowserChannelStruct           CallFunc_Array_Get_Item_1;                         // 0x0068(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FChannelBrowserChannelStruct           CallFunc_Array_Get_Item_2;                         // 0x00B0(0x0020)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_PrintDebugData) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_PrintDebugData");
static_assert(sizeof(Cr_ChannelBrowser_C_PrintDebugData) == 0x0001A0, "Wrong size on Cr_ChannelBrowser_C_PrintDebugData");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'Cr_ChannelBrowser_C_PrintDebugData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Cr_ChannelBrowser_C_PrintDebugData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'Cr_ChannelBrowser_C_PrintDebugData::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'Cr_ChannelBrowser_C_PrintDebugData::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, Temp_int_Array_Index_Variable_2) == 0x000018, "Member 'Cr_ChannelBrowser_C_PrintDebugData::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Array_Get_Item) == 0x000020, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Conv_TextToString_ReturnValue) == 0x000090, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Conv_IntToString_ReturnValue) == 0x0000A0, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Array_Get_Item_2) == 0x0000B0, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Concat_StrStr_ReturnValue) == 0x0000D0, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000E0, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000F0, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000100, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000110, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000120, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Array_Length_ReturnValue_2) == 0x000130, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000138, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Less_IntInt_ReturnValue_1) == 0x000148, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000150, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000160, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000170, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, Temp_int_Loop_Counter_Variable_2) == 0x000180, "Member 'Cr_ChannelBrowser_C_PrintDebugData::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000188, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Less_IntInt_ReturnValue_2) == 0x000198, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PrintDebugData, CallFunc_Add_IntInt_ReturnValue_2) == 0x00019C, "Member 'Cr_ChannelBrowser_C_PrintDebugData::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.PopulateDevicesByChannel
// 0x01C8 (0x01C8 - 0x0000)
struct Cr_ChannelBrowser_C_PopulateDevicesByChannel final
{
public:
	int32                                         TargetChannel;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGoodToAdd;                                        // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCr_ChBrowserDeviceTile_C*              DvTileWidget;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChannelBrowserItemStruct              CallFunc_Array_Get_Item;                           // 0x00B0(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChannelBrowserChannelStruct           CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0120(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChannelBrowserChannelStruct           CallFunc_Array_Get_Item_2;                         // 0x0140(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_167[0x1];                                      // 0x0167(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0168(0x0018)()
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCr_ChBrowserDeviceTile_C*              CallFunc_Create_ReturnValue;                       // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_PopulateDevicesByChannel) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_PopulateDevicesByChannel");
static_assert(sizeof(Cr_ChannelBrowser_C_PopulateDevicesByChannel) == 0x0001C8, "Wrong size on Cr_ChannelBrowser_C_PopulateDevicesByChannel");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, TargetChannel) == 0x000000, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::TargetChannel' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, bGoodToAdd) == 0x000004, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::bGoodToAdd' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, DvTileWidget) == 0x000008, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::DvTileWidget' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_MakeArray_Array) == 0x000058, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Array_Index_Variable_1) == 0x000068, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Format_ReturnValue) == 0x000070, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Array_Index_Variable_2) == 0x000090, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Loop_Counter_Variable_1) == 0x0000A4, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A8, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000AC, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Length_ReturnValue_1) == 0x000118, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00011C, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Conv_IntToText_ReturnValue) == 0x000120, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_BooleanOR_ReturnValue) == 0x000138, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Get_Item_2) == 0x000140, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Length_ReturnValue_2) == 0x000160, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000164, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Less_IntInt_ReturnValue_1) == 0x000165, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_BooleanOR_ReturnValue_1) == 0x000166, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000168, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_MakeStruct_Margin) == 0x000180, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_GetOwningPlayer_ReturnValue) == 0x000190, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Loop_Counter_Variable_2) == 0x000198, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Create_ReturnValue) == 0x0001A0, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001A8, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001AC, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_AddChild_ReturnValue) == 0x0001B0, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x0001B8, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.PopulateChannelsInUse
// 0x00B8 (0x00B8 - 0x0000)
struct Cr_ChannelBrowser_C_PopulateChannelsInUse final
{
public:
	int32                                         NumReceiving;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumTransmitting;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Style;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChannelToTest;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGoodToAdd;                                        // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCr_ChBrowserDeviceTile_C*              DvTileWidget;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumGameplayMessageChannels_ReturnValue; // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0048(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCr_ChBrowserChTile_C*                  K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0088(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCr_ChBrowserChTile_C*                  CallFunc_Create_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_PopulateChannelsInUse) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_PopulateChannelsInUse");
static_assert(sizeof(Cr_ChannelBrowser_C_PopulateChannelsInUse) == 0x0000B8, "Wrong size on Cr_ChannelBrowser_C_PopulateChannelsInUse");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, NumReceiving) == 0x000000, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::NumReceiving' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, NumTransmitting) == 0x000004, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::NumTransmitting' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, Style) == 0x000008, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::Style' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, ChannelToTest) == 0x000010, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::ChannelToTest' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, bGoodToAdd) == 0x000014, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::bGoodToAdd' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, DvTileWidget) == 0x000018, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::DvTileWidget' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000020, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_GetNumGameplayMessageChannels_ReturnValue) == 0x000028, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_GetNumGameplayMessageChannels_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000048, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Conv_IntToBool_ReturnValue) == 0x000064, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_GetChildAt_ReturnValue) == 0x000068, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile) == 0x000070, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_HasAnyChildren_ReturnValue) == 0x00007A, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, Temp_int_Variable) == 0x00007C, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000080, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000088, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A0, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Create_ReturnValue) == 0x0000A8, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_AddChild_ReturnValue) == 0x0000B0, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.OnInputMethodChanged_Event_0
// 0x0001 (0x0001 - 0x0000)
struct Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0 final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0) == 0x000001, "Wrong alignment on Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0");
static_assert(sizeof(Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0) == 0x000001, "Wrong size on Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0");
static_assert(offsetof(Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0, bNewInputType) == 0x000000, "Member 'Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0::bNewInputType' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.HandleChannelSelect
// 0x0020 (0x0020 - 0x0000)
struct Cr_ChannelBrowser_C_HandleChannelSelect final
{
public:
	class UCommonButtonLegacy*                    AssociatedButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCr_ChBrowserChTile_C*                  K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_HandleChannelSelect) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_HandleChannelSelect");
static_assert(sizeof(Cr_ChannelBrowser_C_HandleChannelSelect) == 0x000020, "Wrong size on Cr_ChannelBrowser_C_HandleChannelSelect");
static_assert(offsetof(Cr_ChannelBrowser_C_HandleChannelSelect, AssociatedButton) == 0x000000, "Member 'Cr_ChannelBrowser_C_HandleChannelSelect::AssociatedButton' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_HandleChannelSelect, ButtonIndex) == 0x000008, "Member 'Cr_ChannelBrowser_C_HandleChannelSelect::ButtonIndex' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_HandleChannelSelect, K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile) == 0x000010, "Member 'Cr_ChannelBrowser_C_HandleChannelSelect::K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_HandleChannelSelect, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Cr_ChannelBrowser_C_HandleChannelSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.GetAllDevices
// 0x0130 (0x0130 - 0x0000)
struct Cr_ChannelBrowser_C_GetAllDevices final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0008(0x0018)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AActor*, class FText>              CallFunc_GetSortedDeviceMap_ReturnValue;           // 0x0028(0x0050)()
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Map_Keys_Keys;                            // 0x0080(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x00A8(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue_1;             // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCr_ChBrowserDeviceTile_C*              K2Node_DynamicCast_AsCr_Ch_Browser_Device_Tile;    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCr_ChBrowserDeviceTile_C*              CallFunc_Create_ReturnValue;                       // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
