#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Creative_UseRestriction_Component

#include "Basic.hpp"

#include "ECreativeClassSpecialCases_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Creative_UseRestriction_Component.Creative_UseRestriction_Component_C.UnbindEventPawnPossesed
// 0x0028 (0x0028 - 0x0000)
struct Creative_UseRestriction_Component_C_UnbindEventPawnPossesed final
{
public:
	class AActor*                                 PlayerPawnToUnbind;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* Pawn)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_UseRestriction_Component_C_UnbindEventPawnPossesed) == 0x000008, "Wrong alignment on Creative_UseRestriction_Component_C_UnbindEventPawnPossesed");
static_assert(sizeof(Creative_UseRestriction_Component_C_UnbindEventPawnPossesed) == 0x000028, "Wrong size on Creative_UseRestriction_Component_C_UnbindEventPawnPossesed");
static_assert(offsetof(Creative_UseRestriction_Component_C_UnbindEventPawnPossesed, PlayerPawnToUnbind) == 0x000000, "Member 'Creative_UseRestriction_Component_C_UnbindEventPawnPossesed::PlayerPawnToUnbind' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_UnbindEventPawnPossesed, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Creative_UseRestriction_Component_C_UnbindEventPawnPossesed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_UnbindEventPawnPossesed, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000018, "Member 'Creative_UseRestriction_Component_C_UnbindEventPawnPossesed::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_UnbindEventPawnPossesed, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Creative_UseRestriction_Component_C_UnbindEventPawnPossesed::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Creative_UseRestriction_Component.Creative_UseRestriction_Component_C.State Checks
// 0x0038 (0x0038 - 0x0000)
struct Creative_UseRestriction_Component_C_State_Checks final
{
public:
	const class AActor*                           Actor_to_Check;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AND;                                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidTeam_Valid;                        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_True;                        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHoldingItem_True;                       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_IsHoldingItem_Item_Name;                  // 0x0010(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidPlayState_True;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_True;                           // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_UseRestriction_Component_C_State_Checks) == 0x000008, "Wrong alignment on Creative_UseRestriction_Component_C_State_Checks");
static_assert(sizeof(Creative_UseRestriction_Component_C_State_Checks) == 0x000038, "Wrong size on Creative_UseRestriction_Component_C_State_Checks");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, Actor_to_Check) == 0x000000, "Member 'Creative_UseRestriction_Component_C_State_Checks::Actor_to_Check' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, AND) == 0x000008, "Member 'Creative_UseRestriction_Component_C_State_Checks::AND' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, ReturnValue) == 0x000009, "Member 'Creative_UseRestriction_Component_C_State_Checks::ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_IsValidTeam_Valid) == 0x00000A, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_IsValidTeam_Valid' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_IsValidClass_True) == 0x00000B, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_IsValidClass_True' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_IsHoldingItem_True) == 0x00000D, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_IsHoldingItem_True' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_IsHoldingItem_Item_Name) == 0x000010, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_IsHoldingItem_Item_Name' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, Temp_bool_Variable) == 0x000029, "Member 'Creative_UseRestriction_Component_C_State_Checks::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_IsValidPlayState_True) == 0x00002A, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_IsValidPlayState_True' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_IsEnabled_True) == 0x00002B, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_IsEnabled_True' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, K2Node_Select_Default) == 0x00002C, "Member 'Creative_UseRestriction_Component_C_State_Checks::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_BooleanAND_ReturnValue_1) == 0x00002D, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_BooleanAND_ReturnValue_2) == 0x00002E, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_BooleanAND_ReturnValue_3) == 0x00002F, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_State_Checks, CallFunc_BooleanAND_ReturnValue_4) == 0x000030, "Member 'Creative_UseRestriction_Component_C_State_Checks::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");

// Function Creative_UseRestriction_Component.Creative_UseRestriction_Component_C.SetTeamsWithAffects
// 0x0040 (0x0040 - 0x0000)
struct Creative_UseRestriction_Component_C_SetTeamsWithAffects final
{
public:
	int32                                         Team_Index;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AffectsAllButSelected;                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 All_Teams;                                         // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_GetShiftedAnyTeamValue_ReturnValue;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShiftedAnyTeamValue_ReturnValue_1;     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamValueAsIndex_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValidTeamIndex_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_UseRestriction_Component_C_SetTeamsWithAffects) == 0x000008, "Wrong alignment on Creative_UseRestriction_Component_C_SetTeamsWithAffects");
static_assert(sizeof(Creative_UseRestriction_Component_C_SetTeamsWithAffects) == 0x000040, "Wrong size on Creative_UseRestriction_Component_C_SetTeamsWithAffects");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetTeamsWithAffects, Team_Index) == 0x000000, "Member 'Creative_UseRestriction_Component_C_SetTeamsWithAffects::Team_Index' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetTeamsWithAffects, AffectsAllButSelected) == 0x000004, "Member 'Creative_UseRestriction_Component_C_SetTeamsWithAffects::AffectsAllButSelected' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetTeamsWithAffects, All_Teams) == 0x000008, "Member 'Creative_UseRestriction_Component_C_SetTeamsWithAffects::All_Teams' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetTeamsWithAffects, CallFunc_GetShiftedAnyTeamValue_ReturnValue) == 0x000018, "Member 'Creative_UseRestriction_Component_C_SetTeamsWithAffects::CallFunc_GetShiftedAnyTeamValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetTeamsWithAffects, CallFunc_GetShiftedAnyTeamValue_ReturnValue_1) == 0x00001C, "Member 'Creative_UseRestriction_Component_C_SetTeamsWithAffects::CallFunc_GetShiftedAnyTeamValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetTeamsWithAffects, CallFunc_GetTeamValueAsIndex_ReturnValue) == 0x000020, "Member 'Creative_UseRestriction_Component_C_SetTeamsWithAffects::CallFunc_GetTeamValueAsIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetTeamsWithAffects, CallFunc_Set_Remove_ReturnValue) == 0x000024, "Member 'Creative_UseRestriction_Component_C_SetTeamsWithAffects::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetTeamsWithAffects, K2Node_MakeArray_Array) == 0x000028, "Member 'Creative_UseRestriction_Component_C_SetTeamsWithAffects::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetTeamsWithAffects, CallFunc_IsValidTeamIndex_ReturnValue) == 0x000038, "Member 'Creative_UseRestriction_Component_C_SetTeamsWithAffects::CallFunc_IsValidTeamIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetTeamsWithAffects, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'Creative_UseRestriction_Component_C_SetTeamsWithAffects::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Creative_UseRestriction_Component.Creative_UseRestriction_Component_C.SetClassWithAffectsSafeTeamIndex
// 0x0108 (0x0108 - 0x0000)
struct Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex final
{
public:
	int32                                         Class_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AffectsAllButSelected;                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeClassSpecialCases                    Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeClassSpecialCases                    Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeClassSpecialCases                    Temp_byte_Variable_2;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_7;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeClassSpecialCases                    Temp_byte_Variable_3;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable_11;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeClassSpecialCases                    Temp_byte_Variable_4;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_13;                              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeClassSpecialCases                    Temp_byte_Variable_5;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_16;                              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_17;                              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_18;                              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_4;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_19;                              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_20;                              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_21;                              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_22;                              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_23;                              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeClassSpecialCases                    Temp_byte_Variable_6;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_5;                           // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_6;                           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeClassSpecialCases                    Temp_byte_Variable_7;                              // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array_1;                          // 0x00C8(0x0010)(ReferenceParm)
	int32                                         K2Node_Select_Default_7;                           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array_2;                          // 0x00E0(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_24;                              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_25;                              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_26;                              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeClassSpecialCases                    Temp_byte_Variable_8;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_8;                           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex) == 0x000008, "Wrong alignment on Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex");
static_assert(sizeof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex) == 0x000108, "Wrong size on Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Class_Index) == 0x000000, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Class_Index' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, AffectsAllButSelected) == 0x000004, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::AffectsAllButSelected' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable) == 0x000008, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000D, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000E, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_BooleanAND_ReturnValue) == 0x00000F, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000010, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_byte_Variable) == 0x000011, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_1) == 0x000014, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_2) == 0x000018, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_3) == 0x00001C, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_MakeLiteralByte_ReturnValue) == 0x000020, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_byte_Variable_1) == 0x000021, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_4) == 0x000024, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_5) == 0x000028, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_6) == 0x00002C, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000030, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000031, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_byte_Variable_2) == 0x000032, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_7) == 0x000034, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_8) == 0x000038, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_9) == 0x00003C, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_byte_Variable_3) == 0x000040, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_Select_Default) == 0x000044, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_10) == 0x000048, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_MakeArray_Array) == 0x000050, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_11) == 0x000060, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_12) == 0x000064, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000068, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_Select_Default_1) == 0x00006C, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_byte_Variable_4) == 0x000070, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_13) == 0x000074, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_14) == 0x000078, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_14' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_15) == 0x00007C, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_15' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000080, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_Select_Default_2) == 0x000084, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000088, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_byte_Variable_5) == 0x000089, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_16) == 0x00008C, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_16' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_17) == 0x000090, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_17' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_18) == 0x000094, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_18' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000098, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_Select_Default_3) == 0x00009C, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_Select_Default_4) == 0x0000A0, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_19) == 0x0000A4, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_19' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_20) == 0x0000A8, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_20' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_21) == 0x0000AC, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_21' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_22) == 0x0000B0, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_22' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_23) == 0x0000B4, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_23' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_byte_Variable_6) == 0x0000B8, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x0000B9, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_Select_Default_5) == 0x0000BC, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_Select_Default_6) == 0x0000C0, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x0000C4, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_byte_Variable_7) == 0x0000C5, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_MakeArray_Array_1) == 0x0000C8, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_Select_Default_7) == 0x0000D8, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_MakeArray_Array_2) == 0x0000E0, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x0000F0, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_24) == 0x0000F4, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_24' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_25) == 0x0000F8, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_25' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_int_Variable_26) == 0x0000FC, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_int_Variable_26' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, Temp_byte_Variable_8) == 0x000100, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex, K2Node_Select_Default_8) == 0x000104, "Member 'Creative_UseRestriction_Component_C_SetClassWithAffectsSafeTeamIndex::K2Node_Select_Default_8' has a wrong offset!");

// Function Creative_UseRestriction_Component.Creative_UseRestriction_Component_C.Set Initial Single Team
// 0x0048 (0x0048 - 0x0000)
struct Creative_UseRestriction_Component_C_Set_Initial_Single_Team final
{
public:
	int32                                         Team_Index;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 All_Teams;                                         // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_GetNumberOfTeams_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamValueAsIndex_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidTeamIndex_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTeamAny_ReturnValue;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
};
static_assert(alignof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team) == 0x000008, "Wrong alignment on Creative_UseRestriction_Component_C_Set_Initial_Single_Team");
static_assert(sizeof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team) == 0x000048, "Wrong size on Creative_UseRestriction_Component_C_Set_Initial_Single_Team");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team, Team_Index) == 0x000000, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Team::Team_Index' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team, All_Teams) == 0x000008, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Team::All_Teams' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team, CallFunc_GetNumberOfTeams_ReturnValue) == 0x000018, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Team::CallFunc_GetNumberOfTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Team::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team, CallFunc_GetTeamValueAsIndex_ReturnValue) == 0x000020, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Team::CallFunc_GetTeamValueAsIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team, CallFunc_IsValidTeamIndex_ReturnValue) == 0x000024, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Team::CallFunc_IsValidTeamIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team, CallFunc_IsTeamAny_ReturnValue) == 0x000025, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Team::CallFunc_IsTeamAny_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team, Temp_int_Variable) == 0x000028, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Team::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Team::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Team::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Team, K2Node_MakeArray_Array) == 0x000038, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Team::K2Node_MakeArray_Array' has a wrong offset!");

// Function Creative_UseRestriction_Component.Creative_UseRestriction_Component_C.Set Initial Single Class
// 0x0018 (0x0018 - 0x0000)
struct Creative_UseRestriction_Component_C_Set_Initial_Single_Class final
{
public:
	int32                                         Class_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_UseRestriction_Component_C_Set_Initial_Single_Class) == 0x000004, "Wrong alignment on Creative_UseRestriction_Component_C_Set_Initial_Single_Class");
static_assert(sizeof(Creative_UseRestriction_Component_C_Set_Initial_Single_Class) == 0x000018, "Wrong size on Creative_UseRestriction_Component_C_Set_Initial_Single_Class");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Class, Class_Index) == 0x000000, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Class::Class_Index' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Class, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Class::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Class, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000005, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Class::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Class, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Class::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Class, Temp_int_Variable) == 0x00000C, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Class::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Class, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Class::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_UseRestriction_Component_C_Set_Initial_Single_Class, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Creative_UseRestriction_Component_C_Set_Initial_Single_Class::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Creative_UseRestriction_Component.Creative_UseRestriction_Component_C.Set Class with Affects
// 0x00B0 (0x00B0 - 0x0000)
struct Creative_UseRestriction_Component_C_Set_Class_with_Affects final
{
public:
	int32                                         Class_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AffectsAllButSelected;                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsesSafeTeamIndexing;                              // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeClassSpecialCases                    Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
