#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeMiniGameInfoWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeMiniGameInfoWidget.CreativeMiniGameInfoWidget_C
// 0x01F8 (0x04A0 - 0x02A8)
class UCreativeMiniGameInfoWidget_C final : public UFortCreativeMiniGameInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimHideDetails;                                   // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimShowDetails;                                   // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackingFooter;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackingHeader;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BulletBox1;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BulletBox2;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BulletBox3;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_216;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CreativeLogoWatermark;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CreatorBox;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DetailsBacking;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DetailsBox;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               GameDetailsContent;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               GameDetailsOverlay;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputReflectorButton_C*                HideDetailsButton;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_294;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_295;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_609;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlayheader;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                panelSpacer;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SaC_Button;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputReflectorButton_C*                ShowDetailsButton;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            ShowHideDetailsTextSwitcher;                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      StartGameButton;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputReflectorButton_C*                SupportAffliateButton;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SupportCodeBox;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Toggle_Details;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCr_XP_State_C*                         XpState_Compact;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               XpState_Compact_Overlay;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCr_XP_State_C*                         XpState_Expanded;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCreativeAffiliatePanel_C*              AffiliatePanel;                                    // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisplayingAffiliatePanel;                         // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnStartingGame;                                    // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bInputEnabled;                                     // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0xF];                                      // 0x03D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ProgressBarSlateBrushCopy;                         // 0x03E0(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           BindVolumeEventsTimerHandle;                       // 0x0490(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateStartButtonVisibility();
	void ToggleInfo();
	void SupportCreator();
	void ShowDetailsPanel(bool ShouldShow, bool ShouldAnimate);
	void OnVolumeChanged(class APlayerState* ChangedPlayerState, class AFortVolume* ChangedVolume, bool bIsEntering);
	void OnTextSet();
	void OnMinigameStateChange(class AFortMinigame* ChangedMinigame, EFortMinigameState MinigameState);
	void OnMiniGameStartedFromInputComponent();
	void OnExitVolume(class APlayerState* EnteringPlayerState, class AFortVolume* EnteredVolume);
	void OnEnterVolume(class APlayerState* EnteringPlayerState, class AFortVolume* EnteredVolume);
	void PreConstruct(bool IsDesignTime);
	void PlayIntro();
	void OnComplete_C81092C34891DE4D9A4522B8A69838FF(class UUserWidget* UserWidget);
	void GetStartButtomProgressMaterial(class UMaterialInstanceDynamic** Output_Get);
	void ExecuteUbergraph_CreativeMiniGameInfoWidget(int32 EntryPoint);
	void EnablePanelInputs(bool InputEnabled);
	void Construct();
	void InitProgressDynamicMaterial();
	void HideIfTextEmpty(class UTextBlock* TextToCheck, class UWidget* ElementToHide);
	void CollapseDetailsAfterAnim();
	void BndEvt__SupportAffliateButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__StartGameButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ShowDetailsButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__HideDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BindVolumeEvents();
	void AffiliatePanelClosed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeMiniGameInfoWidget_C">();
	}
	static class UCreativeMiniGameInfoWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeMiniGameInfoWidget_C>();
	}
};
static_assert(alignof(UCreativeMiniGameInfoWidget_C) == 0x000010, "Wrong alignment on UCreativeMiniGameInfoWidget_C");
static_assert(sizeof(UCreativeMiniGameInfoWidget_C) == 0x0004A0, "Wrong size on UCreativeMiniGameInfoWidget_C");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, UberGraphFrame) == 0x0002A8, "Member 'UCreativeMiniGameInfoWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, Intro) == 0x0002B0, "Member 'UCreativeMiniGameInfoWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, AnimHideDetails) == 0x0002B8, "Member 'UCreativeMiniGameInfoWidget_C::AnimHideDetails' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, AnimShowDetails) == 0x0002C0, "Member 'UCreativeMiniGameInfoWidget_C::AnimShowDetails' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, BackingFooter) == 0x0002C8, "Member 'UCreativeMiniGameInfoWidget_C::BackingFooter' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, BackingHeader) == 0x0002D0, "Member 'UCreativeMiniGameInfoWidget_C::BackingHeader' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, BulletBox1) == 0x0002D8, "Member 'UCreativeMiniGameInfoWidget_C::BulletBox1' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, BulletBox2) == 0x0002E0, "Member 'UCreativeMiniGameInfoWidget_C::BulletBox2' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, BulletBox3) == 0x0002E8, "Member 'UCreativeMiniGameInfoWidget_C::BulletBox3' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, CommonActionWidget_216) == 0x0002F0, "Member 'UCreativeMiniGameInfoWidget_C::CommonActionWidget_216' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, CreativeLogoWatermark) == 0x0002F8, "Member 'UCreativeMiniGameInfoWidget_C::CreativeLogoWatermark' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, CreatorBox) == 0x000300, "Member 'UCreativeMiniGameInfoWidget_C::CreatorBox' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, DetailsBacking) == 0x000308, "Member 'UCreativeMiniGameInfoWidget_C::DetailsBacking' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, DetailsBox) == 0x000310, "Member 'UCreativeMiniGameInfoWidget_C::DetailsBox' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, GameDetailsContent) == 0x000318, "Member 'UCreativeMiniGameInfoWidget_C::GameDetailsContent' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, GameDetailsOverlay) == 0x000320, "Member 'UCreativeMiniGameInfoWidget_C::GameDetailsOverlay' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, HideDetailsButton) == 0x000328, "Member 'UCreativeMiniGameInfoWidget_C::HideDetailsButton' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, Image_3) == 0x000330, "Member 'UCreativeMiniGameInfoWidget_C::Image_3' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, Image_294) == 0x000338, "Member 'UCreativeMiniGameInfoWidget_C::Image_294' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, Image_295) == 0x000340, "Member 'UCreativeMiniGameInfoWidget_C::Image_295' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, Image_609) == 0x000348, "Member 'UCreativeMiniGameInfoWidget_C::Image_609' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, Overlayheader) == 0x000350, "Member 'UCreativeMiniGameInfoWidget_C::Overlayheader' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, panelSpacer) == 0x000358, "Member 'UCreativeMiniGameInfoWidget_C::panelSpacer' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, SaC_Button) == 0x000360, "Member 'UCreativeMiniGameInfoWidget_C::SaC_Button' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, ShowDetailsButton) == 0x000368, "Member 'UCreativeMiniGameInfoWidget_C::ShowDetailsButton' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, ShowHideDetailsTextSwitcher) == 0x000370, "Member 'UCreativeMiniGameInfoWidget_C::ShowHideDetailsTextSwitcher' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, StartGameButton) == 0x000378, "Member 'UCreativeMiniGameInfoWidget_C::StartGameButton' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, SupportAffliateButton) == 0x000380, "Member 'UCreativeMiniGameInfoWidget_C::SupportAffliateButton' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, SupportCodeBox) == 0x000388, "Member 'UCreativeMiniGameInfoWidget_C::SupportCodeBox' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, Toggle_Details) == 0x000390, "Member 'UCreativeMiniGameInfoWidget_C::Toggle_Details' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, XpState_Compact) == 0x000398, "Member 'UCreativeMiniGameInfoWidget_C::XpState_Compact' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, XpState_Compact_Overlay) == 0x0003A0, "Member 'UCreativeMiniGameInfoWidget_C::XpState_Compact_Overlay' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, XpState_Expanded) == 0x0003A8, "Member 'UCreativeMiniGameInfoWidget_C::XpState_Expanded' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, AffiliatePanel) == 0x0003B0, "Member 'UCreativeMiniGameInfoWidget_C::AffiliatePanel' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, bDisplayingAffiliatePanel) == 0x0003B8, "Member 'UCreativeMiniGameInfoWidget_C::bDisplayingAffiliatePanel' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, OnStartingGame) == 0x0003C0, "Member 'UCreativeMiniGameInfoWidget_C::OnStartingGame' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, bInputEnabled) == 0x0003D0, "Member 'UCreativeMiniGameInfoWidget_C::bInputEnabled' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, ProgressBarSlateBrushCopy) == 0x0003E0, "Member 'UCreativeMiniGameInfoWidget_C::ProgressBarSlateBrushCopy' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameInfoWidget_C, BindVolumeEventsTimerHandle) == 0x000490, "Member 'UCreativeMiniGameInfoWidget_C::BindVolumeEventsTimerHandle' has a wrong offset!");

}

