#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EliminatedOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EliminatedOverlay.EliminatedOverlay_C
// 0x0058 (0x03C0 - 0x0368)
class UEliminatedOverlay_C final : public UEliminatedOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MultiWinnerSwap;                                   // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WinnerDetermined;                                  // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlacementOutro;                                    // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlacementIntro;                                    // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EliminatedToSpectating;                            // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EliminatedByIntro;                                 // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_phasetype;                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerRankEmblem_C*                    PlayerRankEmblem;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Spectating;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxEliminatedbySpectating;                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void WinnerSwapComplete();
	void SetPlaceTextFont_TEMP();
	void SetBannerInfo(const struct FPlayerBannerInfo& BannerInfo);
	void PlayPlacementOutro();
	void PlacementIntroComplete();
	void OnWinnerDetermined();
	void OnUpdateMultiwinner();
	void OnShowPlacementBox();
	void OnResetSpectatingForCreative();
	void OnEliminatedByIntro();
	void On_UI_Extensions_Changed(class AFortMinigame* Minigame);
	bool IsEliminatedByIntroAnimFinished();
	void Finished_2E2713B544F74046B6F0299A50CD9864();
	void ExecuteUbergraph_EliminatedOverlay(int32 EntryPoint);
	class FText DeathCauseToText(EDeathCause DeathCause);
	void Construct();
	void AdjustVertical_BoxEliminatedPadding();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EliminatedOverlay_C">();
	}
	static class UEliminatedOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEliminatedOverlay_C>();
	}
};
static_assert(alignof(UEliminatedOverlay_C) == 0x000008, "Wrong alignment on UEliminatedOverlay_C");
static_assert(sizeof(UEliminatedOverlay_C) == 0x0003C0, "Wrong size on UEliminatedOverlay_C");
static_assert(offsetof(UEliminatedOverlay_C, UberGraphFrame) == 0x000368, "Member 'UEliminatedOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, MultiWinnerSwap) == 0x000370, "Member 'UEliminatedOverlay_C::MultiWinnerSwap' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, WinnerDetermined) == 0x000378, "Member 'UEliminatedOverlay_C::WinnerDetermined' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, PlacementOutro) == 0x000380, "Member 'UEliminatedOverlay_C::PlacementOutro' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, PlacementIntro) == 0x000388, "Member 'UEliminatedOverlay_C::PlacementIntro' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, EliminatedToSpectating) == 0x000390, "Member 'UEliminatedOverlay_C::EliminatedToSpectating' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, EliminatedByIntro) == 0x000398, "Member 'UEliminatedOverlay_C::EliminatedByIntro' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, CommonWidgetSwitcher_phasetype) == 0x0003A0, "Member 'UEliminatedOverlay_C::CommonWidgetSwitcher_phasetype' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, PlayerRankEmblem) == 0x0003A8, "Member 'UEliminatedOverlay_C::PlayerRankEmblem' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, Text_Spectating) == 0x0003B0, "Member 'UEliminatedOverlay_C::Text_Spectating' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, VerticalBoxEliminatedbySpectating) == 0x0003B8, "Member 'UEliminatedOverlay_C::VerticalBoxEliminatedbySpectating' has a wrong offset!");

}

