#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint.Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C
// 0x0FC0 (0x12E0 - 0x0320)
class UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0338(0x00C8)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0400(0x07F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0BF0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0C10(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0C30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0C58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0C80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0CA8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0CD0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0D10(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0D30(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0D70(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0D90(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0DD0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0DF0(0x00B8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0EA8(0x0108)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail;                               // 0x0FB0(0x0260)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1210(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1258(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1278(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1298(0x0020)()
	bool                                          OneHandGrip;                                       // 0x12B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B9[0x3];                                     // 0x12B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Trail_Alpha;                                       // 0x12BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Trail_RelaxScale;                                  // 0x12C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               GripRotation;                                      // 0x12C4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTethered;                                        // 0x12D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C">();
	}
	static class UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C) == 0x0012E0, "Wrong size on UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000320, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_SubInput) == 0x000338, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_RigidBody) == 0x000400, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000BF0, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000C10, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_3) == 0x000C30, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_2) == 0x000C58, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_1) == 0x000C80, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult) == 0x000CA8, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_2) == 0x000CD0, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_2) == 0x000D10, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_1) == 0x000D30, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_1) == 0x000D70, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x000D90, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult) == 0x000DD0, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_StateMachine) == 0x000DF0, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x000EA8, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_Trail) == 0x000FB0, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_Trail' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x001210, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x001258, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x001278, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x001298, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, OneHandGrip) == 0x0012B8, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::OneHandGrip' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, Trail_Alpha) == 0x0012BC, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::Trail_Alpha' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, Trail_RelaxScale) == 0x0012C0, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::Trail_RelaxScale' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, GripRotation) == 0x0012C4, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::GripRotation' has a wrong offset!");
static_assert(offsetof(UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C, IsTethered) == 0x0012D0, "Member 'UFlopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C::IsTethered' has a wrong offset!");

}

