#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint.Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x013F (0x0140 - 0x0001)
struct Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_87;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_88;                                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_89;                                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_90;                                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_91;                                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_92;                                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          StructProperty_93;                                 // 0x0030(0x002C)(NoDestructor)
	float                                         FloatProperty_94;                                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_95;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_96;                                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_97;                                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_98;                                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_99;                                   // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_100;                                  // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_101;                                  // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_102;                                // 0x0088(0x0020)(NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
};
static_assert(alignof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000140, "Wrong size on Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, ObjectProperty_87) == 0x000008, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::ObjectProperty_87' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, NameProperty_88) == 0x000010, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::NameProperty_88' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, ObjectProperty_89) == 0x000018, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::ObjectProperty_89' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, NameProperty_90) == 0x000020, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::NameProperty_90' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, BoolProperty_91) == 0x000028, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::BoolProperty_91' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, FloatProperty_92) == 0x00002C, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::FloatProperty_92' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, StructProperty_93) == 0x000030, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::StructProperty_93' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, FloatProperty_94) == 0x00005C, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::FloatProperty_94' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, ObjectProperty_95) == 0x000060, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::ObjectProperty_95' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, BoolProperty_96) == 0x000068, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::BoolProperty_96' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, EnumProperty_97) == 0x000069, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::EnumProperty_97' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, ByteProperty_98) == 0x00006A, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::ByteProperty_98' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, NameProperty_99) == 0x00006C, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::NameProperty_99' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, NameProperty_100) == 0x000074, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::NameProperty_100' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, NameProperty_101) == 0x00007C, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::NameProperty_101' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, StructProperty_102) == 0x000088, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::StructProperty_102' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

