#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FloppingRabbitLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FloppingRabbitLayerAnimBP_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C
// 0x1890 (0x1CE0 - 0x0450)
class UFloppingRabbitLayerAnimBP_C final : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FloppingRabbitLayerAnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0458(0x0006)(HasGetValueTypeHash)
	uint8                                         Pad_45E[0x2];                                      // 0x045E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0460(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0468(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x0470(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x0490(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x0558(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x0578(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0640(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x0660(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x0728(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x07F0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0810(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x08D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x08F8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0938(0x0088)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x09C0(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0A00(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0A20(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0A60(0x0088)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0AE8(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0B28(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0B48(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0B88(0x0088)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0C10(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0C50(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0C70(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0CB0(0x0088)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0D38(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0D78(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0D98(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0E60(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0E80(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0F48(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x0F68(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x1030(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x1050(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x1070(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x1090(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x10B0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x10D0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x10F0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x1110(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x1130(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1150(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x1170(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x1190(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x11B0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1278(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x1298(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x1360(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x1380(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x1448(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x1468(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1530(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x1550(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1618(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1638(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1700(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1720(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x17E8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1808(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x18D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x18F0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x19B8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x19D8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1AA0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1AC0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1B88(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1BA8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1BE8(0x0088)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1C70(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1CB0(0x0020)()
	bool                                          OneHandGrip;                                       // 0x1CD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding_0);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* ItemPreIK_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive_0);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop_0);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart_0);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot_0);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive_0);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive_0);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha, float Yaw, float Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset_0);
	void ExecuteUbergraph_FloppingRabbitLayerAnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FloppingRabbitLayerAnimBP_C">();
	}
	static class UFloppingRabbitLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloppingRabbitLayerAnimBP_C>();
	}
};
static_assert(alignof(UFloppingRabbitLayerAnimBP_C) == 0x000010, "Wrong alignment on UFloppingRabbitLayerAnimBP_C");
static_assert(sizeof(UFloppingRabbitLayerAnimBP_C) == 0x001CE0, "Wrong size on UFloppingRabbitLayerAnimBP_C");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, UberGraphFrame) == 0x000450, "Member 'UFloppingRabbitLayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, __AnimBlueprintMutables) == 0x000458, "Member 'UFloppingRabbitLayerAnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000460, "Member 'UFloppingRabbitLayerAnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimBlueprintExtension_Base) == 0x000468, "Member 'UFloppingRabbitLayerAnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_34) == 0x000470, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_34' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_18) == 0x000490, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_18' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_33) == 0x000558, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_33' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_17) == 0x000578, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_17' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_32) == 0x000640, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_32' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_16) == 0x000660, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_16' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_15) == 0x000728, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_15' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_31) == 0x0007F0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_31' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_14) == 0x000810, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_14' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_30) == 0x0008D8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_30' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x0008F8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x000938, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x0009C0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_29) == 0x000A00, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_29' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x000A20, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x000A60, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000AE8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_28) == 0x000B28, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_28' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000B48, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x000B88, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000C10, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_27) == 0x000C50, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_27' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000C70, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x000CB0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000D38, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_26) == 0x000D78, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_26' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_13) == 0x000D98, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_25) == 0x000E60, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_25' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_12) == 0x000E80, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_24) == 0x000F48, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_24' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_11) == 0x000F68, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_23) == 0x001030, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_23' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_22) == 0x001050, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_22' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_21) == 0x001070, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_20) == 0x001090, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_19) == 0x0010B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_18) == 0x0010D0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_17) == 0x0010F0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_16) == 0x001110, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_15) == 0x001130, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_14) == 0x001150, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_13) == 0x001170, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_12) == 0x001190, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_10) == 0x0011B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_11) == 0x001278, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_9) == 0x001298, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_10) == 0x001360, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_8) == 0x001380, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_9) == 0x001448, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_7) == 0x001468, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_8) == 0x001530, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_6) == 0x001550, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_7) == 0x001618, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_5) == 0x001638, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_6) == 0x001700, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_4) == 0x001720, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_5) == 0x0017E8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_3) == 0x001808, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_4) == 0x0018D0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x0018F0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_3) == 0x0019B8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x0019D8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_2) == 0x001AA0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x001AC0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_1) == 0x001B88, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001BA8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool) == 0x001BE8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer) == 0x001C70, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root) == 0x001CB0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, OneHandGrip) == 0x001CD0, "Member 'UFloppingRabbitLayerAnimBP_C::OneHandGrip' has a wrong offset!");

}

