#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fort_Pickup_Creative

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Fort_Pickup_Creative.Fort_Pickup_Creative_C.UpdateAllowedTeamSettings
// 0x0002 (0x0002 - 0x0000)
struct Fort_Pickup_Creative_C_UpdateAllowedTeamSettings final
{
public:
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fort_Pickup_Creative_C_UpdateAllowedTeamSettings) == 0x000001, "Wrong alignment on Fort_Pickup_Creative_C_UpdateAllowedTeamSettings");
static_assert(sizeof(Fort_Pickup_Creative_C_UpdateAllowedTeamSettings) == 0x000002, "Wrong size on Fort_Pickup_Creative_C_UpdateAllowedTeamSettings");
static_assert(offsetof(Fort_Pickup_Creative_C_UpdateAllowedTeamSettings, CallFunc_Conv_IntToBool_ReturnValue) == 0x000000, "Member 'Fort_Pickup_Creative_C_UpdateAllowedTeamSettings::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_UpdateAllowedTeamSettings, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'Fort_Pickup_Creative_C_UpdateAllowedTeamSettings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Fort_Pickup_Creative.Fort_Pickup_Creative_C.UpdateAllowedClassSettings
// 0x0002 (0x0002 - 0x0000)
struct Fort_Pickup_Creative_C_UpdateAllowedClassSettings final
{
public:
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fort_Pickup_Creative_C_UpdateAllowedClassSettings) == 0x000001, "Wrong alignment on Fort_Pickup_Creative_C_UpdateAllowedClassSettings");
static_assert(sizeof(Fort_Pickup_Creative_C_UpdateAllowedClassSettings) == 0x000002, "Wrong size on Fort_Pickup_Creative_C_UpdateAllowedClassSettings");
static_assert(offsetof(Fort_Pickup_Creative_C_UpdateAllowedClassSettings, CallFunc_Conv_IntToBool_ReturnValue) == 0x000000, "Member 'Fort_Pickup_Creative_C_UpdateAllowedClassSettings::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_UpdateAllowedClassSettings, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'Fort_Pickup_Creative_C_UpdateAllowedClassSettings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Fort_Pickup_Creative.Fort_Pickup_Creative_C.Set Pickup Settings
// 0x0018 (0x0018 - 0x0000)
struct Fort_Pickup_Creative_C_Set_Pickup_Settings final
{
public:
	int32                                         NewAllowedTeam;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewAllowedClass;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewAffectsTeam;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewAffectsClass;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewItemsVisibleToAllowedOnly;                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fort_Pickup_Creative_C_Set_Pickup_Settings) == 0x000004, "Wrong alignment on Fort_Pickup_Creative_C_Set_Pickup_Settings");
static_assert(sizeof(Fort_Pickup_Creative_C_Set_Pickup_Settings) == 0x000018, "Wrong size on Fort_Pickup_Creative_C_Set_Pickup_Settings");
static_assert(offsetof(Fort_Pickup_Creative_C_Set_Pickup_Settings, NewAllowedTeam) == 0x000000, "Member 'Fort_Pickup_Creative_C_Set_Pickup_Settings::NewAllowedTeam' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_Set_Pickup_Settings, NewAllowedClass) == 0x000004, "Member 'Fort_Pickup_Creative_C_Set_Pickup_Settings::NewAllowedClass' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_Set_Pickup_Settings, NewAffectsTeam) == 0x000008, "Member 'Fort_Pickup_Creative_C_Set_Pickup_Settings::NewAffectsTeam' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_Set_Pickup_Settings, NewAffectsClass) == 0x00000C, "Member 'Fort_Pickup_Creative_C_Set_Pickup_Settings::NewAffectsClass' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_Set_Pickup_Settings, NewItemsVisibleToAllowedOnly) == 0x000010, "Member 'Fort_Pickup_Creative_C_Set_Pickup_Settings::NewItemsVisibleToAllowedOnly' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_Set_Pickup_Settings, CallFunc_Conv_IntToBool_ReturnValue) == 0x000014, "Member 'Fort_Pickup_Creative_C_Set_Pickup_Settings::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_Set_Pickup_Settings, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x000015, "Member 'Fort_Pickup_Creative_C_Set_Pickup_Settings::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_Set_Pickup_Settings, CallFunc_Not_PreBool_ReturnValue) == 0x000016, "Member 'Fort_Pickup_Creative_C_Set_Pickup_Settings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_Set_Pickup_Settings, CallFunc_Not_PreBool_ReturnValue_1) == 0x000017, "Member 'Fort_Pickup_Creative_C_Set_Pickup_Settings::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function Fort_Pickup_Creative.Fort_Pickup_Creative_C.ExecuteUbergraph_Fort_Pickup_Creative
// 0x0120 (0x0120 - 0x0000)
struct Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0030(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetAllPassengers_self_CastInput;          // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue;             // 0x0100(0x0010)(ReferenceParm)
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAttachToMinigame_ReturnValue;          // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative) == 0x000008, "Wrong alignment on Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative");
static_assert(sizeof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative) == 0x000120, "Wrong size on Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, EntryPoint) == 0x000000, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000010, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, K2Node_ComponentBoundEvent_OtherActor) == 0x000018, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, K2Node_ComponentBoundEvent_OtherComp) == 0x000020, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000028, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, K2Node_ComponentBoundEvent_bFromSweep) == 0x00002C, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, K2Node_ComponentBoundEvent_SweepResult) == 0x000030, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, K2Node_DynamicCast_AsFort_Athena_Vehicle) == 0x0000D0, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::K2Node_DynamicCast_AsFort_Athena_Vehicle' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, K2Node_DynamicCast_AsFort_Pawn) == 0x0000E0, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, CallFunc_GetAllPassengers_self_CastInput) == 0x0000F0, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::CallFunc_GetAllPassengers_self_CastInput' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, CallFunc_GetAllPassengers_ReturnValue) == 0x000100, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::CallFunc_GetAllPassengers_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, CallFunc_Array_Get_Item) == 0x000110, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, CallFunc_Less_IntInt_ReturnValue) == 0x00011C, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative, CallFunc_TryAttachToMinigame_ReturnValue) == 0x00011D, "Member 'Fort_Pickup_Creative_C_ExecuteUbergraph_Fort_Pickup_Creative::CallFunc_TryAttachToMinigame_ReturnValue' has a wrong offset!");

// Function Fort_Pickup_Creative.Fort_Pickup_Creative_C.BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00C0 (0x00C0 - 0x0000)
struct Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000C0, "Wrong size on Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Fort_Pickup_Creative_C_BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Fort_Pickup_Creative.Fort_Pickup_Creative_C.ApplySubscriptionToPlayerChangesTeamOrClass
// 0x0058 (0x0058 - 0x0000)
struct Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass final
{
public:
	bool                                          Subscribe;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0018(0x0010)(ReferenceParm)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass) == 0x000008, "Wrong alignment on Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass");
static_assert(sizeof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass) == 0x000058, "Wrong size on Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, Subscribe) == 0x000000, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::Subscribe' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000018, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, CallFunc_Array_Get_Item) == 0x000028, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, K2Node_DynamicCast_AsFort_Player_State_Athena) == 0x000038, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::K2Node_DynamicCast_AsFort_Player_State_Athena' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'Fort_Pickup_Creative_C_ApplySubscriptionToPlayerChangesTeamOrClass::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function Fort_Pickup_Creative.Fort_Pickup_Creative_C.BlueprintClassAllowed
// 0x0010 (0x0010 - 0x0000)
struct Fort_Pickup_Creative_C_BlueprintClassAllowed final
{
public:
	const class AFortPawn*                        Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_True;                        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fort_Pickup_Creative_C_BlueprintClassAllowed) == 0x000008, "Wrong alignment on Fort_Pickup_Creative_C_BlueprintClassAllowed");
static_assert(sizeof(Fort_Pickup_Creative_C_BlueprintClassAllowed) == 0x000010, "Wrong size on Fort_Pickup_Creative_C_BlueprintClassAllowed");
static_assert(offsetof(Fort_Pickup_Creative_C_BlueprintClassAllowed, Pawn) == 0x000000, "Member 'Fort_Pickup_Creative_C_BlueprintClassAllowed::Pawn' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_BlueprintClassAllowed, ReturnValue) == 0x000008, "Member 'Fort_Pickup_Creative_C_BlueprintClassAllowed::ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_BlueprintClassAllowed, CallFunc_IsValidClass_True) == 0x000009, "Member 'Fort_Pickup_Creative_C_BlueprintClassAllowed::CallFunc_IsValidClass_True' has a wrong offset!");

// Function Fort_Pickup_Creative.Fort_Pickup_Creative_C.BlueprintTeamAllowed
// 0x0010 (0x0010 - 0x0000)
struct Fort_Pickup_Creative_C_BlueprintTeamAllowed final
{
public:
	const class AFortPawn*                        Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidTeam_Valid;                        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fort_Pickup_Creative_C_BlueprintTeamAllowed) == 0x000008, "Wrong alignment on Fort_Pickup_Creative_C_BlueprintTeamAllowed");
static_assert(sizeof(Fort_Pickup_Creative_C_BlueprintTeamAllowed) == 0x000010, "Wrong size on Fort_Pickup_Creative_C_BlueprintTeamAllowed");
static_assert(offsetof(Fort_Pickup_Creative_C_BlueprintTeamAllowed, Pawn) == 0x000000, "Member 'Fort_Pickup_Creative_C_BlueprintTeamAllowed::Pawn' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_BlueprintTeamAllowed, ReturnValue) == 0x000008, "Member 'Fort_Pickup_Creative_C_BlueprintTeamAllowed::ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Pickup_Creative_C_BlueprintTeamAllowed, CallFunc_IsValidTeam_Valid) == 0x000009, "Member 'Fort_Pickup_Creative_C_BlueprintTeamAllowed::CallFunc_IsValidTeam_Valid' has a wrong offset!");

}

