#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortPostGameDisabledMenuEntryOverlay

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortPostGameDisabledMenuEntryOverlay.FortPostGameDisabledMenuEntryOverlay_C
// 0x0058 (0x02B0 - 0x0258)
class UFortPostGameDisabledMenuEntryOverlay_C final : public UFortPostGameMenuEntryOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          BorderSkew;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           HoverBGColor;                                      // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NormalBGColor;                                     // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            HoverTextColor;                                    // 0x0288(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            NormalTextColor;                                   // 0x029C(0x0014)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime);
	void OnUnhovered();
	void OnHovered();
	void ExecuteUbergraph_FortPostGameDisabledMenuEntryOverlay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortPostGameDisabledMenuEntryOverlay_C">();
	}
	static class UFortPostGameDisabledMenuEntryOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPostGameDisabledMenuEntryOverlay_C>();
	}
};
static_assert(alignof(UFortPostGameDisabledMenuEntryOverlay_C) == 0x000008, "Wrong alignment on UFortPostGameDisabledMenuEntryOverlay_C");
static_assert(sizeof(UFortPostGameDisabledMenuEntryOverlay_C) == 0x0002B0, "Wrong size on UFortPostGameDisabledMenuEntryOverlay_C");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, UberGraphFrame) == 0x000258, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, BorderSkew) == 0x000260, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::BorderSkew' has a wrong offset!");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, HoverBGColor) == 0x000268, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::HoverBGColor' has a wrong offset!");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, NormalBGColor) == 0x000278, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::NormalBGColor' has a wrong offset!");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, HoverTextColor) == 0x000288, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::HoverTextColor' has a wrong offset!");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, NormalTextColor) == 0x00029C, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::NormalTextColor' has a wrong offset!");

}

