#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortPostGameNewQuestsWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortPostGameNewQuestsWidget.FortPostGameNewQuestsWidget_C.ExecuteUbergraph_FortPostGameNewQuestsWidget
// 0x0058 (0x0058 - 0x0000)
struct FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget) == 0x000008, "Wrong alignment on FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget");
static_assert(sizeof(FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget) == 0x000058, "Wrong size on FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget");
static_assert(offsetof(FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget, EntryPoint) == 0x000000, "Member 'FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000048, "Member 'FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget, CallFunc_PlayAnimation_ReturnValue_3) == 0x000050, "Member 'FortPostGameNewQuestsWidget_C_ExecuteUbergraph_FortPostGameNewQuestsWidget::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

}

