#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Consumable_Throw_Secondary_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Consumable_Throw_Secondary_Parent.GA_Athena_Consumable_Throw_Secondary_Parent_C.AddCookGC
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Consumable_Throw_Secondary_Parent_C_AddCookGC final
{
public:
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Secondary_Parent_C_AddCookGC) == 0x000001, "Wrong alignment on GA_Athena_Consumable_Throw_Secondary_Parent_C_AddCookGC");
static_assert(sizeof(GA_Athena_Consumable_Throw_Secondary_Parent_C_AddCookGC) == 0x000001, "Wrong size on GA_Athena_Consumable_Throw_Secondary_Parent_C_AddCookGC");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_AddCookGC, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_AddCookGC::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Secondary_Parent.GA_Athena_Consumable_Throw_Secondary_Parent_C.AddValidCamera
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Consumable_Throw_Secondary_Parent_C_AddValidCamera final
{
public:
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Secondary_Parent_C_AddValidCamera) == 0x000001, "Wrong alignment on GA_Athena_Consumable_Throw_Secondary_Parent_C_AddValidCamera");
static_assert(sizeof(GA_Athena_Consumable_Throw_Secondary_Parent_C_AddValidCamera) == 0x000001, "Wrong size on GA_Athena_Consumable_Throw_Secondary_Parent_C_AddValidCamera");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_AddValidCamera, CallFunc_IsValidClass_ReturnValue) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_AddValidCamera::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Secondary_Parent.GA_Athena_Consumable_Throw_Secondary_Parent_C.Cancelled_7CDE11F247AD13935CDDCCA29666AC3E
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_Consumable_Throw_Secondary_Parent_C_Cancelled_7CDE11F247AD13935CDDCCA29666AC3E final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Secondary_Parent_C_Cancelled_7CDE11F247AD13935CDDCCA29666AC3E) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Secondary_Parent_C_Cancelled_7CDE11F247AD13935CDDCCA29666AC3E");
static_assert(sizeof(GA_Athena_Consumable_Throw_Secondary_Parent_C_Cancelled_7CDE11F247AD13935CDDCCA29666AC3E) == 0x000030, "Wrong size on GA_Athena_Consumable_Throw_Secondary_Parent_C_Cancelled_7CDE11F247AD13935CDDCCA29666AC3E");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_Cancelled_7CDE11F247AD13935CDDCCA29666AC3E, TargetData) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_Cancelled_7CDE11F247AD13935CDDCCA29666AC3E::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_Cancelled_7CDE11F247AD13935CDDCCA29666AC3E, ApplicationTag) == 0x000028, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_Cancelled_7CDE11F247AD13935CDDCCA29666AC3E::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Secondary_Parent.GA_Athena_Consumable_Throw_Secondary_Parent_C.Completed_7CDE11F247AD13935CDDCCA29666AC3E
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_Consumable_Throw_Secondary_Parent_C_Completed_7CDE11F247AD13935CDDCCA29666AC3E final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Secondary_Parent_C_Completed_7CDE11F247AD13935CDDCCA29666AC3E) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Secondary_Parent_C_Completed_7CDE11F247AD13935CDDCCA29666AC3E");
static_assert(sizeof(GA_Athena_Consumable_Throw_Secondary_Parent_C_Completed_7CDE11F247AD13935CDDCCA29666AC3E) == 0x000030, "Wrong size on GA_Athena_Consumable_Throw_Secondary_Parent_C_Completed_7CDE11F247AD13935CDDCCA29666AC3E");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_Completed_7CDE11F247AD13935CDDCCA29666AC3E, TargetData) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_Completed_7CDE11F247AD13935CDDCCA29666AC3E::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_Completed_7CDE11F247AD13935CDDCCA29666AC3E, ApplicationTag) == 0x000028, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_Completed_7CDE11F247AD13935CDDCCA29666AC3E::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Secondary_Parent.GA_Athena_Consumable_Throw_Secondary_Parent_C.EventReceived_11F8FEDB4634DE47482E1B962FB8A5E6
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_11F8FEDB4634DE47482E1B962FB8A5E6 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_11F8FEDB4634DE47482E1B962FB8A5E6) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_11F8FEDB4634DE47482E1B962FB8A5E6");
static_assert(sizeof(GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_11F8FEDB4634DE47482E1B962FB8A5E6) == 0x0000B0, "Wrong size on GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_11F8FEDB4634DE47482E1B962FB8A5E6");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_11F8FEDB4634DE47482E1B962FB8A5E6, Payload) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_11F8FEDB4634DE47482E1B962FB8A5E6::Payload' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Secondary_Parent.GA_Athena_Consumable_Throw_Secondary_Parent_C.EventReceived_69B60BD84BF46B2613ACDE9E1A689444
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_69B60BD84BF46B2613ACDE9E1A689444 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_69B60BD84BF46B2613ACDE9E1A689444) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_69B60BD84BF46B2613ACDE9E1A689444");
static_assert(sizeof(GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_69B60BD84BF46B2613ACDE9E1A689444) == 0x0000B0, "Wrong size on GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_69B60BD84BF46B2613ACDE9E1A689444");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_69B60BD84BF46B2613ACDE9E1A689444, Payload) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_EventReceived_69B60BD84BF46B2613ACDE9E1A689444::Payload' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Secondary_Parent.GA_Athena_Consumable_Throw_Secondary_Parent_C.ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent
// 0x0760 (0x0760 - 0x0000)
struct GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0008(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x003C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0048(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x00D0(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable_2;                            // 0x0190(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0280(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_3;                            // 0x0330(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue;        // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x03FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSpawnLocationAndRotation_Location;     // 0x03FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSpawnLocationAndRotation_Rotation;     // 0x0408(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0428(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0450(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortProjectileTrajectory*              CallFunc_SpawnTrajectoryIndicator_ReturnValue;     // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0460(0x00B8)()
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_1; // 0x0518(0x00B8)()
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_2; // 0x05D0(0x00B8)()
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0688(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0698(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetProjectileInitialSpeedToUse_ProjectileSpeedToUse; // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetProjectileInitialGravityScaleToUse_GravityScaleToUse; // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    CallFunc_SpawnThrownProjectile_SpawnedProjectile;  // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x06D8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0700(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x070C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x070D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70E[0x2];                                      // 0x070E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue;                // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x071A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71B[0x1];                                      // 0x071B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x071C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn;              // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortProjectileTrajectoryData          CallFunc_GetProjectileTrajectoryData_TrajectoryData; // 0x073C(0x0020)(NoDestructor)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x075C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent");
static_assert(sizeof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent) == 0x000760, "Wrong size on GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, EntryPoint) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CustomEvent_TargetData) == 0x000008, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CustomEvent_ApplicationTag) == 0x000030, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000038, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, Temp_struct_Variable) == 0x00003C, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, Temp_struct_Variable_1) == 0x000048, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_WaitDelay_ReturnValue) == 0x000080, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x00009C, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000AC, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000BC, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CustomEvent_Payload_1) == 0x0000D0, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000180, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, Temp_struct_Variable_2) == 0x000190, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000240, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000248, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CreateDelegate_OutputDelegate_6) == 0x00024C, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_WaitNetSync_ReturnValue) == 0x000260, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CreateDelegate_OutputDelegate_7) == 0x000268, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_IsValid_ReturnValue_2) == 0x000278, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CustomEvent_Payload) == 0x000280, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, Temp_struct_Variable_3) == 0x000330, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0003E0, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_IsValid_ReturnValue_3) == 0x0003E8, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_PlayMontageWaitTarget_ReturnValue) == 0x0003F0, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_PlayMontageWaitTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_IsValid_ReturnValue_4) == 0x0003F8, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_K2_CommitAbility_ReturnValue) == 0x0003F9, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_IsServer_ReturnValue) == 0x0003FA, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_Event_bWasCancelled) == 0x0003FB, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetSpawnLocationAndRotation_Location) == 0x0003FC, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetSpawnLocationAndRotation_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetSpawnLocationAndRotation_Rotation) == 0x000408, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetSpawnLocationAndRotation_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000418, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_IsValid_ReturnValue_5) == 0x000420, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CustomEvent_TargetData_2) == 0x000428, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CustomEvent_ApplicationTag_2) == 0x000450, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_SpawnTrajectoryIndicator_ReturnValue) == 0x000458, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_SpawnTrajectoryIndicator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x000460, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_1) == 0x000518, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_2) == 0x0005D0, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CreateDelegate_OutputDelegate_8) == 0x000688, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CreateDelegate_OutputDelegate_9) == 0x000698, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x0006A8, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0006B0, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetQuestManager_ReturnValue) == 0x0006B8, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetProjectileInitialSpeedToUse_ProjectileSpeedToUse) == 0x0006C0, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetProjectileInitialSpeedToUse_ProjectileSpeedToUse' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetProjectileInitialGravityScaleToUse_GravityScaleToUse) == 0x0006C4, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetProjectileInitialGravityScaleToUse_GravityScaleToUse' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_SpawnThrownProjectile_SpawnedProjectile) == 0x0006C8, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_SpawnThrownProjectile_SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_IsValid_ReturnValue_6) == 0x0006D0, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CustomEvent_TargetData_1) == 0x0006D8, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CustomEvent_ApplicationTag_1) == 0x000700, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000708, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00070C, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_IsValid_ReturnValue_7) == 0x00070D, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetWeaponData_ReturnValue) == 0x000710, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetWeaponData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000718, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000719, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_IsUsingTouch_ReturnValue) == 0x00071A, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, K2Node_CreateDelegate_OutputDelegate_10) == 0x00071C, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetOwningPlayer_Player_Pawn) == 0x000730, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetOwningPlayer_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000738, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_GetProjectileTrajectoryData_TrajectoryData) == 0x00073C, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_GetProjectileTrajectoryData_TrajectoryData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent, CallFunc_FMax_ReturnValue) == 0x00075C, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Secondary_Parent::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Secondary_Parent.GA_Athena_Consumable_Throw_Secondary_Parent_C.GetProjectileInitialGravityScaleToUse
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse final
{
public:
	float                                         GravityScaleToUse;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GetProjectileInitialGravityScaleContext;           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurveTableRowValid_ReturnValue;         // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse");
static_assert(sizeof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse) == 0x000028, "Wrong size on GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse, GravityScaleToUse) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse::GravityScaleToUse' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse, GetProjectileInitialGravityScaleContext) == 0x000008, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse::GetProjectileInitialGravityScaleContext' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse, CallFunc_GetValueAtLevel_ReturnValue) == 0x000018, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse, CallFunc_IsValidClass_ReturnValue) == 0x00001C, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000020, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse, CallFunc_EvaluateCurveTableRow_ReturnValue) == 0x000024, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse::CallFunc_EvaluateCurveTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse, CallFunc_IsCurveTableRowValid_ReturnValue) == 0x000025, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialGravityScaleToUse::CallFunc_IsCurveTableRowValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Secondary_Parent.GA_Athena_Consumable_Throw_Secondary_Parent_C.GetProjectileInitialSpeedToUse
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse final
{
public:
	float                                         ProjectileSpeedToUse;                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GetProjectileInitialSpeedToUseContext;             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurveTableRowValid_ReturnValue;         // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse");
static_assert(sizeof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse) == 0x000028, "Wrong size on GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse, ProjectileSpeedToUse) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse::ProjectileSpeedToUse' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse, GetProjectileInitialSpeedToUseContext) == 0x000008, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse::GetProjectileInitialSpeedToUseContext' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse, CallFunc_GetValueAtLevel_ReturnValue) == 0x000018, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse, CallFunc_IsValidClass_ReturnValue) == 0x00001C, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000020, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse, CallFunc_EvaluateCurveTableRow_ReturnValue) == 0x000024, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse::CallFunc_EvaluateCurveTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse, CallFunc_IsCurveTableRowValid_ReturnValue) == 0x000025, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileInitialSpeedToUse::CallFunc_IsCurveTableRowValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Secondary_Parent.GA_Athena_Consumable_Throw_Secondary_Parent_C.GetProjectileTrajectoryPoints
// 0x02C0 (0x02C0 - 0x0000)
struct GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileTrajectoryPoints final
{
public:
	TArray<struct FVector>                        OutSplinePoints;                                   // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        OutSplineTangents;                                 // 0x0010(0x0010)(Parm, OutParm)
	struct FHitResult                             OutHitResult;                                      // 0x0020(0x009C)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                LocalVelocity;                                     // 0x00BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalLocation;                                     // 0x00C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        LocalPawn;                                         // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_CalculateProjectileTrajectorySplineWithHit_OutHitResult; // 0x0108(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplinePoints; // 0x01A8(0x0010)(ReferenceParm)
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplineTangents; // 0x01B8(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutHitResult; // 0x01C8(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutSplinePoints; // 0x0268(0x0010)(ReferenceParm)
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutSplineTangents; // 0x0278(0x0010)(ReferenceParm)
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn;              // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSpawnLocationAndRotation_Location;     // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSpawnLocationAndRotation_Rotation;     // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileTrajectoryPoints) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileTrajectoryPoints");
static_assert(sizeof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileTrajectoryPoints) == 0x0002C0, "Wrong size on GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileTrajectoryPoints");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileTrajectoryPoints, OutSplinePoints) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileTrajectoryPoints::OutSplinePoints' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileTrajectoryPoints, OutSplineTangents) == 0x000010, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileTrajectoryPoints::OutSplineTangents' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileTrajectoryPoints, OutHitResult) == 0x000020, "Member 'GA_Athena_Consumable_Throw_Secondary_Parent_C_GetProjectileTrajectoryPoints::OutHitResult' has a wrong offset!");
