#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_EnvCampFire

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.Cancelled_54C862474620655A47CEAFABF8570B89
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_EnvCampFire_C_Cancelled_54C862474620655A47CEAFABF8570B89 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_Cancelled_54C862474620655A47CEAFABF8570B89) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_Cancelled_54C862474620655A47CEAFABF8570B89");
static_assert(sizeof(GA_Athena_EnvCampFire_C_Cancelled_54C862474620655A47CEAFABF8570B89) == 0x000030, "Wrong size on GA_Athena_EnvCampFire_C_Cancelled_54C862474620655A47CEAFABF8570B89");
static_assert(offsetof(GA_Athena_EnvCampFire_C_Cancelled_54C862474620655A47CEAFABF8570B89, TargetData) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_Cancelled_54C862474620655A47CEAFABF8570B89::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_Cancelled_54C862474620655A47CEAFABF8570B89, ApplicationTag) == 0x000028, "Member 'GA_Athena_EnvCampFire_C_Cancelled_54C862474620655A47CEAFABF8570B89::ApplicationTag' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.Cancelled_EDAB937443020D47385625B06E892DF0
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0");
static_assert(sizeof(GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0) == 0x000030, "Wrong size on GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0");
static_assert(offsetof(GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0, TargetData) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0, ApplicationTag) == 0x000028, "Member 'GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0::ApplicationTag' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.Cancelled_FA21AF3D4B3CDB44816F37A74E520B7C
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_EnvCampFire_C_Cancelled_FA21AF3D4B3CDB44816F37A74E520B7C final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_Cancelled_FA21AF3D4B3CDB44816F37A74E520B7C) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_Cancelled_FA21AF3D4B3CDB44816F37A74E520B7C");
static_assert(sizeof(GA_Athena_EnvCampFire_C_Cancelled_FA21AF3D4B3CDB44816F37A74E520B7C) == 0x000030, "Wrong size on GA_Athena_EnvCampFire_C_Cancelled_FA21AF3D4B3CDB44816F37A74E520B7C");
static_assert(offsetof(GA_Athena_EnvCampFire_C_Cancelled_FA21AF3D4B3CDB44816F37A74E520B7C, TargetData) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_Cancelled_FA21AF3D4B3CDB44816F37A74E520B7C::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_Cancelled_FA21AF3D4B3CDB44816F37A74E520B7C, ApplicationTag) == 0x000028, "Member 'GA_Athena_EnvCampFire_C_Cancelled_FA21AF3D4B3CDB44816F37A74E520B7C::ApplicationTag' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4");
static_assert(sizeof(GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4) == 0x0000B0, "Wrong size on GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4");
static_assert(offsetof(GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4, Payload) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4::Payload' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.ExecuteUbergraph_GA_Athena_EnvCampFire
// 0x0618 (0x0618 - 0x0000)
struct GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_3;                   // 0x0018(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_3;               // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0058(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x00A0(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x00F8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0128(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_3;                            // 0x0170(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue_1; // 0x0198(0x0010)(ConstParm, ReferenceParm)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue_1;        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_5;                   // 0x0200(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_5;               // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Temp_struct_Variable_4;                            // 0x0230(0x00B0)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x02E8(0x00B0)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0398(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x03B0(0x00B0)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_BGA_Athena_EnvCampFire_C*            K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire;   // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsStoked;                       // 0x047B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x047C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_BGA_Athena_EnvCampFire_C*            K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_1; // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x04A4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x04C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue_2;        // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_5;                            // 0x04E0(0x0028)()
	TArray<class AActor*>                         CallFunc_GetAllActorsFromTargetData_ReturnValue;   // 0x0508(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_BGA_Athena_EnvCampFire_C*            K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_2; // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0538(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_6;                            // 0x0568(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue_2; // 0x0578(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0588(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0598(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x05A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_BGA_Athena_EnvCampFire_C*            K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_3; // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_4;                   // 0x05D0(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_4;               // 0x05F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0600(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0610(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire");
static_assert(sizeof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire) == 0x000618, "Wrong size on GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, EntryPoint) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_TargetData_3) == 0x000018, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_TargetData_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_ApplicationTag_3) == 0x000040, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_ApplicationTag_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_TargetData_2) == 0x000058, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_ApplicationTag_2) == 0x000080, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_struct_Variable) == 0x000098, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_struct_Variable_1) == 0x0000A0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x0000C8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_WaitTargetSelection_ReturnValue) == 0x0000D8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_TargetData_1) == 0x0000F8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_ApplicationTag_1) == 0x000120, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_TargetData) == 0x000128, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_ApplicationTag) == 0x000150, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_4) == 0x000158, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_struct_Variable_2) == 0x000168, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_struct_Variable_3) == 0x000170, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_ApplyGameplayEffectContainer_ReturnValue_1) == 0x000198, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_ApplyGameplayEffectContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_WaitTargetSelection_ReturnValue_1) == 0x0001A8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_WaitTargetSelection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_IsValid_ReturnValue_1) == 0x0001B0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_int_Array_Index_Variable) == 0x0001B4, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Conv_IntToString_ReturnValue) == 0x0001B8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Concat_StrStr_ReturnValue) == 0x0001C8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001D8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_Event_bWasCancelled) == 0x0001E8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_int_Loop_Counter_Variable) == 0x0001EC, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0001F0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_IsValid_ReturnValue_2) == 0x0001F8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Add_IntInt_ReturnValue) == 0x0001FC, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_TargetData_5) == 0x000200, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_TargetData_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_ApplicationTag_5) == 0x000228, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_ApplicationTag_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_struct_Variable_4) == 0x000230, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002E0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_Event_EventData) == 0x0002E8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_5) == 0x000398, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0003A8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_Payload) == 0x0003B0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000460, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_int_Variable) == 0x000468, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire) == 0x000470, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_bSuccess) == 0x000478, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000479, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_IsValid_ReturnValue_3) == 0x00047A, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_IsStoked) == 0x00047B, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_IsStoked' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_6) == 0x00047C, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000490, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_1) == 0x000498, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_bSuccess_1) == 0x0004A0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_7) == 0x0004A4, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_IsValid_ReturnValue_4) == 0x0004B4, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetValueAtLevel_ReturnValue) == 0x0004B8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0004C0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0004C8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_WaitTargetSelection_ReturnValue_2) == 0x0004D0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_WaitTargetSelection_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_IsValid_ReturnValue_5) == 0x0004D8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_struct_Variable_5) == 0x0004E0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetAllActorsFromTargetData_ReturnValue) == 0x000508, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetAllActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000518, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Array_Get_Item) == 0x000520, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_2) == 0x000528, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_bSuccess_2) == 0x000530, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetDisplayName_ReturnValue) == 0x000538, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Array_Length_ReturnValue) == 0x000548, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000550, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Less_IntInt_ReturnValue) == 0x000560, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Array_Length_ReturnValue_1) == 0x000564, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_struct_Variable_6) == 0x000568, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000570, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_ApplyGameplayEffectContainer_ReturnValue_2) == 0x000578, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_ApplyGameplayEffectContainer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000588, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000598, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0005A8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3) == 0x0005B8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_3) == 0x0005C0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_bSuccess_3) == 0x0005C8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_TargetData_4) == 0x0005D0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_TargetData_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_ApplicationTag_4) == 0x0005F8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_ApplicationTag_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_8) == 0x000600, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000610, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_EnvCampFire_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_EnvCampFire_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_EnvCampFire_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_EnvCampFire_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_EnvCampFire_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.SetBalanceValues
// 0x0040 (0x0040 - 0x0000)
struct GA_Athena_EnvCampFire_C_SetBalanceValues final
{
public:
	bool                                          Stoke;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_SetBalanceValues) == 0x000004, "Wrong alignment on GA_Athena_EnvCampFire_C_SetBalanceValues");
static_assert(sizeof(GA_Athena_EnvCampFire_C_SetBalanceValues) == 0x000040, "Wrong size on GA_Athena_EnvCampFire_C_SetBalanceValues");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, Stoke) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::Stoke' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000008, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x00000C, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000010, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x000018, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x000020, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_FTrunc_ReturnValue) == 0x00002C, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_6) == 0x000034, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_FTrunc_ReturnValue_1) == 0x000038, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_SelectInt_ReturnValue) == 0x00003C, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.SetCustomTargetingTrans
// 0x0070 (0x0070 - 0x0000)
struct GA_Athena_EnvCampFire_C_SetCustomTargetingTrans final
{
public:
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans) == 0x000010, "Wrong alignment on GA_Athena_EnvCampFire_C_SetCustomTargetingTrans");
static_assert(sizeof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans) == 0x000070, "Wrong size on GA_Athena_EnvCampFire_C_SetCustomTargetingTrans");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000014, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_BreakVector_X) == 0x000020, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_BreakVector_Y) == 0x000024, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_BreakVector_Z) == 0x000028, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.SetIsStoked
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_EnvCampFire_C_SetIsStoked final
{
public:
	bool                                          IsStoked_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_SetIsStoked) == 0x000001, "Wrong alignment on GA_Athena_EnvCampFire_C_SetIsStoked");
static_assert(sizeof(GA_Athena_EnvCampFire_C_SetIsStoked) == 0x000001, "Wrong size on GA_Athena_EnvCampFire_C_SetIsStoked");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetIsStoked, IsStoked_0) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_SetIsStoked::IsStoked_0' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.Targeted_54C862474620655A47CEAFABF8570B89
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_EnvCampFire_C_Targeted_54C862474620655A47CEAFABF8570B89 final
{
public:
