#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Consumable_Throw_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C
// 0x03B0 (0x0E58 - 0x0AA8)
class UGA_Athena_Consumable_Throw_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbilityKeyPressed;                                 // 0x0AB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InThrowWindup;                                     // 0x0AB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ABA[0x2];                                      // 0x0ABA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdditionalThrowAngle;                              // 0x0ABC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTossPitch;                                      // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GrenadeTargetingOriginOffset;                      // 0x0AC4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GrenadeTargetingOriginOffset_Crouched;             // 0x0AD0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ADC[0x4];                                      // 0x0ADC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    SpawnedProjectile;                                 // 0x0AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Proj_ThrownProjectile;                             // 0x0AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ProjectileSpeed;                                   // 0x0AF0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ProjectileGravityScale;                            // 0x0B18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         TrajectoryUpdateInterval;                          // 0x0B40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B44[0x4];                                      // 0x0B44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CookMonage;                                        // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ThrowMontage;                                      // 0x0B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_OnThrow;                                        // 0x0B58(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileTrajectory_C*             TrajectoryIndicator;                               // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TrajectoryIndicatorClass;                          // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyMaxSpeed;                                     // 0x0B70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyGravity;                                      // 0x0B74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyExtent;                                       // 0x0B78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyTimeStep;                                     // 0x0B7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TrajectoryCollisionProfileName;                    // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_CookLoop;                                       // 0x0B88(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_InWindup;                                       // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GrenadeTargetingOriginOffsetWater;                 // 0x0B98(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Handle_GE_InWindup;                                // 0x0BA4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EC_DefaultExplosion;                               // 0x0BAC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ExplosionEffectLevel;                              // 0x0BB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainerSpec       ExplosionEffectContainerSpec;                      // 0x0BB8(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SpawnedOnEquip;                                    // 0x0C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C71[0x3];                                      // 0x0C71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           EC_DefaultHit;                                     // 0x0C74(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         HitEffectLevel;                                    // 0x0C7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainerSpec       HitEffectContainerSpec;                            // 0x0C80(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnProjectileSpawn;                                 // 0x0D38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasAdditionalExplosion;                            // 0x0D48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D49[0x3];                                      // 0x0D49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           EC_AdditionalExplosion;                            // 0x0D4C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         AdditionalExplodeLevel;                            // 0x0D54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainerSpec       AdditionalContainerSpec;                           // 0x0D58(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  QuestCreditTargetTag;                              // 0x0E10(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	int32                                         DummyMaxSteps;                                     // 0x0E30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnPhysicalMaterial;                            // 0x0E34(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E35[0x3];                                      // 0x0E35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Tags_UseNullFailedActivateReason;                  // 0x0E38(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddCookGC();
	void AttemptSpawnThrownProjectile();
	void Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void CleanupTrajectory();
	void CleanupTrajectoryIndicatorOnUnequip();
	void Completed_01C5B37D48E3DC6F82DDC58640CE2A27(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent(int32 EntryPoint);
	void GetProjectileInitialGravityScaleToUse(float* GravityScaleToUse);
	void GetProjectileInitialSpeedToUse(float* ProjectileSpeedToUse);
	void GetProjectileTrajectoryPoints(TArray<struct FVector>* OutSplinePoints, TArray<struct FVector>* OutSplineTangents, struct FHitResult* OutHitResult);
	void InitTrajectoryVariables();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_OverrideFailedReason(const struct FGameplayTagContainer& FailedReason, struct FGameplayTagContainer* OverridenFailedReason);
	void OnBlendOut_D89CCB8E47DB19D6DCF41F96F207CC3D();
	void OnCancelled_D89CCB8E47DB19D6DCF41F96F207CC3D();
	void OnCompleted_D89CCB8E47DB19D6DCF41F96F207CC3D();
	void OnFinish_96367E244486362FDDE5ED87D909C17B();
	void OnInterrupted_D89CCB8E47DB19D6DCF41F96F207CC3D();
	void OnProjectileSetup();
	void OnProjectileSpawned(class AFortProjectileBase* SpawnedProjectile_0);
	void OnRelease_76BCD7D74FEC0FB6EFBBDFB57A0107B0(float TimeHeld);
	void PostThrowCleanup();
	void PrethrowSetup();
	void RemoveCookGC();
	void SetupDummyProjectile();
	void SpawnThrownProjectile(class UClass* ProjectileClass_0, const struct FVector& ProjectileSpawnLocation, const struct FRotator& ProjectileSpawnDirection, const struct FFortGameplayEffectContainerSpec& HitEffectContainerSpec_0, const struct FFortGameplayEffectContainerSpec& ExplosionEffectContainerSpec_0, float ProjectileInitialSpeed, float ProjectileGravityScale_0, class AFortProjectileBase** SpawnedProjectile_0);
	class AFortProjectileTrajectory* SpawnTrajectoryIndicator(bool bSpawnOnEquip);
	void ThrowMontageStarted();
	void ThrowProjectile();
	void Triggered_01C5B37D48E3DC6F82DDC58640CE2A27(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void UpdateTrajectory();
	void UpdateTrajectorySpline();

	void GetOwningPlayer(class AFortPlayerPawn** Player_Pawn) const;
	void GetProjectileAdditionalThrowAngleToUse(float* AdditionalThrowAngleToUse) const;
	TSubclassOf<class AFortProjectileTrajectory> GetProjectileTrajectoryActor() const;
	void GetSpawnLocationAndRotation(struct FVector* Location, struct FRotator* Rotation) const;
	bool ShouldOnlyShowTrajectoryOnUse() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Consumable_Throw_Parent_C">();
	}
	static class UGA_Athena_Consumable_Throw_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Consumable_Throw_Parent_C>();
	}
};
static_assert(alignof(UGA_Athena_Consumable_Throw_Parent_C) == 0x000008, "Wrong alignment on UGA_Athena_Consumable_Throw_Parent_C");
static_assert(sizeof(UGA_Athena_Consumable_Throw_Parent_C) == 0x000E58, "Wrong size on UGA_Athena_Consumable_Throw_Parent_C");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_Athena_Consumable_Throw_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, PlayerPawn) == 0x000AB0, "Member 'UGA_Athena_Consumable_Throw_Parent_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, AbilityKeyPressed) == 0x000AB8, "Member 'UGA_Athena_Consumable_Throw_Parent_C::AbilityKeyPressed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, InThrowWindup) == 0x000AB9, "Member 'UGA_Athena_Consumable_Throw_Parent_C::InThrowWindup' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, AdditionalThrowAngle) == 0x000ABC, "Member 'UGA_Athena_Consumable_Throw_Parent_C::AdditionalThrowAngle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, MaxTossPitch) == 0x000AC0, "Member 'UGA_Athena_Consumable_Throw_Parent_C::MaxTossPitch' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, GrenadeTargetingOriginOffset) == 0x000AC4, "Member 'UGA_Athena_Consumable_Throw_Parent_C::GrenadeTargetingOriginOffset' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, GrenadeTargetingOriginOffset_Crouched) == 0x000AD0, "Member 'UGA_Athena_Consumable_Throw_Parent_C::GrenadeTargetingOriginOffset_Crouched' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, SpawnedProjectile) == 0x000AE0, "Member 'UGA_Athena_Consumable_Throw_Parent_C::SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, Proj_ThrownProjectile) == 0x000AE8, "Member 'UGA_Athena_Consumable_Throw_Parent_C::Proj_ThrownProjectile' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, ProjectileSpeed) == 0x000AF0, "Member 'UGA_Athena_Consumable_Throw_Parent_C::ProjectileSpeed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, ProjectileGravityScale) == 0x000B18, "Member 'UGA_Athena_Consumable_Throw_Parent_C::ProjectileGravityScale' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, TrajectoryUpdateInterval) == 0x000B40, "Member 'UGA_Athena_Consumable_Throw_Parent_C::TrajectoryUpdateInterval' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, CookMonage) == 0x000B48, "Member 'UGA_Athena_Consumable_Throw_Parent_C::CookMonage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, ThrowMontage) == 0x000B50, "Member 'UGA_Athena_Consumable_Throw_Parent_C::ThrowMontage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, GC_OnThrow) == 0x000B58, "Member 'UGA_Athena_Consumable_Throw_Parent_C::GC_OnThrow' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, TrajectoryIndicator) == 0x000B60, "Member 'UGA_Athena_Consumable_Throw_Parent_C::TrajectoryIndicator' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, TrajectoryIndicatorClass) == 0x000B68, "Member 'UGA_Athena_Consumable_Throw_Parent_C::TrajectoryIndicatorClass' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, DummyMaxSpeed) == 0x000B70, "Member 'UGA_Athena_Consumable_Throw_Parent_C::DummyMaxSpeed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, DummyGravity) == 0x000B74, "Member 'UGA_Athena_Consumable_Throw_Parent_C::DummyGravity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, DummyExtent) == 0x000B78, "Member 'UGA_Athena_Consumable_Throw_Parent_C::DummyExtent' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, DummyTimeStep) == 0x000B7C, "Member 'UGA_Athena_Consumable_Throw_Parent_C::DummyTimeStep' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, TrajectoryCollisionProfileName) == 0x000B80, "Member 'UGA_Athena_Consumable_Throw_Parent_C::TrajectoryCollisionProfileName' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, GC_CookLoop) == 0x000B88, "Member 'UGA_Athena_Consumable_Throw_Parent_C::GC_CookLoop' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, GE_InWindup) == 0x000B90, "Member 'UGA_Athena_Consumable_Throw_Parent_C::GE_InWindup' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, GrenadeTargetingOriginOffsetWater) == 0x000B98, "Member 'UGA_Athena_Consumable_Throw_Parent_C::GrenadeTargetingOriginOffsetWater' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, Handle_GE_InWindup) == 0x000BA4, "Member 'UGA_Athena_Consumable_Throw_Parent_C::Handle_GE_InWindup' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, EC_DefaultExplosion) == 0x000BAC, "Member 'UGA_Athena_Consumable_Throw_Parent_C::EC_DefaultExplosion' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, ExplosionEffectLevel) == 0x000BB4, "Member 'UGA_Athena_Consumable_Throw_Parent_C::ExplosionEffectLevel' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, ExplosionEffectContainerSpec) == 0x000BB8, "Member 'UGA_Athena_Consumable_Throw_Parent_C::ExplosionEffectContainerSpec' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, SpawnedOnEquip) == 0x000C70, "Member 'UGA_Athena_Consumable_Throw_Parent_C::SpawnedOnEquip' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, EC_DefaultHit) == 0x000C74, "Member 'UGA_Athena_Consumable_Throw_Parent_C::EC_DefaultHit' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, HitEffectLevel) == 0x000C7C, "Member 'UGA_Athena_Consumable_Throw_Parent_C::HitEffectLevel' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, HitEffectContainerSpec) == 0x000C80, "Member 'UGA_Athena_Consumable_Throw_Parent_C::HitEffectContainerSpec' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, OnProjectileSpawn) == 0x000D38, "Member 'UGA_Athena_Consumable_Throw_Parent_C::OnProjectileSpawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, HasAdditionalExplosion) == 0x000D48, "Member 'UGA_Athena_Consumable_Throw_Parent_C::HasAdditionalExplosion' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, EC_AdditionalExplosion) == 0x000D4C, "Member 'UGA_Athena_Consumable_Throw_Parent_C::EC_AdditionalExplosion' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, AdditionalExplodeLevel) == 0x000D54, "Member 'UGA_Athena_Consumable_Throw_Parent_C::AdditionalExplodeLevel' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, AdditionalContainerSpec) == 0x000D58, "Member 'UGA_Athena_Consumable_Throw_Parent_C::AdditionalContainerSpec' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, QuestCreditTargetTag) == 0x000E10, "Member 'UGA_Athena_Consumable_Throw_Parent_C::QuestCreditTargetTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, DummyMaxSteps) == 0x000E30, "Member 'UGA_Athena_Consumable_Throw_Parent_C::DummyMaxSteps' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, ReturnPhysicalMaterial) == 0x000E34, "Member 'UGA_Athena_Consumable_Throw_Parent_C::ReturnPhysicalMaterial' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_Throw_Parent_C, Tags_UseNullFailedActivateReason) == 0x000E38, "Member 'UGA_Athena_Consumable_Throw_Parent_C::Tags_UseNullFailedActivateReason' has a wrong offset!");

}

