#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_HealSpray_Primary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GA_Athena_MedConsumable_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_HealSpray_Primary.GA_Athena_HealSpray_Primary_C
// 0x00F8 (0x0D68 - 0x0C70)
class UGA_Athena_HealSpray_Primary_C final : public UGA_Athena_MedConsumable_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_HealSpray_Primary_C;      // 0x0C70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  Tags_PreventActivation;                            // 0x0C78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   MontageSection_Outro;                              // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_MaxDuration;                                   // 0x0CA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           Handle_FailsafeTimer;                              // 0x0CC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_MontageIntroDuration;                          // 0x0CD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Tag_GC_SprayLoop;                                  // 0x0CF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_OutOfAmmo;                                   // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_DiscardWeapon;                             // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_AmmoChanged;                                   // 0x0D10(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_HealCapPct;                                    // 0x0D18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  Tag_FailedToActivateDueToHealthThreshold;          // 0x0D40(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         HealthCheckPrecision;                              // 0x0D60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AmmoChangedEvent();
	void ApplyGCAfterMontageIntroDelay();
	void CallEndAbility();
	void EnableRelease();
	void ExecuteUbergraph_GA_Athena_HealSpray_Primary(int32 EntryPoint);
	void FailsafeTimer();
	void K2_ActivateAbility();
	void K2_CommitExecute();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_OverrideFailedReason(const struct FGameplayTagContainer& FailedReason, struct FGameplayTagContainer* OverridenFailedReason);
	void MakeCustomMontageInfo();
	void MontageTriggeredPreCommit();
	void OnAbilityInputReleased();
	void OnHealthChanged();
	void OnMontageTriggeredPostCommitSuccess();
	void OnMontageTriggeredPreCommit();

	void CheckHealthThreshold(bool* ValidCheck, bool* IsUnderHealthThreshold) const;
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_HealSpray_Primary_C">();
	}
	static class UGA_Athena_HealSpray_Primary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_HealSpray_Primary_C>();
	}
};
static_assert(alignof(UGA_Athena_HealSpray_Primary_C) == 0x000008, "Wrong alignment on UGA_Athena_HealSpray_Primary_C");
static_assert(sizeof(UGA_Athena_HealSpray_Primary_C) == 0x000D68, "Wrong size on UGA_Athena_HealSpray_Primary_C");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, UberGraphFrame_GA_Athena_HealSpray_Primary_C) == 0x000C70, "Member 'UGA_Athena_HealSpray_Primary_C::UberGraphFrame_GA_Athena_HealSpray_Primary_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, Tags_PreventActivation) == 0x000C78, "Member 'UGA_Athena_HealSpray_Primary_C::Tags_PreventActivation' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, MontageSection_Outro) == 0x000C98, "Member 'UGA_Athena_HealSpray_Primary_C::MontageSection_Outro' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, Row_MaxDuration) == 0x000CA0, "Member 'UGA_Athena_HealSpray_Primary_C::Row_MaxDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, Handle_FailsafeTimer) == 0x000CC8, "Member 'UGA_Athena_HealSpray_Primary_C::Handle_FailsafeTimer' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, Row_MontageIntroDuration) == 0x000CD0, "Member 'UGA_Athena_HealSpray_Primary_C::Row_MontageIntroDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, Tag_GC_SprayLoop) == 0x000CF8, "Member 'UGA_Athena_HealSpray_Primary_C::Tag_GC_SprayLoop' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, Sound_OutOfAmmo) == 0x000D00, "Member 'UGA_Athena_HealSpray_Primary_C::Sound_OutOfAmmo' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, Montage_DiscardWeapon) == 0x000D08, "Member 'UGA_Athena_HealSpray_Primary_C::Montage_DiscardWeapon' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, Tag_AmmoChanged) == 0x000D10, "Member 'UGA_Athena_HealSpray_Primary_C::Tag_AmmoChanged' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, Row_HealCapPct) == 0x000D18, "Member 'UGA_Athena_HealSpray_Primary_C::Row_HealCapPct' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, Tag_FailedToActivateDueToHealthThreshold) == 0x000D40, "Member 'UGA_Athena_HealSpray_Primary_C::Tag_FailedToActivateDueToHealthThreshold' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HealSpray_Primary_C, HealthCheckPrecision) == 0x000D60, "Member 'UGA_Athena_HealSpray_Primary_C::HealthCheckPrecision' has a wrong offset!");

}

