#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ranged_HopRockDualies

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_Ranged_GenericDamage_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Ranged_HopRockDualies.GA_Ranged_HopRockDualies_C
// 0x0018 (0x0B08 - 0x0AF0)
class UGA_Ranged_HopRockDualies_C final : public UGA_Ranged_GenericDamage_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Shots;                                             // 0x0AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShotsForEffect;                                    // 0x0AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CrushGCN;                                          // 0x0B00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Ranged_HopRockDualies(int32 EntryPoint);
	void K2_CommitExecute();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Ranged_HopRockDualies_C">();
	}
	static class UGA_Ranged_HopRockDualies_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Ranged_HopRockDualies_C>();
	}
};
static_assert(alignof(UGA_Ranged_HopRockDualies_C) == 0x000008, "Wrong alignment on UGA_Ranged_HopRockDualies_C");
static_assert(sizeof(UGA_Ranged_HopRockDualies_C) == 0x000B08, "Wrong size on UGA_Ranged_HopRockDualies_C");
static_assert(offsetof(UGA_Ranged_HopRockDualies_C, UberGraphFrame) == 0x000AF0, "Member 'UGA_Ranged_HopRockDualies_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Ranged_HopRockDualies_C, Shots) == 0x000AF8, "Member 'UGA_Ranged_HopRockDualies_C::Shots' has a wrong offset!");
static_assert(offsetof(UGA_Ranged_HopRockDualies_C, ShotsForEffect) == 0x000AFC, "Member 'UGA_Ranged_HopRockDualies_C::ShotsForEffect' has a wrong offset!");
static_assert(offsetof(UGA_Ranged_HopRockDualies_C, CrushGCN) == 0x000B00, "Member 'UGA_Ranged_HopRockDualies_C::CrushGCN' has a wrong offset!");

}

