#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Shotgun_DoubleDouble_Knockback

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Shotgun_DoubleDouble_Knockback.GA_Shotgun_DoubleDouble_Knockback_C
// 0x0148 (0x0BF0 - 0x0AA8)
class UGA_Shotgun_DoubleDouble_Knockback_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Distance;                                          // 0x0AB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceMagMod;                                    // 0x0AB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_ZAdd;                                          // 0x0AB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_KnockMag;                                      // 0x0AE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MaxDistance;                                   // 0x0B08(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ResetFall;                                     // 0x0B30(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                FinalLaunchVel;                                    // 0x0B58(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B64[0x4];                                      // 0x0B64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_ZStartOffset;                                  // 0x0B68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ZVelMult;                                      // 0x0B90(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  DefaultTags;                                       // 0x0BB8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 Launcher;                                          // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityForFX;                                     // 0x0BE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FX_Delay;                                          // 0x0BE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           KnockbackCue;                                      // 0x0BE8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckVel();
	void ExecuteUbergraph_GA_Shotgun_DoubleDouble_Knockback(int32 EntryPoint);
	void K2_ActivateAbility();
	void KnockPlayer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Shotgun_DoubleDouble_Knockback_C">();
	}
	static class UGA_Shotgun_DoubleDouble_Knockback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Shotgun_DoubleDouble_Knockback_C>();
	}
};
static_assert(alignof(UGA_Shotgun_DoubleDouble_Knockback_C) == 0x000008, "Wrong alignment on UGA_Shotgun_DoubleDouble_Knockback_C");
static_assert(sizeof(UGA_Shotgun_DoubleDouble_Knockback_C) == 0x000BF0, "Wrong size on UGA_Shotgun_DoubleDouble_Knockback_C");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Distance) == 0x000AB0, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Distance' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, DistanceMagMod) == 0x000AB4, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::DistanceMagMod' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_ZAdd) == 0x000AB8, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_ZAdd' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_KnockMag) == 0x000AE0, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_KnockMag' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_MaxDistance) == 0x000B08, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_MaxDistance' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_ResetFall) == 0x000B30, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_ResetFall' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, FinalLaunchVel) == 0x000B58, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::FinalLaunchVel' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_ZStartOffset) == 0x000B68, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_ZStartOffset' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_ZVelMult) == 0x000B90, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_ZVelMult' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, DefaultTags) == 0x000BB8, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::DefaultTags' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Launcher) == 0x000BD8, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Launcher' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, VelocityForFX) == 0x000BE0, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::VelocityForFX' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, FX_Delay) == 0x000BE4, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::FX_Delay' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, KnockbackCue) == 0x000BE8, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::KnockbackCue' has a wrong offset!");

}

