#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ShieldGenerator_ShieldHealPassive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ShieldGenerator_ShieldHealPassive.GA_ShieldGenerator_ShieldHealPassive_C
// 0x0050 (0x0AF8 - 0x0AA8)
class UGA_ShieldGenerator_ShieldHealPassive_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPawn*                              Pawn;                                              // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  QuestSourceTags;                                   // 0x0AB8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  QuestTargetTags;                                   // 0x0AD8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_ShieldGenerator_ShieldHealPassive(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_ShieldGenerator_ShieldHealPassive_C">();
	}
	static class UGA_ShieldGenerator_ShieldHealPassive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ShieldGenerator_ShieldHealPassive_C>();
	}
};
static_assert(alignof(UGA_ShieldGenerator_ShieldHealPassive_C) == 0x000008, "Wrong alignment on UGA_ShieldGenerator_ShieldHealPassive_C");
static_assert(sizeof(UGA_ShieldGenerator_ShieldHealPassive_C) == 0x000AF8, "Wrong size on UGA_ShieldGenerator_ShieldHealPassive_C");
static_assert(offsetof(UGA_ShieldGenerator_ShieldHealPassive_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_ShieldGenerator_ShieldHealPassive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_ShieldGenerator_ShieldHealPassive_C, Pawn) == 0x000AB0, "Member 'UGA_ShieldGenerator_ShieldHealPassive_C::Pawn' has a wrong offset!");
static_assert(offsetof(UGA_ShieldGenerator_ShieldHealPassive_C, QuestSourceTags) == 0x000AB8, "Member 'UGA_ShieldGenerator_ShieldHealPassive_C::QuestSourceTags' has a wrong offset!");
static_assert(offsetof(UGA_ShieldGenerator_ShieldHealPassive_C, QuestTargetTags) == 0x000AD8, "Member 'UGA_ShieldGenerator_ShieldHealPassive_C::QuestTargetTags' has a wrong offset!");

}

