#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_WestSausage_InSwingingMovementMode

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_WestSausage_InSwingingMovementMode.GA_WestSausage_InSwingingMovementMode_C.ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode
// 0x0170 (0x0170 - 0x0000)
struct GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0048)(ContainsInstancedReference)
	class UCameraModifier_WestSausage_C*          K2Node_DynamicCast_AsCamera_Modifier_West_Sausage; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Ranged_WestSausage_Parallel_Athena_C* K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraModifier*                        CallFunc_AddNewCameraModifier_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraModifier_WestSausage_C*          K2Node_DynamicCast_AsCamera_Modifier_West_Sausage_1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue_1;               // 0x00A0(0x0048)(ContainsInstancedReference)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue_2;               // 0x00F0(0x0048)(ContainsInstancedReference)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena_1;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Ranged_WestSausage_Parallel_Athena_C* K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_1; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraModifier*                        CallFunc_FindCameraModifierByClass_ReturnValue;    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode) == 0x000008, "Wrong alignment on GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode");
static_assert(sizeof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode) == 0x000170, "Wrong size on GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, EntryPoint) == 0x000000, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_AsCamera_Modifier_West_Sausage) == 0x000050, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_AsCamera_Modifier_West_Sausage' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000060, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000070, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena) == 0x000078, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, CallFunc_AddNewCameraModifier_ReturnValue) == 0x000088, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::CallFunc_AddNewCameraModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_AsCamera_Modifier_West_Sausage_1) == 0x000090, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_AsCamera_Modifier_West_Sausage_1' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_bSuccess_3) == 0x000098, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, CallFunc_GetActorInfo_ReturnValue_1) == 0x0000A0, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::CallFunc_GetActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_Event_bWasCancelled) == 0x0000E8, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, CallFunc_GetActorInfo_ReturnValue_2) == 0x0000F0, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::CallFunc_GetActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_AsPlayer_Pawn_Athena_1) == 0x000138, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_AsPlayer_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_bSuccess_4) == 0x000140, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x000148, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_1) == 0x000150, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena_1' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, K2Node_DynamicCast_bSuccess_5) == 0x000158, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, CallFunc_FindCameraModifierByClass_ReturnValue) == 0x000160, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::CallFunc_FindCameraModifierByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode, CallFunc_IsValid_ReturnValue) == 0x000168, "Member 'GA_WestSausage_InSwingingMovementMode_C_ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_WestSausage_InSwingingMovementMode.GA_WestSausage_InSwingingMovementMode_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_WestSausage_InSwingingMovementMode_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WestSausage_InSwingingMovementMode_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_WestSausage_InSwingingMovementMode_C_K2_OnEndAbility");
static_assert(sizeof(GA_WestSausage_InSwingingMovementMode_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_WestSausage_InSwingingMovementMode_C_K2_OnEndAbility");
static_assert(offsetof(GA_WestSausage_InSwingingMovementMode_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_WestSausage_InSwingingMovementMode_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

