#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_VictoryCrown_Flare

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_VictoryCrown_Flare.GCN_Athena_VictoryCrown_Flare_C.GetSoundIndicatorMaxDistance
// 0x0008 (0x0008 - 0x0000)
struct GCN_Athena_VictoryCrown_Flare_C_GetSoundIndicatorMaxDistance final
{
public:
	float                                         MaxDistance;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_VictoryCrown_Flare_C_GetSoundIndicatorMaxDistance) == 0x000004, "Wrong alignment on GCN_Athena_VictoryCrown_Flare_C_GetSoundIndicatorMaxDistance");
static_assert(sizeof(GCN_Athena_VictoryCrown_Flare_C_GetSoundIndicatorMaxDistance) == 0x000008, "Wrong size on GCN_Athena_VictoryCrown_Flare_C_GetSoundIndicatorMaxDistance");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_GetSoundIndicatorMaxDistance, MaxDistance) == 0x000000, "Member 'GCN_Athena_VictoryCrown_Flare_C_GetSoundIndicatorMaxDistance::MaxDistance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_GetSoundIndicatorMaxDistance, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000004, "Member 'GCN_Athena_VictoryCrown_Flare_C_GetSoundIndicatorMaxDistance::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function GCN_Athena_VictoryCrown_Flare.GCN_Athena_VictoryCrown_Flare_C.OnBurstGeneric
// 0x0138 (0x0138 - 0x0000)
struct GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSoundIndicatorMaxDistance_MaxDistance; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric) == 0x000008, "Wrong alignment on GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric");
static_assert(sizeof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric) == 0x000138, "Wrong size on GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, MyTarget) == 0x000000, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, Parameters) == 0x000008, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, ParticleComponents) == 0x0000C8, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, AudioComponents) == 0x0000D8, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, CallFunc_GetSoundIndicatorMaxDistance_MaxDistance) == 0x0000F8, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::CallFunc_GetSoundIndicatorMaxDistance_MaxDistance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000FC, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, CallFunc_GetActorTeam_ReturnValue) == 0x000108, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000110, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, K2Node_MakeArray_Array) == 0x000118, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric, K2Node_MakeArray_Array_1) == 0x000128, "Member 'GCN_Athena_VictoryCrown_Flare_C_OnBurstGeneric::K2Node_MakeArray_Array_1' has a wrong offset!");

}

