#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_GrenadeLauncher_EnterWater

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_GrenadeLauncher_EnterWater.GCN_Athena_GrenadeLauncher_EnterWater_C.OnBurstNiagara
// 0x0110 (0x0110 - 0x0000)
struct GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System_Component; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara) == 0x000008, "Wrong alignment on GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara");
static_assert(sizeof(GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara) == 0x000110, "Wrong size on GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara");
static_assert(offsetof(GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara, MyTarget) == 0x000000, "Member 'GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara, Parameters) == 0x000008, "Member 'GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara, ParticleComponents) == 0x0000C8, "Member 'GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara, AudioComponents) == 0x0000D8, "Member 'GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara, K2Node_DynamicCast_AsNiagara_Particle_System_Component) == 0x000100, "Member 'GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara::K2Node_DynamicCast_AsNiagara_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCN_Athena_GrenadeLauncher_EnterWater_C_OnBurstNiagara::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

