#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_ChillBronco_Explode

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_ChillBronco_Explode.GCN_Athena_ChillBronco_Explode_C.ExecuteUbergraph_GCN_Athena_ChillBronco_Explode
// 0x0148 (0x0148 - 0x0000)
struct GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x00D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         Temp_object_Variable;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         Temp_object_Variable_1;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNiagaraFXTypeEnabled_ReturnValue;       // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         K2Node_Select_Default;                             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode) == 0x000008, "Wrong alignment on GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode");
static_assert(sizeof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode) == 0x000148, "Wrong size on GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, EntryPoint) == 0x000000, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_MyTarget) == 0x000008, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_Parameters) == 0x000010, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_ParticleComponents) == 0x0000D0, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_AudioComponents) == 0x0000E0, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_BurstCameraShakeInstance) == 0x0000F0, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_BurstDecalInstance) == 0x0000F8, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000100, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, Temp_object_Variable) == 0x000108, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, Temp_object_Variable_1) == 0x000110, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000118, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000124, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, Temp_bool_Variable) == 0x000130, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, CallFunc_IsNiagaraFXTypeEnabled_ReturnValue) == 0x000131, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::CallFunc_IsNiagaraFXTypeEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Select_Default) == 0x000138, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, CallFunc_SpawnFXAtLocation_ReturnValue) == 0x000140, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::CallFunc_SpawnFXAtLocation_ReturnValue' has a wrong offset!");

// Function GCN_Athena_ChillBronco_Explode.GCN_Athena_ChillBronco_Explode_C.OnBurst
// 0x00F8 (0x00F8 - 0x0000)
struct GCN_Athena_ChillBronco_Explode_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_ChillBronco_Explode_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Athena_ChillBronco_Explode_C_OnBurst");
static_assert(sizeof(GCN_Athena_ChillBronco_Explode_C_OnBurst) == 0x0000F8, "Wrong size on GCN_Athena_ChillBronco_Explode_C_OnBurst");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, ParticleComponents) == 0x0000C8, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, AudioComponents) == 0x0000D8, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::BurstDecalInstance' has a wrong offset!");

}

