#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Campsite_Tent_Hide_Heal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_Campsite_Tent_Hide_Heal.GCN_Athena_Campsite_Tent_Hide_Heal_C.OnBurstGeneric
// 0x0130 (0x0130 - 0x0000)
struct GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          Temp_object_Variable;                              // 0x0108(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
};
static_assert(alignof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric) == 0x000008, "Wrong alignment on GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric");
static_assert(sizeof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric) == 0x000130, "Wrong size on GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, MyTarget) == 0x000000, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, Parameters) == 0x000008, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, ParticleComponents) == 0x0000C8, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, AudioComponents) == 0x0000D8, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, CallFunc_GetActorTeam_ReturnValue) == 0x0000F8, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, CallFunc_GetValueAsBool_ReturnValue) == 0x0000F9, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000FC, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, Temp_object_Variable) == 0x000108, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, CallFunc_GetValueAtLevel_ReturnValue) == 0x000118, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric, K2Node_MakeArray_Array) == 0x000120, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnBurstGeneric::K2Node_MakeArray_Array' has a wrong offset!");

// Function GCN_Athena_Campsite_Tent_Hide_Heal.GCN_Athena_Campsite_Tent_Hide_Heal_C.OnExecute
// 0x00D0 (0x00D0 - 0x0000)
struct GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute) == 0x000008, "Wrong alignment on GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute");
static_assert(sizeof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute) == 0x0000D0, "Wrong size on GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute, MyTarget) == 0x000000, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute, Parameters) == 0x000008, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute, ReturnValue) == 0x0000C8, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0000C9, "Member 'GCN_Athena_Campsite_Tent_Hide_Heal_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");

}

