#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_ReactiveProp_GasPump_Explode

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_ReactiveProp_GasPump_Explode.GCN_Athena_ReactiveProp_GasPump_Explode_C.OnBurst
// 0x0158 (0x0158 - 0x0000)
struct GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          Temp_object_Variable;                              // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst");
static_assert(sizeof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst) == 0x000158, "Wrong size on GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, ParticleComponents) == 0x0000C8, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, AudioComponents) == 0x0000D8, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, Temp_object_Variable) == 0x0000F8, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000108, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, CallFunc_GetActorTeam_ReturnValue) == 0x000114, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000118, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, K2Node_MakeArray_Array) == 0x000128, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000138, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000144, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000150, "Member 'GCN_Athena_ReactiveProp_GasPump_Explode_C_OnBurst::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");

}

