#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Burst_TrackingPistolFlash

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Burst_TrackingPistolFlash.GCN_Burst_TrackingPistolFlash_C
// 0x0030 (0x01F0 - 0x01C0)
class UGCN_Burst_TrackingPistolFlash_C final : public UFortGameplayCueNotify_Burst
{
public:
	struct FVector                                Offset;                                            // 0x01C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OffsetDBNO;                                        // 0x01CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActorParamName;                                    // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   VectorParamName;                                   // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             WarningSound;                                      // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBurstGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Burst_TrackingPistolFlash_C">();
	}
	static class UGCN_Burst_TrackingPistolFlash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGCN_Burst_TrackingPistolFlash_C>();
	}
};
static_assert(alignof(UGCN_Burst_TrackingPistolFlash_C) == 0x000008, "Wrong alignment on UGCN_Burst_TrackingPistolFlash_C");
static_assert(sizeof(UGCN_Burst_TrackingPistolFlash_C) == 0x0001F0, "Wrong size on UGCN_Burst_TrackingPistolFlash_C");
static_assert(offsetof(UGCN_Burst_TrackingPistolFlash_C, Offset) == 0x0001C0, "Member 'UGCN_Burst_TrackingPistolFlash_C::Offset' has a wrong offset!");
static_assert(offsetof(UGCN_Burst_TrackingPistolFlash_C, OffsetDBNO) == 0x0001CC, "Member 'UGCN_Burst_TrackingPistolFlash_C::OffsetDBNO' has a wrong offset!");
static_assert(offsetof(UGCN_Burst_TrackingPistolFlash_C, ActorParamName) == 0x0001D8, "Member 'UGCN_Burst_TrackingPistolFlash_C::ActorParamName' has a wrong offset!");
static_assert(offsetof(UGCN_Burst_TrackingPistolFlash_C, VectorParamName) == 0x0001E0, "Member 'UGCN_Burst_TrackingPistolFlash_C::VectorParamName' has a wrong offset!");
static_assert(offsetof(UGCN_Burst_TrackingPistolFlash_C, WarningSound) == 0x0001E8, "Member 'UGCN_Burst_TrackingPistolFlash_C::WarningSound' has a wrong offset!");

}

