#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Campsite_Tent_Packup

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_Campsite_Tent_Packup.GCN_Athena_Campsite_Tent_Packup_C.ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup
// 0x0118 (0x0118 - 0x0000)
struct GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x00D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Tent_C*                              K2Node_DynamicCast_AsB_Tent;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup) == 0x000008, "Wrong alignment on GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup");
static_assert(sizeof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup) == 0x000118, "Wrong size on GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup, EntryPoint) == 0x000000, "Member 'GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup, K2Node_Event_MyTarget) == 0x000008, "Member 'GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup, K2Node_Event_Parameters) == 0x000010, "Member 'GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup, K2Node_Event_ParticleComponents) == 0x0000D0, "Member 'GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup, K2Node_Event_AudioComponents) == 0x0000E0, "Member 'GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup, K2Node_Event_BurstCameraShakeInstance) == 0x0000F0, "Member 'GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup, K2Node_Event_BurstDecalInstance) == 0x0000F8, "Member 'GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup, K2Node_DynamicCast_AsB_Tent) == 0x000100, "Member 'GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup::K2Node_DynamicCast_AsB_Tent' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00010C, "Member 'GCN_Athena_Campsite_Tent_Packup_C_ExecuteUbergraph_GCN_Athena_Campsite_Tent_Packup::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function GCN_Athena_Campsite_Tent_Packup.GCN_Athena_Campsite_Tent_Packup_C.OnBurstGeneric
// 0x00F8 (0x00F8 - 0x0000)
struct GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric) == 0x000008, "Wrong alignment on GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric");
static_assert(sizeof(GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric) == 0x0000F8, "Wrong size on GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric, MyTarget) == 0x000000, "Member 'GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric, Parameters) == 0x000008, "Member 'GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric, ParticleComponents) == 0x0000C8, "Member 'GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric, AudioComponents) == 0x0000D8, "Member 'GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Athena_Campsite_Tent_Packup_C_OnBurstGeneric::BurstDecalInstance' has a wrong offset!");

}

