#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Corruption_SpicySoda_Explode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Athena_Corruption_SpicySoda_Explode.GCN_Athena_Corruption_SpicySoda_Explode_C
// 0x0018 (0x01D8 - 0x01C0)
class UGCN_Athena_Corruption_SpicySoda_Explode_C final : public UFortGameplayCueNotify_Burst
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 LastTarget;                                        // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         NS_Explosion;                                      // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_Athena_Corruption_SpicySoda_Explode(int32 EntryPoint);

	void OnBurst(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Athena_Corruption_SpicySoda_Explode_C">();
	}
	static class UGCN_Athena_Corruption_SpicySoda_Explode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGCN_Athena_Corruption_SpicySoda_Explode_C>();
	}
};
static_assert(alignof(UGCN_Athena_Corruption_SpicySoda_Explode_C) == 0x000008, "Wrong alignment on UGCN_Athena_Corruption_SpicySoda_Explode_C");
static_assert(sizeof(UGCN_Athena_Corruption_SpicySoda_Explode_C) == 0x0001D8, "Wrong size on UGCN_Athena_Corruption_SpicySoda_Explode_C");
static_assert(offsetof(UGCN_Athena_Corruption_SpicySoda_Explode_C, UberGraphFrame) == 0x0001C0, "Member 'UGCN_Athena_Corruption_SpicySoda_Explode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGCN_Athena_Corruption_SpicySoda_Explode_C, LastTarget) == 0x0001C8, "Member 'UGCN_Athena_Corruption_SpicySoda_Explode_C::LastTarget' has a wrong offset!");
static_assert(offsetof(UGCN_Athena_Corruption_SpicySoda_Explode_C, NS_Explosion) == 0x0001D0, "Member 'UGCN_Athena_Corruption_SpicySoda_Explode_C::NS_Explosion' has a wrong offset!");

}

