#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina.GCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C
// 0x0018 (0x0820 - 0x0808)
class AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveFloat*                            SpawnRampCurve;                                    // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           timer_handle;                                      // 0x0818(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void StartLoop();
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void Loop();
	void ExecuteUbergraph_GCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C">();
	}
	static class AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C>();
	}
};
static_assert(alignof(AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C) == 0x000008, "Wrong alignment on AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C");
static_assert(sizeof(AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C) == 0x000820, "Wrong size on AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C");
static_assert(offsetof(AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C, UberGraphFrame) == 0x000808, "Member 'AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C, SpawnRampCurve) == 0x000810, "Member 'AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C::SpawnRampCurve' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C, timer_handle) == 0x000818, "Member 'AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C::timer_handle' has a wrong offset!");

}

