#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_ReactiveProp_PetrolPickup_OnFire

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_ReactiveProp_PetrolPickup_OnFire.GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C.ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire
// 0x0330 (0x0330 - 0x0000)
struct GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x00D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0120(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0148(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0168(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetHealthPercent_ReturnValue;             // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01F4(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x02A0(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0320(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire) == 0x000010, "Wrong alignment on GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire");
static_assert(sizeof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire) == 0x000330, "Wrong size on GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, EntryPoint) == 0x000000, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, K2Node_Event_MyTarget) == 0x000008, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, K2Node_Event_Parameters) == 0x000010, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, K2Node_Event_ParticleComponents) == 0x0000D0, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, K2Node_Event_AudioComponents) == 0x0000E0, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000110, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000118, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00011C, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000120, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000138, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000140, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000148, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000168, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_Location) == 0x000188, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_Normal) == 0x000194, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001A0, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A8, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001B0, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B8, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001C0, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001C4, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C8, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001D0, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, K2Node_DynamicCast_AsBuilding_Actor) == 0x0001D8, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001E4, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_GetHealthPercent_ReturnValue) == 0x0001F0, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_GetHealthPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001F4, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000290, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_NormalizeToRange_ReturnValue) == 0x000294, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, CallFunc_GetFloatValue_ReturnValue) == 0x000298, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, K2Node_MakeStruct_ParticleSysParam) == 0x0002A0, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire, K2Node_MakeArray_Array) == 0x000320, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_ExecuteUbergraph_GCNL_Athena_ReactiveProp_PetrolPickup_OnFire::K2Node_MakeArray_Array' has a wrong offset!");

// Function GCNL_Athena_ReactiveProp_PetrolPickup_OnFire.GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C.OnLoopingStart
// 0x00E8 (0x00E8 - 0x0000)
struct GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart");
static_assert(sizeof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart) == 0x0000E8, "Wrong size on GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart, AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_ReactiveProp_PetrolPickup_OnFire_C_OnLoopingStart::AudioComponents' has a wrong offset!");

}

