#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_HealSpray_Spray_Secondary

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_HealSpray_Spray_Secondary.GCNL_Athena_HealSpray_Spray_Secondary_C.ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary
// 0x0230 (0x0230 - 0x0000)
struct GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_1;                 // 0x00D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x00F8(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x01B8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x01C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LocalCount;                     // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LocalRemaining;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterInterface> CallFunc_SetFloatParameter_self_CastInput;         // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary) == 0x000008, "Wrong alignment on GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary");
static_assert(sizeof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary) == 0x000230, "Wrong size on GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, EntryPoint) == 0x000000, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_Event_MyTarget_1) == 0x000008, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_Event_Parameters_1) == 0x000010, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_Event_ParticleComponents_1) == 0x0000D0, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_Event_AudioComponents_1) == 0x0000E0, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_Event_MyTarget) == 0x0000F0, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_Event_Parameters) == 0x0000F8, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_Event_ParticleComponents) == 0x0001B8, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_Event_AudioComponents) == 0x0001C8, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_Event_BurstCameraShakeInstance) == 0x0001D8, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_Event_BurstDecalInstance) == 0x0001E0, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001E8, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, CallFunc_IsValid_ReturnValue_2) == 0x0001F1, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_Event_DeltaSeconds) == 0x0001F4, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_CustomEvent_LocalCount) == 0x0001F8, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_CustomEvent_LocalCount' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, K2Node_CustomEvent_LocalRemaining) == 0x0001FC, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::K2Node_CustomEvent_LocalRemaining' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, CallFunc_GetVelocity_ReturnValue) == 0x000200, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00020C, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, CallFunc_SetFloatParameter_self_CastInput) == 0x000210, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000220, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000228, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ExecuteUbergraph_GCNL_Athena_HealSpray_Spray_Secondary::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_HealSpray_Spray_Secondary.GCNL_Athena_HealSpray_Spray_Secondary_C.Local_Ammo
// 0x0008 (0x0008 - 0x0000)
struct GCNL_Athena_HealSpray_Spray_Secondary_C_Local_Ammo final
{
public:
	int32                                         LocalCount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalRemaining;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_HealSpray_Spray_Secondary_C_Local_Ammo) == 0x000004, "Wrong alignment on GCNL_Athena_HealSpray_Spray_Secondary_C_Local_Ammo");
static_assert(sizeof(GCNL_Athena_HealSpray_Spray_Secondary_C_Local_Ammo) == 0x000008, "Wrong size on GCNL_Athena_HealSpray_Spray_Secondary_C_Local_Ammo");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_Local_Ammo, LocalCount) == 0x000000, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_Local_Ammo::LocalCount' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_Local_Ammo, LocalRemaining) == 0x000004, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_Local_Ammo::LocalRemaining' has a wrong offset!");

// Function GCNL_Athena_HealSpray_Spray_Secondary.GCNL_Athena_HealSpray_Spray_Secondary_C.OnLoopingStartGeneric
// 0x00E8 (0x00E8 - 0x0000)
struct GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric");
static_assert(sizeof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric) == 0x0000E8, "Wrong size on GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric, AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_OnLoopingStartGeneric::AudioComponents' has a wrong offset!");

// Function GCNL_Athena_HealSpray_Spray_Secondary.GCNL_Athena_HealSpray_Spray_Secondary_C.OnRemovalGeneric
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric) == 0x0000F8, "Wrong size on GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric, AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_OnRemovalGeneric::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Athena_HealSpray_Spray_Secondary.GCNL_Athena_HealSpray_Spray_Secondary_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCNL_Athena_HealSpray_Spray_Secondary_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_HealSpray_Spray_Secondary_C_ReceiveTick) == 0x000004, "Wrong alignment on GCNL_Athena_HealSpray_Spray_Secondary_C_ReceiveTick");
static_assert(sizeof(GCNL_Athena_HealSpray_Spray_Secondary_C_ReceiveTick) == 0x000004, "Wrong size on GCNL_Athena_HealSpray_Spray_Secondary_C_ReceiveTick");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GCNL_Athena_HealSpray_Spray_Secondary.GCNL_Athena_HealSpray_Spray_Secondary_C.StartSprayAudio
// 0x0030 (0x0030 - 0x0000)
struct GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 LocalCount, int32 LocalRemaining)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio) == 0x000008, "Wrong alignment on GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio");
static_assert(sizeof(GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio) == 0x000030, "Wrong size on GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio, Temp_bool_Variable) == 0x000000, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio, CallFunc_IsLocallyViewed_ReturnValue) == 0x000014, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio::CallFunc_IsLocallyViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio, CallFunc_IsValid_ReturnValue) == 0x000015, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000018, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio, K2Node_Select_Default) == 0x000020, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000028, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StartSprayAudio::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_HealSpray_Spray_Secondary.GCNL_Athena_HealSpray_Spray_Secondary_C.StopSprayAudio
// 0x0020 (0x0020 - 0x0000)
struct GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio) == 0x000008, "Wrong alignment on GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio");
static_assert(sizeof(GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio) == 0x000020, "Wrong size on GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000008, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio, CallFunc_IsValid_ReturnValue_2) == 0x000010, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000018, "Member 'GCNL_Athena_HealSpray_Spray_Secondary_C_StopSprayAudio::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

}

