#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_HealSpray_Heal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_HealSpray_Heal.GCNL_Athena_HealSpray_Heal_C
// 0x0038 (0x0840 - 0x0808)
class AGCNL_Athena_HealSpray_Heal_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              HealSound1p;                                       // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              HealSound3p;                                       // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        HealAudioComponent;                                // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              SprayStopSound1p;                                  // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SprayStopSound3p;                                  // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Athena_HealSpray_Heal(int32 EntryPoint);
	void OnLoopingStartGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemovalGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void StartHealAudio();
	void StopHealAudio();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_HealSpray_Heal_C">();
	}
	static class AGCNL_Athena_HealSpray_Heal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_HealSpray_Heal_C>();
	}
};
static_assert(alignof(AGCNL_Athena_HealSpray_Heal_C) == 0x000008, "Wrong alignment on AGCNL_Athena_HealSpray_Heal_C");
static_assert(sizeof(AGCNL_Athena_HealSpray_Heal_C) == 0x000840, "Wrong size on AGCNL_Athena_HealSpray_Heal_C");
static_assert(offsetof(AGCNL_Athena_HealSpray_Heal_C, UberGraphFrame) == 0x000808, "Member 'AGCNL_Athena_HealSpray_Heal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HealSpray_Heal_C, PlayerPawn) == 0x000810, "Member 'AGCNL_Athena_HealSpray_Heal_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HealSpray_Heal_C, HealSound1p) == 0x000818, "Member 'AGCNL_Athena_HealSpray_Heal_C::HealSound1p' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HealSpray_Heal_C, HealSound3p) == 0x000820, "Member 'AGCNL_Athena_HealSpray_Heal_C::HealSound3p' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HealSpray_Heal_C, HealAudioComponent) == 0x000828, "Member 'AGCNL_Athena_HealSpray_Heal_C::HealAudioComponent' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HealSpray_Heal_C, SprayStopSound1p) == 0x000830, "Member 'AGCNL_Athena_HealSpray_Heal_C::SprayStopSound1p' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HealSpray_Heal_C, SprayStopSound3p) == 0x000838, "Member 'AGCNL_Athena_HealSpray_Heal_C::SprayStopSound3p' has a wrong offset!");

}

