#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HalfShieldPotion_Prop_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct HalfShieldPotion_Prop_AnimBP.HalfShieldPotion_Prop_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0117 (0x0118 - 0x0001)
struct HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_10;                                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_11;                                 // 0x0010(0x0020)(NoDestructor)
	bool                                          BoolProperty_12;                                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_13;                                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          StructProperty_14;                                 // 0x0038(0x002C)(NoDestructor)
	float                                         FloatProperty_15;                                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_16;                                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_17;                                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_18;                                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_19;                                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_20;                                   // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0080(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0100(0x0018)()
};
static_assert(alignof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000118, "Wrong size on HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_10) == 0x000004, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_10' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_11) == 0x000010, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_11' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_12) == 0x000030, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_12' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_13) == 0x000034, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_13' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_14) == 0x000038, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_14' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_15) == 0x000064, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_15' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_16) == 0x000068, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_16' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_17) == 0x000070, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_17' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_18) == 0x000071, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_18' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_19) == 0x000072, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_19' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_20) == 0x000074, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_20' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000080, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000100, "Member 'HalfShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

