#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconTextButtonReplayHorizontal

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IconTextButtonReplayHorizontal.IconTextButtonReplayHorizontal_C
// 0x0150 (0x1050 - 0x0F00)
class UIconTextButtonReplayHorizontal_C final : public UIconTextButtonSpectatorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Background;                                        // 0x0F08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0F10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             RightExtraContentSlot;                             // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0F30(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_F48[0x8];                                      // 0x0F48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            IconBrush;                                         // 0x0F50(0x00B0)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 ControllerInputStyle;                              // 0x1000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 MouseKeyboardStyle;                                // 0x1008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          ContentAlignment;                                  // 0x1010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1011[0x3];                                     // 0x1011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HoveredColor;                                      // 0x1014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultColor;                                      // 0x1024(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SelectedColor;                                     // 0x1034(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHideIcon;                                    // 0x1044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTextStyle();
	void UpdateTextAndStyle(bool bUsingGamepad);
	void UpdateText();
	void UpdateContentAlignment();
	void SetText(const class FText& Text);
	void UpdateStyle(bool UsingGamepad);
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void SetMouseKeyboardStyle(class UClass* ControllerInputStyle_0);
	void SetControllerStyle(class UClass* ControllerInputStyle_0);
	void SetContentAlignment(EHorizontalAlignment ContentAlignment_0);
	void PreConstruct(bool IsDesignTime);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void OnCurrentTextStyleChanged();
	void OnActionProgress(float HeldPercent);
	void Set_Icon(const struct FSlateBrush& IconBrush_0);
	void OnActionComplete();
	void InitializeButton();
	void ExecuteUbergraph_IconTextButtonReplayHorizontal(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnSelected();
	void BP_OnHovered();
	void BP_OnDeselected();
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void ActivateButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IconTextButtonReplayHorizontal_C">();
	}
	static class UIconTextButtonReplayHorizontal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIconTextButtonReplayHorizontal_C>();
	}
};
static_assert(alignof(UIconTextButtonReplayHorizontal_C) == 0x000010, "Wrong alignment on UIconTextButtonReplayHorizontal_C");
static_assert(sizeof(UIconTextButtonReplayHorizontal_C) == 0x001050, "Wrong size on UIconTextButtonReplayHorizontal_C");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, UberGraphFrame) == 0x000F00, "Member 'UIconTextButtonReplayHorizontal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, Background) == 0x000F08, "Member 'UIconTextButtonReplayHorizontal_C::Background' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, CenterButtonTextWidget) == 0x000F10, "Member 'UIconTextButtonReplayHorizontal_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, ContentBorder) == 0x000F18, "Member 'UIconTextButtonReplayHorizontal_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, Image) == 0x000F20, "Member 'UIconTextButtonReplayHorizontal_C::Image' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, RightExtraContentSlot) == 0x000F28, "Member 'UIconTextButtonReplayHorizontal_C::RightExtraContentSlot' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, ButtonText) == 0x000F30, "Member 'UIconTextButtonReplayHorizontal_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, IconBrush) == 0x000F50, "Member 'UIconTextButtonReplayHorizontal_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, ControllerInputStyle) == 0x001000, "Member 'UIconTextButtonReplayHorizontal_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, MouseKeyboardStyle) == 0x001008, "Member 'UIconTextButtonReplayHorizontal_C::MouseKeyboardStyle' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, ContentAlignment) == 0x001010, "Member 'UIconTextButtonReplayHorizontal_C::ContentAlignment' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, HoveredColor) == 0x001014, "Member 'UIconTextButtonReplayHorizontal_C::HoveredColor' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, DefaultColor) == 0x001024, "Member 'UIconTextButtonReplayHorizontal_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, SelectedColor) == 0x001034, "Member 'UIconTextButtonReplayHorizontal_C::SelectedColor' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplayHorizontal_C, ShouldHideIcon) == 0x001044, "Member 'UIconTextButtonReplayHorizontal_C::ShouldHideIcon' has a wrong offset!");

}

