#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameSocialUserWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InGameSocialUserWidget.InGameSocialUserWidget_C
// 0x0060 (0x0368 - 0x0308)
class UInGameSocialUserWidget_C final : public UAthenaIGMPartyMemberWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ready;                                             // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected_Effect;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_AvatarExtension;                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PartyLeaderIcon;                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyCheckBox;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyCheckBox_Shadow;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_ItemSize;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Readiness;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          notPlayer;                                         // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void OnWidgetReset();
	void OnUserSet();
	void OnNewReadiness(EGameReadiness GameReadiness);
	void OnIsPartyLeaderChanged(bool bIsPartyLeader);
	void ExecuteUbergraph_InGameSocialUserWidget(int32 EntryPoint);
	void BP_HandleExtensionWidgetCreated(class UUserWidget* Widget, EUIExtensionSlot SlotType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InGameSocialUserWidget_C">();
	}
	static class UInGameSocialUserWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInGameSocialUserWidget_C>();
	}
};
static_assert(alignof(UInGameSocialUserWidget_C) == 0x000008, "Wrong alignment on UInGameSocialUserWidget_C");
static_assert(sizeof(UInGameSocialUserWidget_C) == 0x000368, "Wrong size on UInGameSocialUserWidget_C");
static_assert(offsetof(UInGameSocialUserWidget_C, UberGraphFrame) == 0x000308, "Member 'UInGameSocialUserWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Ready) == 0x000310, "Member 'UInGameSocialUserWidget_C::Ready' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Selected) == 0x000318, "Member 'UInGameSocialUserWidget_C::Selected' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Image_Selected) == 0x000320, "Member 'UInGameSocialUserWidget_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Image_Selected_Effect) == 0x000328, "Member 'UInGameSocialUserWidget_C::Image_Selected_Effect' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Overlay_AvatarExtension) == 0x000330, "Member 'UInGameSocialUserWidget_C::Overlay_AvatarExtension' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Overlay_PartyLeaderIcon) == 0x000338, "Member 'UInGameSocialUserWidget_C::Overlay_PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, ReadyCheckBox) == 0x000340, "Member 'UInGameSocialUserWidget_C::ReadyCheckBox' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, ReadyCheckBox_Shadow) == 0x000348, "Member 'UInGameSocialUserWidget_C::ReadyCheckBox_Shadow' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, ScaleBox_ItemSize) == 0x000350, "Member 'UInGameSocialUserWidget_C::ScaleBox_ItemSize' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Text_Readiness) == 0x000358, "Member 'UInGameSocialUserWidget_C::Text_Readiness' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, notPlayer) == 0x000360, "Member 'UInGameSocialUserWidget_C::notPlayer' has a wrong offset!");

}

