#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemDetailsStackCounter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemDetailsStackCounter.ItemDetailsStackCounter_C
// 0x0028 (0x02F0 - 0x02C8)
class UItemDetailsStackCounter_C final : public UFortItemDetailElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               _SizeBox_;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderBase;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextCounter;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysVisible;                                     // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TruncateValue;                                     // 0x02ED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Update_Stack_Count();
	void Refresh_Visibility();
	void PreConstruct(bool IsDesignTime);
	void HandleQuantityOverrideChanged();
	void HandlePreDifferentItemToDetailSet();
	void HandlePostDifferentItemToDetailSet();
	void HandleOnItemChanged(bool bItemChanged, bool bAmmoChanged, bool bIngredientsChanged);
	void ExecuteUbergraph_ItemDetailsStackCounter(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemDetailsStackCounter_C">();
	}
	static class UItemDetailsStackCounter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemDetailsStackCounter_C>();
	}
};
static_assert(alignof(UItemDetailsStackCounter_C) == 0x000008, "Wrong alignment on UItemDetailsStackCounter_C");
static_assert(sizeof(UItemDetailsStackCounter_C) == 0x0002F0, "Wrong size on UItemDetailsStackCounter_C");
static_assert(offsetof(UItemDetailsStackCounter_C, UberGraphFrame) == 0x0002C8, "Member 'UItemDetailsStackCounter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemDetailsStackCounter_C, _SizeBox_) == 0x0002D0, "Member 'UItemDetailsStackCounter_C::_SizeBox_' has a wrong offset!");
static_assert(offsetof(UItemDetailsStackCounter_C, BorderBase) == 0x0002D8, "Member 'UItemDetailsStackCounter_C::BorderBase' has a wrong offset!");
static_assert(offsetof(UItemDetailsStackCounter_C, TextCounter) == 0x0002E0, "Member 'UItemDetailsStackCounter_C::TextCounter' has a wrong offset!");
static_assert(offsetof(UItemDetailsStackCounter_C, Count) == 0x0002E8, "Member 'UItemDetailsStackCounter_C::Count' has a wrong offset!");
static_assert(offsetof(UItemDetailsStackCounter_C, AlwaysVisible) == 0x0002EC, "Member 'UItemDetailsStackCounter_C::AlwaysVisible' has a wrong offset!");
static_assert(offsetof(UItemDetailsStackCounter_C, TruncateValue) == 0x0002ED, "Member 'UItemDetailsStackCounter_C::TruncateValue' has a wrong offset!");

}

