#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeepPlayingTogetherOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KeepPlayingTogetherOverlay.KeepPlayingTogetherOverlay_C
// 0x0058 (0x0378 - 0x0320)
class UKeepPlayingTogetherOverlay_C final : public UAthenaKeepPlayingTogetherScreenOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InitialCountdownState;                             // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Countdown;                                         // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaServerShutdownWidget_C*          AthenaServerShutdownWidget;                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPostGameBottomBarWidget_C*             PostGameBottomBarWidget;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SquadBox;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ErrorHeader;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Waiting;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CachedErrorText;                                   // 0x0360(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateExitToLobbyCountdownText(float CountdownValue);
	void PreConstruct(bool IsDesignTime);
	void OnMatchmakingStarted();
	void OnPreMatchmakingCountdownStarted();
	void OnMatchmakingFinished(bool bSuccess);
	void OnPreMatchmakingCountdownProgressed();
	void OnKeepPlayingTogetherScreenOverlayDeactivated();
	void OnKeepPlayingTogetherScreenOverlayActivated();
	void OnExitToLobbyCountdownProgressed(float CountdownValue);
	void ExecuteUbergraph_KeepPlayingTogetherOverlay(int32 EntryPoint);
	void Destruct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KeepPlayingTogetherOverlay_C">();
	}
	static class UKeepPlayingTogetherOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeepPlayingTogetherOverlay_C>();
	}
};
static_assert(alignof(UKeepPlayingTogetherOverlay_C) == 0x000008, "Wrong alignment on UKeepPlayingTogetherOverlay_C");
static_assert(sizeof(UKeepPlayingTogetherOverlay_C) == 0x000378, "Wrong size on UKeepPlayingTogetherOverlay_C");
static_assert(offsetof(UKeepPlayingTogetherOverlay_C, UberGraphFrame) == 0x000320, "Member 'UKeepPlayingTogetherOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKeepPlayingTogetherOverlay_C, InitialCountdownState) == 0x000328, "Member 'UKeepPlayingTogetherOverlay_C::InitialCountdownState' has a wrong offset!");
static_assert(offsetof(UKeepPlayingTogetherOverlay_C, Countdown) == 0x000330, "Member 'UKeepPlayingTogetherOverlay_C::Countdown' has a wrong offset!");
static_assert(offsetof(UKeepPlayingTogetherOverlay_C, AthenaServerShutdownWidget) == 0x000338, "Member 'UKeepPlayingTogetherOverlay_C::AthenaServerShutdownWidget' has a wrong offset!");
static_assert(offsetof(UKeepPlayingTogetherOverlay_C, PostGameBottomBarWidget) == 0x000340, "Member 'UKeepPlayingTogetherOverlay_C::PostGameBottomBarWidget' has a wrong offset!");
static_assert(offsetof(UKeepPlayingTogetherOverlay_C, SquadBox) == 0x000348, "Member 'UKeepPlayingTogetherOverlay_C::SquadBox' has a wrong offset!");
static_assert(offsetof(UKeepPlayingTogetherOverlay_C, Text_ErrorHeader) == 0x000350, "Member 'UKeepPlayingTogetherOverlay_C::Text_ErrorHeader' has a wrong offset!");
static_assert(offsetof(UKeepPlayingTogetherOverlay_C, Text_Waiting) == 0x000358, "Member 'UKeepPlayingTogetherOverlay_C::Text_Waiting' has a wrong offset!");
static_assert(offsetof(UKeepPlayingTogetherOverlay_C, CachedErrorText) == 0x000360, "Member 'UKeepPlayingTogetherOverlay_C::CachedErrorText' has a wrong offset!");

}

