#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LF_5x5_Parent

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LF_5x5_Parent.LF_5x5_Parent_C
// 0x0030 (0x1060 - 0x1030)
class ALF_5x5_Parent_C final : public ABuildingFoundation5x5
{
public:
	class UTextRenderComponent*                   RenderTextComponent;                               // 0x1030(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   EditorDisplayNameText;                             // 0x1038(0x0018)(Edit, BlueprintVisible)
	float                                         TextSize;                                          // 0x1050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LF_5x5_Parent_C">();
	}
	static class ALF_5x5_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALF_5x5_Parent_C>();
	}
};
static_assert(alignof(ALF_5x5_Parent_C) == 0x000010, "Wrong alignment on ALF_5x5_Parent_C");
static_assert(sizeof(ALF_5x5_Parent_C) == 0x001060, "Wrong size on ALF_5x5_Parent_C");
static_assert(offsetof(ALF_5x5_Parent_C, RenderTextComponent) == 0x001030, "Member 'ALF_5x5_Parent_C::RenderTextComponent' has a wrong offset!");
static_assert(offsetof(ALF_5x5_Parent_C, EditorDisplayNameText) == 0x001038, "Member 'ALF_5x5_Parent_C::EditorDisplayNameText' has a wrong offset!");
static_assert(offsetof(ALF_5x5_Parent_C, TextSize) == 0x001050, "Member 'ALF_5x5_Parent_C::TextSize' has a wrong offset!");

}

