#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveStreamHUDElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LiveStreamHUDElement.LiveStreamHUDElement_C
// 0x0068 (0x03B8 - 0x0350)
class ULiveStreamHUDElement_C final : public ULiveStreamHUDElement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderRoot;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HideInstructions;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_HideInstructions;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VideoPlayerSlot;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   VideoPlayerClass;                                  // 0x0380(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ULiveStreamStandalonePlayer*            VideoPlayer;                                       // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InstructionsShown;                                 // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldCleanup;                                    // 0x03B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void VideoPlayerReady();
	void TryCleanupVideoPlayer();
	void OnComplete_17963E1E4795FBCACA9C17990725A1D0(class UUserWidget* UserWidget);
	void OnComplete_74112BA8413888C7EAD38CA589F3B588(class UUserWidget* UserWidget);
	void InitializeVideoPlayer();
	void Finished_93DE0A3C4B82FE3C7555818E7982E00A();
	void ExecuteUbergraph_LiveStreamHUDElement(int32 EntryPoint);
	void DestroyVideoPlayer();
	void CreateVideoPlayer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LiveStreamHUDElement_C">();
	}
	static class ULiveStreamHUDElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamHUDElement_C>();
	}
};
static_assert(alignof(ULiveStreamHUDElement_C) == 0x000008, "Wrong alignment on ULiveStreamHUDElement_C");
static_assert(sizeof(ULiveStreamHUDElement_C) == 0x0003B8, "Wrong size on ULiveStreamHUDElement_C");
static_assert(offsetof(ULiveStreamHUDElement_C, UberGraphFrame) == 0x000350, "Member 'ULiveStreamHUDElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, Fade) == 0x000358, "Member 'ULiveStreamHUDElement_C::Fade' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, BorderRoot) == 0x000360, "Member 'ULiveStreamHUDElement_C::BorderRoot' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, HideInstructions) == 0x000368, "Member 'ULiveStreamHUDElement_C::HideInstructions' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, Text_HideInstructions) == 0x000370, "Member 'ULiveStreamHUDElement_C::Text_HideInstructions' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, VideoPlayerSlot) == 0x000378, "Member 'ULiveStreamHUDElement_C::VideoPlayerSlot' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, VideoPlayerClass) == 0x000380, "Member 'ULiveStreamHUDElement_C::VideoPlayerClass' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, VideoPlayer) == 0x0003A8, "Member 'ULiveStreamHUDElement_C::VideoPlayer' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, InstructionsShown) == 0x0003B0, "Member 'ULiveStreamHUDElement_C::InstructionsShown' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, bShouldCleanup) == 0x0003B1, "Member 'ULiveStreamHUDElement_C::bShouldCleanup' has a wrong offset!");

}

