#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Cat_Burglar_Human_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Cat_Burglar_Human_FaceAcc_AnimBP.M_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C
// 0x2400 (0x2980 - 0x0580)
class UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0588(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0590(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0598(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x05B8(0x0188)(ContainsInstancedReference)
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x0740(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x0B80(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x0FC0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x1400(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x1840(0x0440)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1C80(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1CA0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x1CC0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x2100(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2540(0x0440)()

public:
	void ExecuteUbergraph_M_MED_Cat_Burglar_Human_FaceAcc_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C">();
	}
	static class UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C");
static_assert(sizeof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C) == 0x002980, "Wrong size on UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000580, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000588, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimBlueprintExtension_Base) == 0x000590, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x000598, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0005B8, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x000740, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x000B80, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x000FC0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x001400, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x001840, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001C80, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001CA0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x001CC0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x002100, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x002540, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");

}

