#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchXPRecapSquadMemberWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchXPRecapSquadMemberWidget.MatchXPRecapSquadMemberWidget_C
// 0x0080 (0x03B0 - 0x0330)
class UMatchXPRecapSquadMemberWidget_C final : public UAthenaIGMSquadMemberWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowNameBriefly;                                   // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ready;                                             // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected_Effect;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_AvatarExtension;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PartyLeaderIcon;                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyCheckBox;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyCheckBox_Shadow;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_ItemSize;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Portrait;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           OptedOutFadedGray;                                 // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NonUserScaleValue;                                 // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdatePortraitUserSpecifiedScale();
	void UnreadyAndCollapse(bool WasOptedIn);
	void PreConstruct(bool IsDesignTime);
	void OnWidgetReset();
	void OnMatchmakingStarted(const bool bWasOptedIn);
	void OnKeepPlayingTogetherVotingStatusChanged(const EKeepPlayingTogetherVotingStatus NewStatus, const bool bWasOptedIn);
	void OnIsPartyLeaderChanged(bool bIsPartyLeader);
	void ExecuteUbergraph_MatchXPRecapSquadMemberWidget(int32 EntryPoint);
	void Construct();
	void BP_HandleExtensionWidgetCreated(class UUserWidget* Widget, EUIExtensionSlot SlotType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchXPRecapSquadMemberWidget_C">();
	}
	static class UMatchXPRecapSquadMemberWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchXPRecapSquadMemberWidget_C>();
	}
};
static_assert(alignof(UMatchXPRecapSquadMemberWidget_C) == 0x000008, "Wrong alignment on UMatchXPRecapSquadMemberWidget_C");
static_assert(sizeof(UMatchXPRecapSquadMemberWidget_C) == 0x0003B0, "Wrong size on UMatchXPRecapSquadMemberWidget_C");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, UberGraphFrame) == 0x000330, "Member 'UMatchXPRecapSquadMemberWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, ShowNameBriefly) == 0x000338, "Member 'UMatchXPRecapSquadMemberWidget_C::ShowNameBriefly' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Reset) == 0x000340, "Member 'UMatchXPRecapSquadMemberWidget_C::Reset' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Ready) == 0x000348, "Member 'UMatchXPRecapSquadMemberWidget_C::Ready' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Selected) == 0x000350, "Member 'UMatchXPRecapSquadMemberWidget_C::Selected' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Image_Selected) == 0x000358, "Member 'UMatchXPRecapSquadMemberWidget_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Image_Selected_Effect) == 0x000360, "Member 'UMatchXPRecapSquadMemberWidget_C::Image_Selected_Effect' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Overlay_AvatarExtension) == 0x000368, "Member 'UMatchXPRecapSquadMemberWidget_C::Overlay_AvatarExtension' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Overlay_PartyLeaderIcon) == 0x000370, "Member 'UMatchXPRecapSquadMemberWidget_C::Overlay_PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, ReadyCheckBox) == 0x000378, "Member 'UMatchXPRecapSquadMemberWidget_C::ReadyCheckBox' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, ReadyCheckBox_Shadow) == 0x000380, "Member 'UMatchXPRecapSquadMemberWidget_C::ReadyCheckBox_Shadow' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, ScaleBox_ItemSize) == 0x000388, "Member 'UMatchXPRecapSquadMemberWidget_C::ScaleBox_ItemSize' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, ScaleBox_Portrait) == 0x000390, "Member 'UMatchXPRecapSquadMemberWidget_C::ScaleBox_Portrait' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, OptedOutFadedGray) == 0x000398, "Member 'UMatchXPRecapSquadMemberWidget_C::OptedOutFadedGray' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, NonUserScaleValue) == 0x0003A8, "Member 'UMatchXPRecapSquadMemberWidget_C::NonUserScaleValue' has a wrong offset!");

}

