#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchXPScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchXPScreen.MatchXPScreen_C
// 0x0030 (0x0470 - 0x0440)
class UMatchXPScreen_C final : public UAthenaMatchXPScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               BottomBarOverlay;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Stats;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_XP;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_45;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               StayTogetherContainer;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetStatButtonText(const class FText& InText);
	void OnToggleDetailsRecap();
	void ExecuteUbergraph_MatchXPScreen(int32 EntryPoint);
	void BP_OnActivated();
	void BndEvt__CommonWidgetSwitcher_DetailSwitch_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchXPScreen_C">();
	}
	static class UMatchXPScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchXPScreen_C>();
	}
};
static_assert(alignof(UMatchXPScreen_C) == 0x000008, "Wrong alignment on UMatchXPScreen_C");
static_assert(sizeof(UMatchXPScreen_C) == 0x000470, "Wrong size on UMatchXPScreen_C");
static_assert(offsetof(UMatchXPScreen_C, UberGraphFrame) == 0x000440, "Member 'UMatchXPScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchXPScreen_C, BottomBarOverlay) == 0x000448, "Member 'UMatchXPScreen_C::BottomBarOverlay' has a wrong offset!");
static_assert(offsetof(UMatchXPScreen_C, Icon_Stats) == 0x000450, "Member 'UMatchXPScreen_C::Icon_Stats' has a wrong offset!");
static_assert(offsetof(UMatchXPScreen_C, Icon_XP) == 0x000458, "Member 'UMatchXPScreen_C::Icon_XP' has a wrong offset!");
static_assert(offsetof(UMatchXPScreen_C, Image_45) == 0x000460, "Member 'UMatchXPScreen_C::Image_45' has a wrong offset!");
static_assert(offsetof(UMatchXPScreen_C, StayTogetherContainer) == 0x000468, "Member 'UMatchXPScreen_C::StayTogetherContainer' has a wrong offset!");

}

