#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchXPRecapSquadDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchXPRecapSquadDisplay.MatchXPRecapSquadDisplay_C
// 0x0018 (0x02A0 - 0x0288)
class UMatchXPRecapSquadDisplay_C final : public UAthenaIGMSquadDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              ScaleBox_SquadMemberEntries;                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         In_User_Specified_Scale;                           // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_MatchXPRecapSquadDisplay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchXPRecapSquadDisplay_C">();
	}
	static class UMatchXPRecapSquadDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchXPRecapSquadDisplay_C>();
	}
};
static_assert(alignof(UMatchXPRecapSquadDisplay_C) == 0x000008, "Wrong alignment on UMatchXPRecapSquadDisplay_C");
static_assert(sizeof(UMatchXPRecapSquadDisplay_C) == 0x0002A0, "Wrong size on UMatchXPRecapSquadDisplay_C");
static_assert(offsetof(UMatchXPRecapSquadDisplay_C, UberGraphFrame) == 0x000288, "Member 'UMatchXPRecapSquadDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadDisplay_C, ScaleBox_SquadMemberEntries) == 0x000290, "Member 'UMatchXPRecapSquadDisplay_C::ScaleBox_SquadMemberEntries' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadDisplay_C, In_User_Specified_Scale) == 0x000298, "Member 'UMatchXPRecapSquadDisplay_C::In_User_Specified_Scale' has a wrong offset!");

}

