#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniShieldPotion_Prop_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct MiniShieldPotion_Prop_AnimBP.MiniShieldPotion_Prop_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00E7 (0x00E8 - 0x0001)
struct MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_10;                                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_11;                                 // 0x0010(0x0020)(NoDestructor)
	ESequenceEvalReinit                           ByteProperty_12;                                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_13;                                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_14;                                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_15;                                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_16;                                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_17;                                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_18;                                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_19;                                   // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0050(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D0(0x0018)()
};
static_assert(alignof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000E8, "Wrong size on MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_10) == 0x000004, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_10' has a wrong offset!");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_11) == 0x000010, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_11' has a wrong offset!");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_12) == 0x000030, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_12' has a wrong offset!");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_13) == 0x000031, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_13' has a wrong offset!");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_14) == 0x000034, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_14' has a wrong offset!");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_15) == 0x000038, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_15' has a wrong offset!");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_16) == 0x000040, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_16' has a wrong offset!");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_17) == 0x000041, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_17' has a wrong offset!");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_18) == 0x000042, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_18' has a wrong offset!");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_19) == 0x000044, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_19' has a wrong offset!");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000050, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D0, "Member 'MiniShieldPotion_Prop_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

