#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultipleReceivedItemNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MultipleReceivedItemNotification.MultipleReceivedItemNotification_C
// 0x0048 (0x0318 - 0x02D0)
class UMultipleReceivedItemNotification_C final : public UFortNotificationEntry_MultipleReceivedItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Backing;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RewardFlare;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichText_PrimaryMessage;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichText_SecondaryMessage;                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFortRarity                                   DevRarity;                                         // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IntroSpeed;                                        // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StartNotificationOutro();
	void StartNotificationIntro();
	void ShowNoFriendsMessage();
	void RarityVisuals(EFortRarity Rarity);
	void PreConstruct(bool IsDesignTime);
	void HandleRewardEnd();
	void HandleReward_3();
	void HandleReward_2();
	void HandleNoFriendsMessage();
	void ExecuteUbergraph_MultipleReceivedItemNotification(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MultipleReceivedItemNotification_C">();
	}
	static class UMultipleReceivedItemNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultipleReceivedItemNotification_C>();
	}
};
static_assert(alignof(UMultipleReceivedItemNotification_C) == 0x000008, "Wrong alignment on UMultipleReceivedItemNotification_C");
static_assert(sizeof(UMultipleReceivedItemNotification_C) == 0x000318, "Wrong size on UMultipleReceivedItemNotification_C");
static_assert(offsetof(UMultipleReceivedItemNotification_C, UberGraphFrame) == 0x0002D0, "Member 'UMultipleReceivedItemNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMultipleReceivedItemNotification_C, Outro) == 0x0002D8, "Member 'UMultipleReceivedItemNotification_C::Outro' has a wrong offset!");
static_assert(offsetof(UMultipleReceivedItemNotification_C, Intro) == 0x0002E0, "Member 'UMultipleReceivedItemNotification_C::Intro' has a wrong offset!");
static_assert(offsetof(UMultipleReceivedItemNotification_C, Backing) == 0x0002E8, "Member 'UMultipleReceivedItemNotification_C::Backing' has a wrong offset!");
static_assert(offsetof(UMultipleReceivedItemNotification_C, RewardFlare) == 0x0002F0, "Member 'UMultipleReceivedItemNotification_C::RewardFlare' has a wrong offset!");
static_assert(offsetof(UMultipleReceivedItemNotification_C, RichText_PrimaryMessage) == 0x0002F8, "Member 'UMultipleReceivedItemNotification_C::RichText_PrimaryMessage' has a wrong offset!");
static_assert(offsetof(UMultipleReceivedItemNotification_C, RichText_SecondaryMessage) == 0x000300, "Member 'UMultipleReceivedItemNotification_C::RichText_SecondaryMessage' has a wrong offset!");
static_assert(offsetof(UMultipleReceivedItemNotification_C, Switcher) == 0x000308, "Member 'UMultipleReceivedItemNotification_C::Switcher' has a wrong offset!");
static_assert(offsetof(UMultipleReceivedItemNotification_C, DevRarity) == 0x000310, "Member 'UMultipleReceivedItemNotification_C::DevRarity' has a wrong offset!");
static_assert(offsetof(UMultipleReceivedItemNotification_C, IntroSpeed) == 0x000314, "Member 'UMultipleReceivedItemNotification_C::IntroSpeed' has a wrong offset!");

}

