#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiInteractDisplayWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MultiInteractDisplayWidget.MultiInteractDisplayWidget_C
// 0x0050 (0x02C0 - 0x0270)
class UMultiInteractDisplayWidget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 InteractIcon;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InteractIcon_1;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InteractIcon2;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InteractIcon3;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InteractIcon4;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Interaction_HBox;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_InteractionCount;                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              VisibilitySwitcher;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bTextVersion;                                      // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MultiInteractDisplayWidget(int32 EntryPoint);
	void CurrentInteractionCount(int32 CurrentCount);
	void Construct();
	void CheckSquadSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MultiInteractDisplayWidget_C">();
	}
	static class UMultiInteractDisplayWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiInteractDisplayWidget_C>();
	}
};
static_assert(alignof(UMultiInteractDisplayWidget_C) == 0x000008, "Wrong alignment on UMultiInteractDisplayWidget_C");
static_assert(sizeof(UMultiInteractDisplayWidget_C) == 0x0002C0, "Wrong size on UMultiInteractDisplayWidget_C");
static_assert(offsetof(UMultiInteractDisplayWidget_C, UberGraphFrame) == 0x000270, "Member 'UMultiInteractDisplayWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMultiInteractDisplayWidget_C, InteractIcon) == 0x000278, "Member 'UMultiInteractDisplayWidget_C::InteractIcon' has a wrong offset!");
static_assert(offsetof(UMultiInteractDisplayWidget_C, InteractIcon_1) == 0x000280, "Member 'UMultiInteractDisplayWidget_C::InteractIcon_1' has a wrong offset!");
static_assert(offsetof(UMultiInteractDisplayWidget_C, InteractIcon2) == 0x000288, "Member 'UMultiInteractDisplayWidget_C::InteractIcon2' has a wrong offset!");
static_assert(offsetof(UMultiInteractDisplayWidget_C, InteractIcon3) == 0x000290, "Member 'UMultiInteractDisplayWidget_C::InteractIcon3' has a wrong offset!");
static_assert(offsetof(UMultiInteractDisplayWidget_C, InteractIcon4) == 0x000298, "Member 'UMultiInteractDisplayWidget_C::InteractIcon4' has a wrong offset!");
static_assert(offsetof(UMultiInteractDisplayWidget_C, Interaction_HBox) == 0x0002A0, "Member 'UMultiInteractDisplayWidget_C::Interaction_HBox' has a wrong offset!");
static_assert(offsetof(UMultiInteractDisplayWidget_C, Text_InteractionCount) == 0x0002A8, "Member 'UMultiInteractDisplayWidget_C::Text_InteractionCount' has a wrong offset!");
static_assert(offsetof(UMultiInteractDisplayWidget_C, VisibilitySwitcher) == 0x0002B0, "Member 'UMultiInteractDisplayWidget_C::VisibilitySwitcher' has a wrong offset!");
static_assert(offsetof(UMultiInteractDisplayWidget_C, bTextVersion) == 0x0002B8, "Member 'UMultiInteractDisplayWidget_C::bTextVersion' has a wrong offset!");

}

