#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Papaya_ServerWarning

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Papaya_ServerWarning.Papaya_ServerWarning_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Papaya_ServerWarning_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Papaya_ServerWarning_C_PreConstruct) == 0x000001, "Wrong alignment on Papaya_ServerWarning_C_PreConstruct");
static_assert(sizeof(Papaya_ServerWarning_C_PreConstruct) == 0x000001, "Wrong size on Papaya_ServerWarning_C_PreConstruct");
static_assert(offsetof(Papaya_ServerWarning_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Papaya_ServerWarning_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Papaya_ServerWarning.Papaya_ServerWarning_C.OnAlertBegin
// 0x0020 (0x0020 - 0x0000)
struct Papaya_ServerWarning_C_OnAlertBegin final
{
public:
	int32                                         SecondsRemainingStart;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SecondsRemainingEnd;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   AlertText;                                         // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Papaya_ServerWarning_C_OnAlertBegin) == 0x000008, "Wrong alignment on Papaya_ServerWarning_C_OnAlertBegin");
static_assert(sizeof(Papaya_ServerWarning_C_OnAlertBegin) == 0x000020, "Wrong size on Papaya_ServerWarning_C_OnAlertBegin");
static_assert(offsetof(Papaya_ServerWarning_C_OnAlertBegin, SecondsRemainingStart) == 0x000000, "Member 'Papaya_ServerWarning_C_OnAlertBegin::SecondsRemainingStart' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_OnAlertBegin, SecondsRemainingEnd) == 0x000004, "Member 'Papaya_ServerWarning_C_OnAlertBegin::SecondsRemainingEnd' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_OnAlertBegin, AlertText) == 0x000008, "Member 'Papaya_ServerWarning_C_OnAlertBegin::AlertText' has a wrong offset!");

// Function Papaya_ServerWarning.Papaya_ServerWarning_C.ExecuteUbergraph_Papaya_ServerWarning
// 0x0240 (0x0240 - 0x0000)
struct Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SecondsRemainingStart;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SecondsRemainingEnd;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_AlertText;                            // 0x0010(0x0018)(ConstParm)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0100(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0148(0x0010)(ReferenceParm)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0160(0x0018)()
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0198(0x0040)(HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01F8(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0218(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning) == 0x000008, "Wrong alignment on Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning");
static_assert(sizeof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning) == 0x000240, "Wrong size on Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, EntryPoint) == 0x000000, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::EntryPoint' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Event_SecondsRemainingStart) == 0x000004, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Event_SecondsRemainingStart' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Event_SecondsRemainingEnd) == 0x000008, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Event_SecondsRemainingEnd' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Event_AlertText) == 0x000010, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Event_AlertText' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, Temp_int_Variable) == 0x000028, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, Temp_byte_Variable) == 0x00002C, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_PlayAnimation_ReturnValue_1) == 0x000048, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_GetEndTime_ReturnValue) == 0x000050, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, Temp_byte_Variable_1) == 0x000054, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_PlayAnimation_ReturnValue_2) == 0x000058, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_GetEndTime_ReturnValue_1) == 0x000060, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, Temp_bool_Variable) == 0x000064, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Select_Default) == 0x000065, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Greater_IntInt_ReturnValue) == 0x000066, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_SelectFloat_ReturnValue) == 0x000068, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_CreateDelegate_OutputDelegate_1) == 0x00006C, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000C8, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeArray_Array) == 0x0000D0, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Divide_IntInt_ReturnValue) == 0x0000E0, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeStruct_FormatArgumentData_1) == 0x000100, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Subtract_IntInt_ReturnValue) == 0x000140, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeArray_Array_1) == 0x000148, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000158, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Format_ReturnValue_1) == 0x000160, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000178, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00017C, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000180, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000188, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_FTrunc_ReturnValue) == 0x00018C, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000190, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeStruct_FormatArgumentData_2) == 0x000198, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_PlayAnimation_ReturnValue_3) == 0x0001D8, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeArray_Array_2) == 0x0001E0, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Less_IntInt_ReturnValue) == 0x0001F0, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Format_ReturnValue_2) == 0x0001F8, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000210, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, Temp_bool_Variable_1) == 0x000211, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Select_Default_1) == 0x000218, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Event_IsDesignTime) == 0x000230, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000238, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function Papaya_ServerWarning.Papaya_ServerWarning_C.CheckTagsForWidgetOffset
// 0x0048 (0x0048 - 0x0000)
struct Papaya_ServerWarning_C_CheckTagsForWidgetOffset final
{
public:
	TArray<struct FGameplayTag>                   GameplayTags;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset) == 0x000008, "Wrong alignment on Papaya_ServerWarning_C_CheckTagsForWidgetOffset");
static_assert(sizeof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset) == 0x000048, "Wrong size on Papaya_ServerWarning_C_CheckTagsForWidgetOffset");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, GameplayTags) == 0x000000, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::GameplayTags' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
