#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Parent_BuildingPropActor

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "DayPhaseFloats_structs.hpp"
#include "BuildingProp_4LayerMaterial_Struct_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Parent_BuildingPropActor.Parent_BuildingPropActor_C
// 0x00E0 (0x0E28 - 0x0D48)
class AParent_BuildingPropActor_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          DebugWind;                                         // 0x0D50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D51[0x7];                                      // 0x0D51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             IntenseWindMaterialsForPreview;                    // 0x0D58(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             OriginalMaterials;                                 // 0x0D68(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UStaticMeshComponent*                   Wind_Intensity_Debug_Mesh;                         // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Debug_TempMaterial;                                // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Debug_Wind_Intensity;                              // 0x0D88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebugWindYaw;                                      // 0x0D8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDayPhaseFloats                        Light_Intensity_Over_Time_of_Day_;                 // 0x0D90(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FDayPhaseFloats                        Emissive_Intensity_Over_Time_of_Day;               // 0x0DA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CodeControlled_NumberOfMaterials;                  // 0x0DB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB4[0x4];                                      // 0x0DB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   CodeControlled_EmissiveColor;                      // 0x0DB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 CodeControlled_LightConeOpacity;                   // 0x0DC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Animate_Emissive_and_Lights_Over_Time;             // 0x0DD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_DD9[0x3];                                      // 0x0DD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Day_Phase_Transition_Length;                       // 0x0DDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_TOD_Lights_and_Material_Emissive_Values;   // 0x0DE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active; // 0x0DE1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE2[0x6];                                      // 0x0DE2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            AlternateShadowStaticMesh;                         // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_An_Alternate_Shadow_Mesh_When_The_Light_is_Off_; // 0x0DF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF1[0x3];                                      // 0x0DF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Volumetric_Light_Scattering_Intensity;             // 0x0DF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cast_Volumetric_Shadows;                           // 0x0DF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate_Lights_With_A_Curve___Disables_time_of_day_light_controls; // 0x0DF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DFA[0x6];                                      // 0x0DFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            LightAnimationCurve;                               // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CodeControlled_Animation_Curve_Animation_Length;   // 0x0E08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate_Mesh_MID_Emissive_Value_with_a_Curve___Disables_time_of_day_light_controls; // 0x0E0C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E0D[0x3];                                      // 0x0E0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Random_Time_Scale_Percent;                         // 0x0E10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CodeControlled_CurrentTimeLength;                  // 0x0E14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBuildingProp_4LayerMaterial_Struct> FourLayerColorInfo;                                // 0x0E18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Call_Animation_Curve_Again();
	void ExecuteUbergraph_Parent_BuildingPropActor(int32 EntryPoint);
	void GetTimeOfDayBlueprintDefaultVariables(struct FTimeOfDayBlueprintDefaultVariables* OutVariables);
	void handleBaseSimple4LayerMaterials(class UMaterialInstanceDynamic* Mid, float Duration, float Start, float End);
	void init_4LayerMaterials();
	void Loop_Animation_Curve();
	void OLD_Set__MID_Values_For_Lights();
	void OnBounceAnimationUpdate(const struct FFortBounceData& Data);
	void OnDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void ReceiveBeginPlay();
	void Set_Light_parameters(float Previous_to_Current_Day_Phase_Alpha);
	void UserConstructionScript();
	void validate_MID_Values_For_Lights_4Layer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Parent_BuildingPropActor_C">();
	}
	static class AParent_BuildingPropActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParent_BuildingPropActor_C>();
	}
};
static_assert(alignof(AParent_BuildingPropActor_C) == 0x000008, "Wrong alignment on AParent_BuildingPropActor_C");
static_assert(sizeof(AParent_BuildingPropActor_C) == 0x000E28, "Wrong size on AParent_BuildingPropActor_C");
static_assert(offsetof(AParent_BuildingPropActor_C, UberGraphFrame) == 0x000D48, "Member 'AParent_BuildingPropActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, DebugWind) == 0x000D50, "Member 'AParent_BuildingPropActor_C::DebugWind' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, IntenseWindMaterialsForPreview) == 0x000D58, "Member 'AParent_BuildingPropActor_C::IntenseWindMaterialsForPreview' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, OriginalMaterials) == 0x000D68, "Member 'AParent_BuildingPropActor_C::OriginalMaterials' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Wind_Intensity_Debug_Mesh) == 0x000D78, "Member 'AParent_BuildingPropActor_C::Wind_Intensity_Debug_Mesh' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Debug_TempMaterial) == 0x000D80, "Member 'AParent_BuildingPropActor_C::Debug_TempMaterial' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Debug_Wind_Intensity) == 0x000D88, "Member 'AParent_BuildingPropActor_C::Debug_Wind_Intensity' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, DebugWindYaw) == 0x000D8C, "Member 'AParent_BuildingPropActor_C::DebugWindYaw' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Light_Intensity_Over_Time_of_Day_) == 0x000D90, "Member 'AParent_BuildingPropActor_C::Light_Intensity_Over_Time_of_Day_' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Emissive_Intensity_Over_Time_of_Day) == 0x000DA0, "Member 'AParent_BuildingPropActor_C::Emissive_Intensity_Over_Time_of_Day' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, CodeControlled_NumberOfMaterials) == 0x000DB0, "Member 'AParent_BuildingPropActor_C::CodeControlled_NumberOfMaterials' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, CodeControlled_EmissiveColor) == 0x000DB8, "Member 'AParent_BuildingPropActor_C::CodeControlled_EmissiveColor' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, CodeControlled_LightConeOpacity) == 0x000DC8, "Member 'AParent_BuildingPropActor_C::CodeControlled_LightConeOpacity' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Animate_Emissive_and_Lights_Over_Time) == 0x000DD8, "Member 'AParent_BuildingPropActor_C::Animate_Emissive_and_Lights_Over_Time' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Day_Phase_Transition_Length) == 0x000DDC, "Member 'AParent_BuildingPropActor_C::Day_Phase_Transition_Length' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Disable_TOD_Lights_and_Material_Emissive_Values) == 0x000DE0, "Member 'AParent_BuildingPropActor_C::Disable_TOD_Lights_and_Material_Emissive_Values' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active) == 0x000DE1, "Member 'AParent_BuildingPropActor_C::Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, AlternateShadowStaticMesh) == 0x000DE8, "Member 'AParent_BuildingPropActor_C::AlternateShadowStaticMesh' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Use_An_Alternate_Shadow_Mesh_When_The_Light_is_Off_) == 0x000DF0, "Member 'AParent_BuildingPropActor_C::Use_An_Alternate_Shadow_Mesh_When_The_Light_is_Off_' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Volumetric_Light_Scattering_Intensity) == 0x000DF4, "Member 'AParent_BuildingPropActor_C::Volumetric_Light_Scattering_Intensity' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Cast_Volumetric_Shadows) == 0x000DF8, "Member 'AParent_BuildingPropActor_C::Cast_Volumetric_Shadows' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Animate_Lights_With_A_Curve___Disables_time_of_day_light_controls) == 0x000DF9, "Member 'AParent_BuildingPropActor_C::Animate_Lights_With_A_Curve___Disables_time_of_day_light_controls' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, LightAnimationCurve) == 0x000E00, "Member 'AParent_BuildingPropActor_C::LightAnimationCurve' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, CodeControlled_Animation_Curve_Animation_Length) == 0x000E08, "Member 'AParent_BuildingPropActor_C::CodeControlled_Animation_Curve_Animation_Length' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Animate_Mesh_MID_Emissive_Value_with_a_Curve___Disables_time_of_day_light_controls) == 0x000E0C, "Member 'AParent_BuildingPropActor_C::Animate_Mesh_MID_Emissive_Value_with_a_Curve___Disables_time_of_day_light_controls' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Random_Time_Scale_Percent) == 0x000E10, "Member 'AParent_BuildingPropActor_C::Random_Time_Scale_Percent' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, CodeControlled_CurrentTimeLength) == 0x000E14, "Member 'AParent_BuildingPropActor_C::CodeControlled_CurrentTimeLength' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, FourLayerColorInfo) == 0x000E18, "Member 'AParent_BuildingPropActor_C::FourLayerColorInfo' has a wrong offset!");

}

