#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPinnedQuestInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerPinnedQuestInfo.PlayerPinnedQuestInfo_C
// 0x0020 (0x02E8 - 0x02C8)
class UPlayerPinnedQuestInfo_C final : public UAthenaPinnedQuestInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_PinnedQuestDesc_RichText;                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_PlayerPinnedQuestInfo(int32 EntryPoint);
	void BP_OnSetPinnedQuestInfo(const int32 Achieved, const int32 Required, const EFortRarity Rarity, const class FText& Description);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerPinnedQuestInfo_C">();
	}
	static class UPlayerPinnedQuestInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerPinnedQuestInfo_C>();
	}
};
static_assert(alignof(UPlayerPinnedQuestInfo_C) == 0x000008, "Wrong alignment on UPlayerPinnedQuestInfo_C");
static_assert(sizeof(UPlayerPinnedQuestInfo_C) == 0x0002E8, "Wrong size on UPlayerPinnedQuestInfo_C");
static_assert(offsetof(UPlayerPinnedQuestInfo_C, UberGraphFrame) == 0x0002C8, "Member 'UPlayerPinnedQuestInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerPinnedQuestInfo_C, Outro) == 0x0002D0, "Member 'UPlayerPinnedQuestInfo_C::Outro' has a wrong offset!");
static_assert(offsetof(UPlayerPinnedQuestInfo_C, Intro) == 0x0002D8, "Member 'UPlayerPinnedQuestInfo_C::Intro' has a wrong offset!");
static_assert(offsetof(UPlayerPinnedQuestInfo_C, Text_PinnedQuestDesc_RichText) == 0x0002E0, "Member 'UPlayerPinnedQuestInfo_C::Text_PinnedQuestDesc_RichText' has a wrong offset!");

}

