#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_WestSausage_PickUpTaker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Prj_WestSausage_PickUpTaker.Prj_WestSausage_PickUpTaker_C.ExecuteUbergraph_Prj_WestSausage_PickUpTaker
// 0x0168 (0x0168 - 0x0000)
struct Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0048(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_AttachedPickup;                 // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker) == 0x000008, "Wrong alignment on Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker");
static_assert(sizeof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker) == 0x000168, "Wrong size on Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, EntryPoint) == 0x000000, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_HasAuthority_ReturnValue_1) == 0x000011, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_GetActorForwardVector_ReturnValue) == 0x000018, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_Add_VectorVector_ReturnValue) == 0x00003C, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000048, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000E4, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, K2Node_CustomEvent_AttachedPickup) == 0x0000E8, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::K2Node_CustomEvent_AttachedPickup' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0000F0, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000FC, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000108, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000114, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000120, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x00012C, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000138, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_Normal_ReturnValue) == 0x000144, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000150, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_VSizeSquared_ReturnValue) == 0x00015C, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_Dot_VectorVector_ReturnValue) == 0x000160, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_Less_FloatFloat_ReturnValue) == 0x000164, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000165, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker, CallFunc_BooleanOR_ReturnValue) == 0x000166, "Member 'Prj_WestSausage_PickUpTaker_C_ExecuteUbergraph_Prj_WestSausage_PickUpTaker::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function Prj_WestSausage_PickUpTaker.Prj_WestSausage_PickUpTaker_C.Init
// 0x0008 (0x0008 - 0x0000)
struct Prj_WestSausage_PickUpTaker_C_Init final
{
public:
	class AActor*                                 AttachedPickup_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_WestSausage_PickUpTaker_C_Init) == 0x000008, "Wrong alignment on Prj_WestSausage_PickUpTaker_C_Init");
static_assert(sizeof(Prj_WestSausage_PickUpTaker_C_Init) == 0x000008, "Wrong size on Prj_WestSausage_PickUpTaker_C_Init");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_Init, AttachedPickup_0) == 0x000000, "Member 'Prj_WestSausage_PickUpTaker_C_Init::AttachedPickup_0' has a wrong offset!");

// Function Prj_WestSausage_PickUpTaker.Prj_WestSausage_PickUpTaker_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prj_WestSausage_PickUpTaker_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_WestSausage_PickUpTaker_C_ReceiveTick) == 0x000004, "Wrong alignment on Prj_WestSausage_PickUpTaker_C_ReceiveTick");
static_assert(sizeof(Prj_WestSausage_PickUpTaker_C_ReceiveTick) == 0x000004, "Wrong size on Prj_WestSausage_PickUpTaker_C_ReceiveTick");
static_assert(offsetof(Prj_WestSausage_PickUpTaker_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prj_WestSausage_PickUpTaker_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

