#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_Bucket_Old

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Prj_Athena_Bucket_Old.Prj_Athena_Bucket_Old_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Prj_Athena_Bucket_Old_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         WaterInteractionComponent_0;                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_Athena_Bucket_Old_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on Prj_Athena_Bucket_Old_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(Prj_Athena_Bucket_Old_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on Prj_Athena_Bucket_Old_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'Prj_Athena_Bucket_Old_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature, WaterInteractionComponent_0) == 0x000008, "Member 'Prj_Athena_Bucket_Old_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature::WaterInteractionComponent_0' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'Prj_Athena_Bucket_Old_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function Prj_Athena_Bucket_Old.Prj_Athena_Bucket_Old_C.ExecuteUbergraph_Prj_Athena_Bucket_Old
// 0x0260 (0x0260 - 0x0000)
struct Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0048(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x0190(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x01A0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          Temp_object_Variable;                              // 0x0210(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInWater_ReturnValue;                    // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233[0x1];                                      // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            CallFunc_K2_SpawnPickupInWorld_ReturnValue;        // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old) == 0x000008, "Wrong alignment on Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old");
static_assert(sizeof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old) == 0x000260, "Wrong size on Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, EntryPoint) == 0x000000, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, Temp_bool_Variable) == 0x000004, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_Event_MyComp) == 0x000008, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_Event_Other) == 0x000010, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_Event_OtherComp) == 0x000018, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_Event_bSelfMoved) == 0x000020, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_Event_HitLocation) == 0x000024, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_Event_HitNormal) == 0x000030, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_Event_NormalImpulse) == 0x00003C, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_Event_Hit) == 0x000048, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_bBlockingHit) == 0x0000E4, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000E5, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_Time) == 0x0000E8, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_Distance) == 0x0000EC, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_Location) == 0x0000F0, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_ImpactPoint) == 0x0000FC, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_Normal) == 0x000108, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_ImpactNormal) == 0x000114, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_PhysMat) == 0x000120, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_HitActor) == 0x000128, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_HitComponent) == 0x000130, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_HitBoneName) == 0x000138, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_BoneName) == 0x000140, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_HitItem) == 0x000148, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_ElementIndex) == 0x00014C, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_FaceIndex) == 0x000150, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_TraceStart) == 0x000154, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_BreakHitResult_TraceEnd) == 0x000160, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_DynamicCast_AsFort_Pawn) == 0x000170, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_IsServer_ReturnValue) == 0x000179, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00017C, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, Temp_bool_IsClosed_Variable) == 0x000188, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_Event_HitActors) == 0x000190, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_Event_HitResults) == 0x0001A0, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_ComponentBoundEvent_WaterBody) == 0x0001B0, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x0001B8, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x0001C0, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_GetActorForwardVector_ReturnValue) == 0x0001C4, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001D0, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0001DC, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_MakeArray_Array) == 0x0001E8, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_GetActorTeam_ReturnValue) == 0x0001F8, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_GetInstigator_ReturnValue) == 0x000200, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_IsServer_ReturnValue_1) == 0x000208, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, Temp_object_Variable) == 0x000210, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_IsServer_ReturnValue_2) == 0x000220, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000224, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, Temp_bool_IsClosed_Variable_1) == 0x000230, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_IsInWater_ReturnValue) == 0x000231, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_IsInWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, Temp_bool_Has_Been_Initd_Variable_1) == 0x000232, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000234, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_Add_VectorVector_ReturnValue) == 0x000240, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, K2Node_Select_Default) == 0x00024C, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old, CallFunc_K2_SpawnPickupInWorld_ReturnValue) == 0x000258, "Member 'Prj_Athena_Bucket_Old_C_ExecuteUbergraph_Prj_Athena_Bucket_Old::CallFunc_K2_SpawnPickupInWorld_ReturnValue' has a wrong offset!");

// Function Prj_Athena_Bucket_Old.Prj_Athena_Bucket_Old_C.OnExploded
// 0x0020 (0x0020 - 0x0000)
struct Prj_Athena_Bucket_Old_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Prj_Athena_Bucket_Old_C_OnExploded) == 0x000008, "Wrong alignment on Prj_Athena_Bucket_Old_C_OnExploded");
static_assert(sizeof(Prj_Athena_Bucket_Old_C_OnExploded) == 0x000020, "Wrong size on Prj_Athena_Bucket_Old_C_OnExploded");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_OnExploded, HitActors) == 0x000000, "Member 'Prj_Athena_Bucket_Old_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_OnExploded, HitResults) == 0x000010, "Member 'Prj_Athena_Bucket_Old_C_OnExploded::HitResults' has a wrong offset!");

// Function Prj_Athena_Bucket_Old.Prj_Athena_Bucket_Old_C.ReceiveHit
// 0x00E0 (0x00E0 - 0x0000)
struct Prj_Athena_Bucket_Old_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prj_Athena_Bucket_Old_C_ReceiveHit) == 0x000008, "Wrong alignment on Prj_Athena_Bucket_Old_C_ReceiveHit");
static_assert(sizeof(Prj_Athena_Bucket_Old_C_ReceiveHit) == 0x0000E0, "Wrong size on Prj_Athena_Bucket_Old_C_ReceiveHit");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ReceiveHit, MyComp) == 0x000000, "Member 'Prj_Athena_Bucket_Old_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ReceiveHit, Other) == 0x000008, "Member 'Prj_Athena_Bucket_Old_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Old_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Prj_Athena_Bucket_Old_C_ReceiveHit::OtherComp' has a wrong offset!");
