#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_WestSausage_PickUpTaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_WestSausage_PickUpTaker.Prj_WestSausage_PickUpTaker_C
// 0x0038 (0x0900 - 0x08C8)
class APrj_WestSausage_PickUpTaker_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Done;                                              // 0x08D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1[0x7];                                      // 0x08D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AttachedPickup;                                    // 0x08D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Move;                                              // 0x08E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E1[0x3];                                      // 0x08E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OriginalVel;                                       // 0x08E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VecToPlayer;                                       // 0x08F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_WestSausage_PickUpTaker(int32 EntryPoint);
	void Init(class AActor* AttachedPickup_0);
	void ReceiveTick(float DeltaSeconds);
	void StartMoving();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_WestSausage_PickUpTaker_C">();
	}
	static class APrj_WestSausage_PickUpTaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_WestSausage_PickUpTaker_C>();
	}
};
static_assert(alignof(APrj_WestSausage_PickUpTaker_C) == 0x000008, "Wrong alignment on APrj_WestSausage_PickUpTaker_C");
static_assert(sizeof(APrj_WestSausage_PickUpTaker_C) == 0x000900, "Wrong size on APrj_WestSausage_PickUpTaker_C");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, UberGraphFrame) == 0x0008C8, "Member 'APrj_WestSausage_PickUpTaker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, Done) == 0x0008D0, "Member 'APrj_WestSausage_PickUpTaker_C::Done' has a wrong offset!");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, AttachedPickup) == 0x0008D8, "Member 'APrj_WestSausage_PickUpTaker_C::AttachedPickup' has a wrong offset!");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, Move) == 0x0008E0, "Member 'APrj_WestSausage_PickUpTaker_C::Move' has a wrong offset!");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, OriginalVel) == 0x0008E4, "Member 'APrj_WestSausage_PickUpTaker_C::OriginalVel' has a wrong offset!");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, VecToPlayer) == 0x0008F0, "Member 'APrj_WestSausage_PickUpTaker_C::VecToPlayer' has a wrong offset!");

}

