#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_Rock_01

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_Rock_01.Prop_Rock_01_C
// 0x0028 (0x0D70 - 0x0D48)
class AProp_Rock_01_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           RandomColor_A;                                     // 0x0D50(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RandomColor_B;                                     // 0x0D60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prop_Rock_01(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_Rock_01_C">();
	}
	static class AProp_Rock_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_Rock_01_C>();
	}
};
static_assert(alignof(AProp_Rock_01_C) == 0x000008, "Wrong alignment on AProp_Rock_01_C");
static_assert(sizeof(AProp_Rock_01_C) == 0x000D70, "Wrong size on AProp_Rock_01_C");
static_assert(offsetof(AProp_Rock_01_C, UberGraphFrame) == 0x000D48, "Member 'AProp_Rock_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProp_Rock_01_C, RandomColor_A) == 0x000D50, "Member 'AProp_Rock_01_C::RandomColor_A' has a wrong offset!");
static_assert(offsetof(AProp_Rock_01_C, RandomColor_B) == 0x000D60, "Member 'AProp_Rock_01_C::RandomColor_B' has a wrong offset!");

}

