#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuartzMusic_IOandSeven

#include "Basic.hpp"

#include "DataTrackerParameterData_structs.hpp"


namespace SDK::Params
{

// Function QuartzMusic_IOandSeven.QuartzMusic_IOandSeven_C.ExecuteUbergraph_QuartzMusic_IOandSeven
// 0x0014 (0x0014 - 0x0000)
struct QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSevenValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIOValue_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBaseValue_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUnawareValue_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven) == 0x000004, "Wrong alignment on QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven");
static_assert(sizeof(QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven) == 0x000014, "Wrong size on QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven");
static_assert(offsetof(QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven, EntryPoint) == 0x000000, "Member 'QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven, CallFunc_GetSevenValue_ReturnValue) == 0x000004, "Member 'QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven::CallFunc_GetSevenValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven, CallFunc_GetIOValue_ReturnValue) == 0x000008, "Member 'QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven::CallFunc_GetIOValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven, CallFunc_GetBaseValue_ReturnValue) == 0x00000C, "Member 'QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven::CallFunc_GetBaseValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven, CallFunc_GetUnawareValue_ReturnValue) == 0x000010, "Member 'QuartzMusic_IOandSeven_C_ExecuteUbergraph_QuartzMusic_IOandSeven::CallFunc_GetUnawareValue_ReturnValue' has a wrong offset!");

// Function QuartzMusic_IOandSeven.QuartzMusic_IOandSeven_C.GetBaseValue
// 0x0024 (0x0024 - 0x0000)
struct QuartzMusic_IOandSeven_C_GetBaseValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTrackerParameterValue_Value;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTrackerParameterValue_Value_1;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTrackerParameterValue_Value_2;     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTrackerParameterValue_Value_3;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuartzMusic_IOandSeven_C_GetBaseValue) == 0x000004, "Wrong alignment on QuartzMusic_IOandSeven_C_GetBaseValue");
static_assert(sizeof(QuartzMusic_IOandSeven_C_GetBaseValue) == 0x000024, "Wrong size on QuartzMusic_IOandSeven_C_GetBaseValue");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetBaseValue, ReturnValue) == 0x000000, "Member 'QuartzMusic_IOandSeven_C_GetBaseValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetBaseValue, CallFunc_GetDataTrackerParameterValue_Value) == 0x000004, "Member 'QuartzMusic_IOandSeven_C_GetBaseValue::CallFunc_GetDataTrackerParameterValue_Value' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetBaseValue, CallFunc_GetDataTrackerParameterValue_Value_1) == 0x000008, "Member 'QuartzMusic_IOandSeven_C_GetBaseValue::CallFunc_GetDataTrackerParameterValue_Value_1' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetBaseValue, CallFunc_GetDataTrackerParameterValue_Value_2) == 0x00000C, "Member 'QuartzMusic_IOandSeven_C_GetBaseValue::CallFunc_GetDataTrackerParameterValue_Value_2' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetBaseValue, CallFunc_GetDataTrackerParameterValue_Value_3) == 0x000010, "Member 'QuartzMusic_IOandSeven_C_GetBaseValue::CallFunc_GetDataTrackerParameterValue_Value_3' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetBaseValue, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'QuartzMusic_IOandSeven_C_GetBaseValue::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetBaseValue, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000018, "Member 'QuartzMusic_IOandSeven_C_GetBaseValue::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetBaseValue, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00001C, "Member 'QuartzMusic_IOandSeven_C_GetBaseValue::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetBaseValue, CallFunc_MapRangeClamped_ReturnValue) == 0x000020, "Member 'QuartzMusic_IOandSeven_C_GetBaseValue::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function QuartzMusic_IOandSeven.QuartzMusic_IOandSeven_C.GetDataTrackerParameter
// 0x0020 (0x0020 - 0x0000)
struct QuartzMusic_IOandSeven_C_GetDataTrackerParameter final
{
public:
	int32                                         DataTrackerIndex;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReleaseSpeed;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTrackerParameterData              CallFunc_Array_Get_Item;                           // 0x0008(0x0018)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuartzMusic_IOandSeven_C_GetDataTrackerParameter) == 0x000004, "Wrong alignment on QuartzMusic_IOandSeven_C_GetDataTrackerParameter");
static_assert(sizeof(QuartzMusic_IOandSeven_C_GetDataTrackerParameter) == 0x000020, "Wrong size on QuartzMusic_IOandSeven_C_GetDataTrackerParameter");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetDataTrackerParameter, DataTrackerIndex) == 0x000000, "Member 'QuartzMusic_IOandSeven_C_GetDataTrackerParameter::DataTrackerIndex' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetDataTrackerParameter, ReleaseSpeed) == 0x000004, "Member 'QuartzMusic_IOandSeven_C_GetDataTrackerParameter::ReleaseSpeed' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetDataTrackerParameter, CallFunc_Array_Get_Item) == 0x000008, "Member 'QuartzMusic_IOandSeven_C_GetDataTrackerParameter::CallFunc_Array_Get_Item' has a wrong offset!");

// Function QuartzMusic_IOandSeven.QuartzMusic_IOandSeven_C.GetIOValue
// 0x0014 (0x0014 - 0x0000)
struct QuartzMusic_IOandSeven_C_GetIOValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTrackerParameterValue_Value;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTrackerParameterValue_Value_1;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuartzMusic_IOandSeven_C_GetIOValue) == 0x000004, "Wrong alignment on QuartzMusic_IOandSeven_C_GetIOValue");
static_assert(sizeof(QuartzMusic_IOandSeven_C_GetIOValue) == 0x000014, "Wrong size on QuartzMusic_IOandSeven_C_GetIOValue");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetIOValue, ReturnValue) == 0x000000, "Member 'QuartzMusic_IOandSeven_C_GetIOValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetIOValue, CallFunc_GetDataTrackerParameterValue_Value) == 0x000004, "Member 'QuartzMusic_IOandSeven_C_GetIOValue::CallFunc_GetDataTrackerParameterValue_Value' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetIOValue, CallFunc_GetDataTrackerParameterValue_Value_1) == 0x000008, "Member 'QuartzMusic_IOandSeven_C_GetIOValue::CallFunc_GetDataTrackerParameterValue_Value_1' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetIOValue, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'QuartzMusic_IOandSeven_C_GetIOValue::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetIOValue, CallFunc_MapRangeClamped_ReturnValue) == 0x000010, "Member 'QuartzMusic_IOandSeven_C_GetIOValue::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function QuartzMusic_IOandSeven.QuartzMusic_IOandSeven_C.GetSevenValue
// 0x0014 (0x0014 - 0x0000)
struct QuartzMusic_IOandSeven_C_GetSevenValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTrackerParameterValue_Value;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTrackerParameterValue_Value_1;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuartzMusic_IOandSeven_C_GetSevenValue) == 0x000004, "Wrong alignment on QuartzMusic_IOandSeven_C_GetSevenValue");
static_assert(sizeof(QuartzMusic_IOandSeven_C_GetSevenValue) == 0x000014, "Wrong size on QuartzMusic_IOandSeven_C_GetSevenValue");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetSevenValue, ReturnValue) == 0x000000, "Member 'QuartzMusic_IOandSeven_C_GetSevenValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetSevenValue, CallFunc_GetDataTrackerParameterValue_Value) == 0x000004, "Member 'QuartzMusic_IOandSeven_C_GetSevenValue::CallFunc_GetDataTrackerParameterValue_Value' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetSevenValue, CallFunc_GetDataTrackerParameterValue_Value_1) == 0x000008, "Member 'QuartzMusic_IOandSeven_C_GetSevenValue::CallFunc_GetDataTrackerParameterValue_Value_1' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetSevenValue, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'QuartzMusic_IOandSeven_C_GetSevenValue::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetSevenValue, CallFunc_MapRangeClamped_ReturnValue) == 0x000010, "Member 'QuartzMusic_IOandSeven_C_GetSevenValue::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function QuartzMusic_IOandSeven.QuartzMusic_IOandSeven_C.GetUnawareValue
// 0x000C (0x000C - 0x0000)
struct QuartzMusic_IOandSeven_C_GetUnawareValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTrackerParameterValue_Value;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuartzMusic_IOandSeven_C_GetUnawareValue) == 0x000004, "Wrong alignment on QuartzMusic_IOandSeven_C_GetUnawareValue");
static_assert(sizeof(QuartzMusic_IOandSeven_C_GetUnawareValue) == 0x00000C, "Wrong size on QuartzMusic_IOandSeven_C_GetUnawareValue");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetUnawareValue, ReturnValue) == 0x000000, "Member 'QuartzMusic_IOandSeven_C_GetUnawareValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetUnawareValue, CallFunc_GetDataTrackerParameterValue_Value) == 0x000004, "Member 'QuartzMusic_IOandSeven_C_GetUnawareValue::CallFunc_GetDataTrackerParameterValue_Value' has a wrong offset!");
static_assert(offsetof(QuartzMusic_IOandSeven_C_GetUnawareValue, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'QuartzMusic_IOandSeven_C_GetUnawareValue::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

}

