#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestUpdateEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestUpdateEntry.QuestUpdateEntry_C
// 0x0030 (0x0310 - 0x02E0)
class UQuestUpdateEntry_C final : public UFortQuestUpdateEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          OuterBorder;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestName;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separator;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UQuestUpdateEntry_C* UpdateWidget)> AllQuestUpdatesFinished_0;                         // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void StartQuestIntroBP();
	void StartQuestIntro();
	void SetupAsAnnouncement();
	void QuestItemSet(class UFortQuestItem* QuestItemToCheck);
	void ExecuteUbergraph_QuestUpdateEntry(int32 EntryPoint);
	void StartQuestOutro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestUpdateEntry_C">();
	}
	static class UQuestUpdateEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestUpdateEntry_C>();
	}
};
static_assert(alignof(UQuestUpdateEntry_C) == 0x000010, "Wrong alignment on UQuestUpdateEntry_C");
static_assert(sizeof(UQuestUpdateEntry_C) == 0x000310, "Wrong size on UQuestUpdateEntry_C");
static_assert(offsetof(UQuestUpdateEntry_C, UberGraphFrame) == 0x0002E0, "Member 'UQuestUpdateEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, OuterBorder) == 0x0002E8, "Member 'UQuestUpdateEntry_C::OuterBorder' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, QuestName) == 0x0002F0, "Member 'UQuestUpdateEntry_C::QuestName' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, Separator) == 0x0002F8, "Member 'UQuestUpdateEntry_C::Separator' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, AllQuestUpdatesFinished_0) == 0x000300, "Member 'UQuestUpdateEntry_C::AllQuestUpdatesFinished_0' has a wrong offset!");

}

