#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReceivedItemNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReceivedItemNotification.ReceivedItemNotification_C
// 0x0040 (0x0310 - 0x02D0)
class UReceivedItemNotification_C final : public UFortNotificationEntry_ReceivedItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RewardUnlocked;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Backing;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Reward_Glow;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RewardFlare;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFortRarity                                   DevRarity;                                         // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IntroSpeed;                                        // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateVisuals(const class UFortItemDefinition* RewardItem, int32 ItemQuantity);
	void StartNotificationOutro();
	void StartNotificationIntro();
	void RarityVisuals(EFortRarity Rarity);
	void PreConstruct(bool IsDesignTime);
	void Intro_FInished();
	void ExecuteUbergraph_ReceivedItemNotification(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReceivedItemNotification_C">();
	}
	static class UReceivedItemNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReceivedItemNotification_C>();
	}
};
static_assert(alignof(UReceivedItemNotification_C) == 0x000008, "Wrong alignment on UReceivedItemNotification_C");
static_assert(sizeof(UReceivedItemNotification_C) == 0x000310, "Wrong size on UReceivedItemNotification_C");
static_assert(offsetof(UReceivedItemNotification_C, UberGraphFrame) == 0x0002D0, "Member 'UReceivedItemNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReceivedItemNotification_C, Outro) == 0x0002D8, "Member 'UReceivedItemNotification_C::Outro' has a wrong offset!");
static_assert(offsetof(UReceivedItemNotification_C, Intro) == 0x0002E0, "Member 'UReceivedItemNotification_C::Intro' has a wrong offset!");
static_assert(offsetof(UReceivedItemNotification_C, RewardUnlocked) == 0x0002E8, "Member 'UReceivedItemNotification_C::RewardUnlocked' has a wrong offset!");
static_assert(offsetof(UReceivedItemNotification_C, Backing) == 0x0002F0, "Member 'UReceivedItemNotification_C::Backing' has a wrong offset!");
static_assert(offsetof(UReceivedItemNotification_C, Reward_Glow) == 0x0002F8, "Member 'UReceivedItemNotification_C::Reward_Glow' has a wrong offset!");
static_assert(offsetof(UReceivedItemNotification_C, RewardFlare) == 0x000300, "Member 'UReceivedItemNotification_C::RewardFlare' has a wrong offset!");
static_assert(offsetof(UReceivedItemNotification_C, DevRarity) == 0x000308, "Member 'UReceivedItemNotification_C::DevRarity' has a wrong offset!");
static_assert(offsetof(UReceivedItemNotification_C, IntroSpeed) == 0x00030C, "Member 'UReceivedItemNotification_C::IntroSpeed' has a wrong offset!");

}

