#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedDotAR_Core_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass RedDotAR_Core_AnimBP.RedDotAR_Core_AnimBP_C
// 0x00C0 (0x03E0 - 0x0320)
class URedDotAR_Core_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0338(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0358(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03A0(0x0040)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_RedDotAR_Core_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RedDotAR_Core_AnimBP_C">();
	}
	static class URedDotAR_Core_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedDotAR_Core_AnimBP_C>();
	}
};
static_assert(alignof(URedDotAR_Core_AnimBP_C) == 0x000010, "Wrong alignment on URedDotAR_Core_AnimBP_C");
static_assert(sizeof(URedDotAR_Core_AnimBP_C) == 0x0003E0, "Wrong size on URedDotAR_Core_AnimBP_C");
static_assert(offsetof(URedDotAR_Core_AnimBP_C, UberGraphFrame) == 0x000320, "Member 'URedDotAR_Core_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URedDotAR_Core_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'URedDotAR_Core_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(URedDotAR_Core_AnimBP_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'URedDotAR_Core_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(URedDotAR_Core_AnimBP_C, AnimGraphNode_Root) == 0x000338, "Member 'URedDotAR_Core_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(URedDotAR_Core_AnimBP_C, AnimGraphNode_Slot) == 0x000358, "Member 'URedDotAR_Core_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(URedDotAR_Core_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x0003A0, "Member 'URedDotAR_Core_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

