#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rejuvenation_Potion_Gadget_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Rejuvenation_Potion_Gadget_AnimBP.Rejuvenation_Potion_Gadget_AnimBP_C
// 0x00C0 (0x03E0 - 0x0320)
class URejuvenation_Potion_Gadget_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0338(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0358(0x0040)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0398(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Rejuvenation_Potion_Gadget_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Rejuvenation_Potion_Gadget_AnimBP_C">();
	}
	static class URejuvenation_Potion_Gadget_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URejuvenation_Potion_Gadget_AnimBP_C>();
	}
};
static_assert(alignof(URejuvenation_Potion_Gadget_AnimBP_C) == 0x000010, "Wrong alignment on URejuvenation_Potion_Gadget_AnimBP_C");
static_assert(sizeof(URejuvenation_Potion_Gadget_AnimBP_C) == 0x0003E0, "Wrong size on URejuvenation_Potion_Gadget_AnimBP_C");
static_assert(offsetof(URejuvenation_Potion_Gadget_AnimBP_C, UberGraphFrame) == 0x000320, "Member 'URejuvenation_Potion_Gadget_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URejuvenation_Potion_Gadget_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'URejuvenation_Potion_Gadget_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(URejuvenation_Potion_Gadget_AnimBP_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'URejuvenation_Potion_Gadget_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(URejuvenation_Potion_Gadget_AnimBP_C, AnimGraphNode_Root) == 0x000338, "Member 'URejuvenation_Potion_Gadget_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(URejuvenation_Potion_Gadget_AnimBP_C, AnimGraphNode_SequenceEvaluator) == 0x000358, "Member 'URejuvenation_Potion_Gadget_AnimBP_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(URejuvenation_Potion_Gadget_AnimBP_C, AnimGraphNode_Slot) == 0x000398, "Member 'URejuvenation_Potion_Gadget_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");

}

