#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ResourceCountWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ResourceCountWidget.ResourceCountWidget_C.UpdateIcon
// 0x0250 (0x0250 - 0x0000)
struct ResourceCountWidget_C_UpdateIcon final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromResource_Brush;              // 0x0030(0x00B0)()
	bool                                          CallFunc_MakeBrushFromResource_IsValid;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_SetFieldsInStruct_StructOut;                // 0x00F0(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x01A0(0x00B0)(ConstParm)
};
static_assert(alignof(ResourceCountWidget_C_UpdateIcon) == 0x000010, "Wrong alignment on ResourceCountWidget_C_UpdateIcon");
static_assert(sizeof(ResourceCountWidget_C_UpdateIcon) == 0x000250, "Wrong size on ResourceCountWidget_C_UpdateIcon");
static_assert(offsetof(ResourceCountWidget_C_UpdateIcon, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'ResourceCountWidget_C_UpdateIcon::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_UpdateIcon, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'ResourceCountWidget_C_UpdateIcon::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_UpdateIcon, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'ResourceCountWidget_C_UpdateIcon::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_UpdateIcon, Temp_bool_Variable) == 0x000020, "Member 'ResourceCountWidget_C_UpdateIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_UpdateIcon, CallFunc_MakeBrushFromResource_Brush) == 0x000030, "Member 'ResourceCountWidget_C_UpdateIcon::CallFunc_MakeBrushFromResource_Brush' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_UpdateIcon, CallFunc_MakeBrushFromResource_IsValid) == 0x0000E0, "Member 'ResourceCountWidget_C_UpdateIcon::CallFunc_MakeBrushFromResource_IsValid' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_UpdateIcon, K2Node_SetFieldsInStruct_StructOut) == 0x0000F0, "Member 'ResourceCountWidget_C_UpdateIcon::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_UpdateIcon, K2Node_Select_Default) == 0x0001A0, "Member 'ResourceCountWidget_C_UpdateIcon::K2Node_Select_Default' has a wrong offset!");

// Function ResourceCountWidget.ResourceCountWidget_C.SetResourceCost
// 0x01C0 (0x01C0 - 0x0000)
struct ResourceCountWidget_C_SetResourceCost final
{
public:
	int32                                         ResourceCount_0;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBackgroundForAffordabilityFeedback_0;           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0xE];                                       // 0x0012(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0020(0x00B0)()
	bool                                          Temp_bool_Variable_1;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetResourceCount_ReturnValue;             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x00DC(0x0014)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x00F0(0x00B0)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x01A0(0x0014)()
};
static_assert(alignof(ResourceCountWidget_C_SetResourceCost) == 0x000010, "Wrong alignment on ResourceCountWidget_C_SetResourceCost");
static_assert(sizeof(ResourceCountWidget_C_SetResourceCost) == 0x0001C0, "Wrong size on ResourceCountWidget_C_SetResourceCost");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, ResourceCount_0) == 0x000000, "Member 'ResourceCountWidget_C_SetResourceCost::ResourceCount_0' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, UseBackgroundForAffordabilityFeedback_0) == 0x000004, "Member 'ResourceCountWidget_C_SetResourceCost::UseBackgroundForAffordabilityFeedback_0' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'ResourceCountWidget_C_SetResourceCost::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, Temp_bool_Variable) == 0x000010, "Member 'ResourceCountWidget_C_SetResourceCost::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'ResourceCountWidget_C_SetResourceCost::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, K2Node_MakeStruct_SlateBrush) == 0x000020, "Member 'ResourceCountWidget_C_SetResourceCost::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, Temp_bool_Variable_1) == 0x0000D0, "Member 'ResourceCountWidget_C_SetResourceCost::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, CallFunc_GetResourceCount_ReturnValue) == 0x0000D4, "Member 'ResourceCountWidget_C_SetResourceCost::CallFunc_GetResourceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'ResourceCountWidget_C_SetResourceCost::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, K2Node_Select_Default) == 0x0000DC, "Member 'ResourceCountWidget_C_SetResourceCost::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, K2Node_MakeStruct_SlateBrush_1) == 0x0000F0, "Member 'ResourceCountWidget_C_SetResourceCost::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_SetResourceCost, K2Node_Select_Default_1) == 0x0001A0, "Member 'ResourceCountWidget_C_SetResourceCost::K2Node_Select_Default_1' has a wrong offset!");

// Function ResourceCountWidget.ResourceCountWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ResourceCountWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ResourceCountWidget_C_PreConstruct) == 0x000001, "Wrong alignment on ResourceCountWidget_C_PreConstruct");
static_assert(sizeof(ResourceCountWidget_C_PreConstruct) == 0x000001, "Wrong size on ResourceCountWidget_C_PreConstruct");
static_assert(offsetof(ResourceCountWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ResourceCountWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ResourceCountWidget.ResourceCountWidget_C.ExecuteUbergraph_ResourceCountWidget
// 0x0008 (0x0008 - 0x0000)
struct ResourceCountWidget_C_ExecuteUbergraph_ResourceCountWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ResourceCountWidget_C_ExecuteUbergraph_ResourceCountWidget) == 0x000004, "Wrong alignment on ResourceCountWidget_C_ExecuteUbergraph_ResourceCountWidget");
static_assert(sizeof(ResourceCountWidget_C_ExecuteUbergraph_ResourceCountWidget) == 0x000008, "Wrong size on ResourceCountWidget_C_ExecuteUbergraph_ResourceCountWidget");
static_assert(offsetof(ResourceCountWidget_C_ExecuteUbergraph_ResourceCountWidget, EntryPoint) == 0x000000, "Member 'ResourceCountWidget_C_ExecuteUbergraph_ResourceCountWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ResourceCountWidget_C_ExecuteUbergraph_ResourceCountWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'ResourceCountWidget_C_ExecuteUbergraph_ResourceCountWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

}

