#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shotgun_Core_RapidFire_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Shotgun_Core_RapidFire_AnimBP.Shotgun_Core_RapidFire_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00D7 (0x00D8 - 0x0001)
struct Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_7;                                    // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_8;                                    // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_9;                                  // 0x0018(0x0020)(NoDestructor)
	ERefPoseType                                  ByteProperty_10;                                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0040(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C0(0x0018)()
};
static_assert(alignof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000D8, "Wrong size on Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_7) == 0x000004, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_7' has a wrong offset!");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_8) == 0x00000C, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_8' has a wrong offset!");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_9) == 0x000018, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_9' has a wrong offset!");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_10) == 0x000038, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_10' has a wrong offset!");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000040, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C0, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

