#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Slurp_Jellyfish_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Slurp_Jellyfish_AnimBP.Slurp_Jellyfish_AnimBP_C
// 0x0880 (0x0BA0 - 0x0320)
class USlurp_Jellyfish_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0338(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0358(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0378(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x03B0(0x07F0)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Slurp_Jellyfish_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Slurp_Jellyfish_AnimBP_C">();
	}
	static class USlurp_Jellyfish_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlurp_Jellyfish_AnimBP_C>();
	}
};
static_assert(alignof(USlurp_Jellyfish_AnimBP_C) == 0x000010, "Wrong alignment on USlurp_Jellyfish_AnimBP_C");
static_assert(sizeof(USlurp_Jellyfish_AnimBP_C) == 0x000BA0, "Wrong size on USlurp_Jellyfish_AnimBP_C");
static_assert(offsetof(USlurp_Jellyfish_AnimBP_C, UberGraphFrame) == 0x000320, "Member 'USlurp_Jellyfish_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USlurp_Jellyfish_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'USlurp_Jellyfish_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USlurp_Jellyfish_AnimBP_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'USlurp_Jellyfish_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(USlurp_Jellyfish_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000338, "Member 'USlurp_Jellyfish_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USlurp_Jellyfish_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000358, "Member 'USlurp_Jellyfish_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USlurp_Jellyfish_AnimBP_C, AnimGraphNode_LocalRefPose) == 0x000378, "Member 'USlurp_Jellyfish_AnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(USlurp_Jellyfish_AnimBP_C, AnimGraphNode_Root) == 0x000388, "Member 'USlurp_Jellyfish_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USlurp_Jellyfish_AnimBP_C, AnimGraphNode_RigidBody) == 0x0003B0, "Member 'USlurp_Jellyfish_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");

}

