#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SourdropperRoundStatusMeeple

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SourdropperRoundStatusMeeple.SourdropperRoundStatusMeeple_C.Update
// 0x0010 (0x0010 - 0x0000)
struct SourdropperRoundStatusMeeple_C_Update final
{
public:
	struct FLinearColor                           CallFunc_GetColor_Color;                           // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusMeeple_C_Update) == 0x000004, "Wrong alignment on SourdropperRoundStatusMeeple_C_Update");
static_assert(sizeof(SourdropperRoundStatusMeeple_C_Update) == 0x000010, "Wrong size on SourdropperRoundStatusMeeple_C_Update");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_Update, CallFunc_GetColor_Color) == 0x000000, "Member 'SourdropperRoundStatusMeeple_C_Update::CallFunc_GetColor_Color' has a wrong offset!");

// Function SourdropperRoundStatusMeeple.SourdropperRoundStatusMeeple_C.SetTeamAffiliation
// 0x0002 (0x0002 - 0x0000)
struct SourdropperRoundStatusMeeple_C_SetTeamAffiliation final
{
public:
	EFortTeamAffiliation                          InTeamAffiliation;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusMeeple_C_SetTeamAffiliation) == 0x000001, "Wrong alignment on SourdropperRoundStatusMeeple_C_SetTeamAffiliation");
static_assert(sizeof(SourdropperRoundStatusMeeple_C_SetTeamAffiliation) == 0x000002, "Wrong size on SourdropperRoundStatusMeeple_C_SetTeamAffiliation");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetTeamAffiliation, InTeamAffiliation) == 0x000000, "Member 'SourdropperRoundStatusMeeple_C_SetTeamAffiliation::InTeamAffiliation' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetTeamAffiliation, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'SourdropperRoundStatusMeeple_C_SetTeamAffiliation::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function SourdropperRoundStatusMeeple.SourdropperRoundStatusMeeple_C.SetIconSize
// 0x0010 (0x0010 - 0x0000)
struct SourdropperRoundStatusMeeple_C_SetIconSize final
{
public:
	struct FVector2D                              IconSize;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusMeeple_C_SetIconSize) == 0x000004, "Wrong alignment on SourdropperRoundStatusMeeple_C_SetIconSize");
static_assert(sizeof(SourdropperRoundStatusMeeple_C_SetIconSize) == 0x000010, "Wrong size on SourdropperRoundStatusMeeple_C_SetIconSize");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetIconSize, IconSize) == 0x000000, "Member 'SourdropperRoundStatusMeeple_C_SetIconSize::IconSize' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetIconSize, CallFunc_BreakVector2D_X) == 0x000008, "Member 'SourdropperRoundStatusMeeple_C_SetIconSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetIconSize, CallFunc_BreakVector2D_Y) == 0x00000C, "Member 'SourdropperRoundStatusMeeple_C_SetIconSize::CallFunc_BreakVector2D_Y' has a wrong offset!");

// Function SourdropperRoundStatusMeeple.SourdropperRoundStatusMeeple_C.SetAlive
// 0x0038 (0x0038 - 0x0000)
struct SourdropperRoundStatusMeeple_C_SetAlive final
{
public:
	bool                                          bInAlive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSkipAnimations;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusMeeple_C_SetAlive) == 0x000008, "Wrong alignment on SourdropperRoundStatusMeeple_C_SetAlive");
static_assert(sizeof(SourdropperRoundStatusMeeple_C_SetAlive) == 0x000038, "Wrong size on SourdropperRoundStatusMeeple_C_SetAlive");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetAlive, bInAlive) == 0x000000, "Member 'SourdropperRoundStatusMeeple_C_SetAlive::bInAlive' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetAlive, bSkipAnimations) == 0x000001, "Member 'SourdropperRoundStatusMeeple_C_SetAlive::bSkipAnimations' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetAlive, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SourdropperRoundStatusMeeple_C_SetAlive::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetAlive, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'SourdropperRoundStatusMeeple_C_SetAlive::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetAlive, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'SourdropperRoundStatusMeeple_C_SetAlive::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetAlive, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'SourdropperRoundStatusMeeple_C_SetAlive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetAlive, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'SourdropperRoundStatusMeeple_C_SetAlive::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetAlive, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000030, "Member 'SourdropperRoundStatusMeeple_C_SetAlive::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_SetAlive, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000031, "Member 'SourdropperRoundStatusMeeple_C_SetAlive::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function SourdropperRoundStatusMeeple.SourdropperRoundStatusMeeple_C.ProcessDeathAnimation
// 0x0010 (0x0010 - 0x0000)
struct SourdropperRoundStatusMeeple_C_ProcessDeathAnimation final
{
public:
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusMeeple_C_ProcessDeathAnimation) == 0x000004, "Wrong alignment on SourdropperRoundStatusMeeple_C_ProcessDeathAnimation");
static_assert(sizeof(SourdropperRoundStatusMeeple_C_ProcessDeathAnimation) == 0x000010, "Wrong size on SourdropperRoundStatusMeeple_C_ProcessDeathAnimation");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_ProcessDeathAnimation, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000000, "Member 'SourdropperRoundStatusMeeple_C_ProcessDeathAnimation::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_ProcessDeathAnimation, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'SourdropperRoundStatusMeeple_C_ProcessDeathAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_ProcessDeathAnimation, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'SourdropperRoundStatusMeeple_C_ProcessDeathAnimation::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_ProcessDeathAnimation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'SourdropperRoundStatusMeeple_C_ProcessDeathAnimation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function SourdropperRoundStatusMeeple.SourdropperRoundStatusMeeple_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SourdropperRoundStatusMeeple_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusMeeple_C_PreConstruct) == 0x000001, "Wrong alignment on SourdropperRoundStatusMeeple_C_PreConstruct");
static_assert(sizeof(SourdropperRoundStatusMeeple_C_PreConstruct) == 0x000001, "Wrong size on SourdropperRoundStatusMeeple_C_PreConstruct");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SourdropperRoundStatusMeeple_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SourdropperRoundStatusMeeple.SourdropperRoundStatusMeeple_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct SourdropperRoundStatusMeeple_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusMeeple_C_OnAnimationFinished) == 0x000008, "Wrong alignment on SourdropperRoundStatusMeeple_C_OnAnimationFinished");
static_assert(sizeof(SourdropperRoundStatusMeeple_C_OnAnimationFinished) == 0x000008, "Wrong size on SourdropperRoundStatusMeeple_C_OnAnimationFinished");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_OnAnimationFinished, Animation) == 0x000000, "Member 'SourdropperRoundStatusMeeple_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function SourdropperRoundStatusMeeple.SourdropperRoundStatusMeeple_C.GetColor
// 0x0074 (0x0074 - 0x0000)
struct SourdropperRoundStatusMeeple_C_GetColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DarkColor;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BrightColor;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MidBrightColor;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColor_bColorIsValid;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColor_bColorIsValid_1;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColor_bColorIsValid_2;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusMeeple_C_GetColor) == 0x000004, "Wrong alignment on SourdropperRoundStatusMeeple_C_GetColor");
static_assert(sizeof(SourdropperRoundStatusMeeple_C_GetColor) == 0x000074, "Wrong size on SourdropperRoundStatusMeeple_C_GetColor");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, Color) == 0x000000, "Member 'SourdropperRoundStatusMeeple_C_GetColor::Color' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, DarkColor) == 0x000010, "Member 'SourdropperRoundStatusMeeple_C_GetColor::DarkColor' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, BrightColor) == 0x000020, "Member 'SourdropperRoundStatusMeeple_C_GetColor::BrightColor' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, MidBrightColor) == 0x000030, "Member 'SourdropperRoundStatusMeeple_C_GetColor::MidBrightColor' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, CallFunc_GetColor_bColorIsValid) == 0x000040, "Member 'SourdropperRoundStatusMeeple_C_GetColor::CallFunc_GetColor_bColorIsValid' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, CallFunc_GetColor_bColorIsValid_1) == 0x000041, "Member 'SourdropperRoundStatusMeeple_C_GetColor::CallFunc_GetColor_bColorIsValid_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, CallFunc_GetColor_bColorIsValid_2) == 0x000042, "Member 'SourdropperRoundStatusMeeple_C_GetColor::CallFunc_GetColor_bColorIsValid_2' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000044, "Member 'SourdropperRoundStatusMeeple_C_GetColor::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, CallFunc_MapRangeClamped_ReturnValue) == 0x000048, "Member 'SourdropperRoundStatusMeeple_C_GetColor::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, CallFunc_MapRangeClamped_ReturnValue_1) == 0x00004C, "Member 'SourdropperRoundStatusMeeple_C_GetColor::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, CallFunc_LinearColorLerp_ReturnValue) == 0x000050, "Member 'SourdropperRoundStatusMeeple_C_GetColor::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, CallFunc_LinearColorLerp_ReturnValue_1) == 0x000060, "Member 'SourdropperRoundStatusMeeple_C_GetColor::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_GetColor, CallFunc_Less_FloatFloat_ReturnValue) == 0x000070, "Member 'SourdropperRoundStatusMeeple_C_GetColor::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function SourdropperRoundStatusMeeple.SourdropperRoundStatusMeeple_C.ExecuteUbergraph_SourdropperRoundStatusMeeple
// 0x0010 (0x0010 - 0x0000)
struct SourdropperRoundStatusMeeple_C_ExecuteUbergraph_SourdropperRoundStatusMeeple final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusMeeple_C_ExecuteUbergraph_SourdropperRoundStatusMeeple) == 0x000008, "Wrong alignment on SourdropperRoundStatusMeeple_C_ExecuteUbergraph_SourdropperRoundStatusMeeple");
static_assert(sizeof(SourdropperRoundStatusMeeple_C_ExecuteUbergraph_SourdropperRoundStatusMeeple) == 0x000010, "Wrong size on SourdropperRoundStatusMeeple_C_ExecuteUbergraph_SourdropperRoundStatusMeeple");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_ExecuteUbergraph_SourdropperRoundStatusMeeple, EntryPoint) == 0x000000, "Member 'SourdropperRoundStatusMeeple_C_ExecuteUbergraph_SourdropperRoundStatusMeeple::EntryPoint' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_ExecuteUbergraph_SourdropperRoundStatusMeeple, K2Node_Event_IsDesignTime) == 0x000004, "Member 'SourdropperRoundStatusMeeple_C_ExecuteUbergraph_SourdropperRoundStatusMeeple::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusMeeple_C_ExecuteUbergraph_SourdropperRoundStatusMeeple, K2Node_Event_Animation) == 0x000008, "Member 'SourdropperRoundStatusMeeple_C_ExecuteUbergraph_SourdropperRoundStatusMeeple::K2Node_Event_Animation' has a wrong offset!");

}

