#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SourdropperRoundStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function SourdropperRoundStatus.SourdropperRoundStatus_C.OnDisplayMinigameInProgressUI
// 0x0001 (0x0001 - 0x0000)
struct SourdropperRoundStatus_C_OnDisplayMinigameInProgressUI final
{
public:
	bool                                          bDisplay;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatus_C_OnDisplayMinigameInProgressUI) == 0x000001, "Wrong alignment on SourdropperRoundStatus_C_OnDisplayMinigameInProgressUI");
static_assert(sizeof(SourdropperRoundStatus_C_OnDisplayMinigameInProgressUI) == 0x000001, "Wrong size on SourdropperRoundStatus_C_OnDisplayMinigameInProgressUI");
static_assert(offsetof(SourdropperRoundStatus_C_OnDisplayMinigameInProgressUI, bDisplay) == 0x000000, "Member 'SourdropperRoundStatus_C_OnDisplayMinigameInProgressUI::bDisplay' has a wrong offset!");

// Function SourdropperRoundStatus.SourdropperRoundStatus_C.OnCurrentRoundChanged
// 0x0090 (0x0090 - 0x0000)
struct SourdropperRoundStatus_C_OnCurrentRoundChanged final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRound;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
};
static_assert(alignof(SourdropperRoundStatus_C_OnCurrentRoundChanged) == 0x000008, "Wrong alignment on SourdropperRoundStatus_C_OnCurrentRoundChanged");
static_assert(sizeof(SourdropperRoundStatus_C_OnCurrentRoundChanged) == 0x000090, "Wrong size on SourdropperRoundStatus_C_OnCurrentRoundChanged");
static_assert(offsetof(SourdropperRoundStatus_C_OnCurrentRoundChanged, Minigame) == 0x000000, "Member 'SourdropperRoundStatus_C_OnCurrentRoundChanged::Minigame' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_OnCurrentRoundChanged, CurrentRound) == 0x000008, "Member 'SourdropperRoundStatus_C_OnCurrentRoundChanged::CurrentRound' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_OnCurrentRoundChanged, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'SourdropperRoundStatus_C_OnCurrentRoundChanged::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_OnCurrentRoundChanged, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'SourdropperRoundStatus_C_OnCurrentRoundChanged::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_OnCurrentRoundChanged, K2Node_MakeArray_Array) == 0x000068, "Member 'SourdropperRoundStatus_C_OnCurrentRoundChanged::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_OnCurrentRoundChanged, CallFunc_Format_ReturnValue) == 0x000078, "Member 'SourdropperRoundStatus_C_OnCurrentRoundChanged::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function SourdropperRoundStatus.SourdropperRoundStatus_C.ExecuteUbergraph_SourdropperRoundStatus
// 0x0058 (0x0058 - 0x0000)
struct SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisplay;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthenaFromContext_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCuratedHub_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortMinigame* Minigame, int32 CurrentRound)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetHUDElementsToHide_ReturnValue;         // 0x0030(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus) == 0x000008, "Wrong alignment on SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus");
static_assert(sizeof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus) == 0x000058, "Wrong size on SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, EntryPoint) == 0x000000, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, K2Node_Event_bDisplay) == 0x000005, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::K2Node_Event_bDisplay' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, CallFunc_MakeLiteralByte_ReturnValue) == 0x000006, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, CallFunc_IsValid_ReturnValue_1) == 0x000007, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, CallFunc_GetGameStateAthenaFromContext_ReturnValue) == 0x000008, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::CallFunc_GetGameStateAthenaFromContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, CallFunc_IsCuratedHub_ReturnValue) == 0x000010, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::CallFunc_IsCuratedHub_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, CallFunc_IsValid_ReturnValue_2) == 0x000011, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, Temp_byte_Variable) == 0x000024, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, CallFunc_IsVisible_ReturnValue) == 0x000025, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, Temp_bool_Variable) == 0x000026, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, K2Node_Select_Default) == 0x000027, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000028, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, CallFunc_GetHUDElementsToHide_ReturnValue) == 0x000030, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::CallFunc_GetHUDElementsToHide_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus, CallFunc_HasAnyTags_ReturnValue) == 0x000050, "Member 'SourdropperRoundStatus_C_ExecuteUbergraph_SourdropperRoundStatus::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");

}

