#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SourdropperRoundStatusTeamStats

#include "Basic.hpp"

#include "E_SourdropperTeamStatsOrientation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function SourdropperRoundStatusTeamStats.SourdropperRoundStatusTeamStats_C.UpdateScoreText
// 0x0098 (0x0098 - 0x0000)
struct SourdropperRoundStatusTeamStats_C_UpdateScoreText final
{
public:
	class APawn*                                  ViewTargetPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BucketWinCount;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinigameScoreboardBucketRow           ScoreboardRow;                                     // 0x0010(0x0050)(Edit, BlueprintVisible)
	int32                                         Score;                                             // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBucketForPlayerState_ReturnValue;      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBucketWinCount_WinCount;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBucketWinCount_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0080(0x0018)()
};
static_assert(alignof(SourdropperRoundStatusTeamStats_C_UpdateScoreText) == 0x000008, "Wrong alignment on SourdropperRoundStatusTeamStats_C_UpdateScoreText");
static_assert(sizeof(SourdropperRoundStatusTeamStats_C_UpdateScoreText) == 0x000098, "Wrong size on SourdropperRoundStatusTeamStats_C_UpdateScoreText");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, ViewTargetPawn) == 0x000000, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::ViewTargetPawn' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, BucketWinCount) == 0x000008, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::BucketWinCount' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, ScoreboardRow) == 0x000010, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::ScoreboardRow' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, Score) == 0x000060, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::Score' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, CallFunc_IsValid_ReturnValue) == 0x000064, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, Temp_bool_Variable) == 0x000065, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, CallFunc_IsValid_ReturnValue_1) == 0x000066, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000067, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, CallFunc_GetBucketForPlayerState_ReturnValue) == 0x000068, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::CallFunc_GetBucketForPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, CallFunc_GetBucketWinCount_WinCount) == 0x00006C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::CallFunc_GetBucketWinCount_WinCount' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, CallFunc_GetBucketWinCount_ReturnValue) == 0x000070, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::CallFunc_GetBucketWinCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, CallFunc_Subtract_IntInt_ReturnValue) == 0x000074, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000078, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, K2Node_Select_Default) == 0x00007C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreText, CallFunc_Conv_IntToText_ReturnValue) == 0x000080, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function SourdropperRoundStatusTeamStats.SourdropperRoundStatusTeamStats_C.UpdateScoreImage
// 0x0078 (0x0078 - 0x0000)
struct SourdropperRoundStatusTeamStats_C_UpdateScoreImage final
{
public:
	struct FLinearColor                           RGBA2Color;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RGBA1Color;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SourdropperTeamStatsOrientation             Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SourdropperTeamStatsOrientation             Temp_byte_Variable_1;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColor_bColorIsValid;                   // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColor_bColorIsValid_1;                 // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage) == 0x000008, "Wrong alignment on SourdropperRoundStatusTeamStats_C_UpdateScoreImage");
static_assert(sizeof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage) == 0x000078, "Wrong size on SourdropperRoundStatusTeamStats_C_UpdateScoreImage");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, RGBA2Color) == 0x000000, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::RGBA2Color' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, RGBA1Color) == 0x000010, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::RGBA1Color' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, Temp_float_Variable) == 0x000020, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, Temp_float_Variable_1) == 0x000024, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, Temp_byte_Variable) == 0x000028, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, Temp_float_Variable_2) == 0x00002C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, Temp_float_Variable_3) == 0x000030, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, Temp_byte_Variable_1) == 0x000034, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, CallFunc_GetColor_bColorIsValid) == 0x000035, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::CallFunc_GetColor_bColorIsValid' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, CallFunc_GetColor_bColorIsValid_1) == 0x000036, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::CallFunc_GetColor_bColorIsValid_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, K2Node_Select_Default) == 0x000038, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, K2Node_Select_Default_1) == 0x00003C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, Temp_bool_Variable) == 0x000040, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, Temp_bool_Variable_1) == 0x000041, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, K2Node_Select_Default_2) == 0x000044, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, K2Node_Select_Default_3) == 0x000054, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000068, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateScoreImage, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'SourdropperRoundStatusTeamStats_C_UpdateScoreImage::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SourdropperRoundStatusTeamStats.SourdropperRoundStatusTeamStats_C.UpdateOrientation
// 0x0048 (0x0048 - 0x0000)
struct SourdropperRoundStatusTeamStats_C_UpdateOrientation final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USourdropperRoundStatusMeeple_C*        CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USourdropperRoundStatusMeeple_C*> K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USourdropperRoundStatusMeeple_C*> K2Node_MakeArray_Array_1;                          // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusTeamStats_C_UpdateOrientation) == 0x000008, "Wrong alignment on SourdropperRoundStatusTeamStats_C_UpdateOrientation");
static_assert(sizeof(SourdropperRoundStatusTeamStats_C_UpdateOrientation) == 0x000048, "Wrong size on SourdropperRoundStatusTeamStats_C_UpdateOrientation");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateOrientation, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SourdropperRoundStatusTeamStats_C_UpdateOrientation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateOrientation, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SourdropperRoundStatusTeamStats_C_UpdateOrientation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateOrientation, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SourdropperRoundStatusTeamStats_C_UpdateOrientation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateOrientation, CallFunc_Array_Get_Item) == 0x000010, "Member 'SourdropperRoundStatusTeamStats_C_UpdateOrientation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateOrientation, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'SourdropperRoundStatusTeamStats_C_UpdateOrientation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateOrientation, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateOrientation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateOrientation, K2Node_MakeArray_Array) == 0x000020, "Member 'SourdropperRoundStatusTeamStats_C_UpdateOrientation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateOrientation, K2Node_MakeArray_Array_1) == 0x000030, "Member 'SourdropperRoundStatusTeamStats_C_UpdateOrientation::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateOrientation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'SourdropperRoundStatusTeamStats_C_UpdateOrientation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function SourdropperRoundStatusTeamStats.SourdropperRoundStatusTeamStats_C.UpdateMeeples
// 0x00D0 (0x00D0 - 0x0000)
struct SourdropperRoundStatusTeamStats_C_UpdateMeeples final
{
public:
	class APawn*                                  ViewTargetPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSkipMeepleAnimations;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         MaxTeamSize;                                       // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AliveCount;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USourdropperRoundStatusMeeple_C*        MeepleWidget;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         OwningTeamIndex;                                   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USourdropperRoundStatusMeeple_C*        CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USourdropperRoundStatusMeeple_C*        CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMinigameTeam                          CallFunc_Array_Get_Item_2;                         // 0x0080(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTeamIndexRelevant_ReturnValue;          // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AF[0x1];                                       // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_BMax_ReturnValue;                         // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusTeamStats_C_UpdateMeeples) == 0x000008, "Wrong alignment on SourdropperRoundStatusTeamStats_C_UpdateMeeples");
static_assert(sizeof(SourdropperRoundStatusTeamStats_C_UpdateMeeples) == 0x0000D0, "Wrong size on SourdropperRoundStatusTeamStats_C_UpdateMeeples");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, ViewTargetPawn) == 0x000000, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::ViewTargetPawn' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, bSkipMeepleAnimations) == 0x000008, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::bSkipMeepleAnimations' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, MaxTeamSize) == 0x000009, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::MaxTeamSize' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, AliveCount) == 0x00000C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::AliveCount' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, MeepleWidget) == 0x000010, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::MeepleWidget' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, OwningTeamIndex) == 0x000018, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::OwningTeamIndex' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, Temp_int_Variable) == 0x00001C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_GetActorTeam_ReturnValue) == 0x000028, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, Temp_int_Array_Index_Variable) == 0x000034, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Add_IntInt_ReturnValue_2) == 0x00003C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_BreakVector2D_X) == 0x000040, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_BreakVector2D_Y) == 0x000044, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000048, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, Temp_bool_True_if_break_was_hit_Variable) == 0x000050, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00005C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_FMax_ReturnValue) == 0x000060, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, Temp_int_Array_Index_Variable_1) == 0x000064, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Array_Get_Item) == 0x000070, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000AC, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_IsTeamIndexRelevant_ReturnValue) == 0x0000AD, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_IsTeamIndexRelevant_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_BooleanAND_ReturnValue) == 0x0000AE, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0000B0, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_BMax_ReturnValue) == 0x0000B4, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_BMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B8, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000BC, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x0000C0, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000C4, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeeples, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000CC, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeeples::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function SourdropperRoundStatusTeamStats.SourdropperRoundStatusTeamStats_C.UpdateMeepleIcons
// 0x0020 (0x0020 - 0x0000)
struct SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USourdropperRoundStatusMeeple_C*        CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons) == 0x000008, "Wrong alignment on SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons");
static_assert(sizeof(SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons) == 0x000020, "Wrong size on SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons, CallFunc_Array_Get_Item) == 0x000010, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'SourdropperRoundStatusTeamStats_C_UpdateMeepleIcons::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SourdropperRoundStatusTeamStats.SourdropperRoundStatusTeamStats_C.Update
// 0x0030 (0x0030 - 0x0000)
struct SourdropperRoundStatusTeamStats_C_Update final
{
public:
	bool                                          bSkipMeepleAnimations_;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusTeamStats_C_Update) == 0x000008, "Wrong alignment on SourdropperRoundStatusTeamStats_C_Update");
static_assert(sizeof(SourdropperRoundStatusTeamStats_C_Update) == 0x000030, "Wrong size on SourdropperRoundStatusTeamStats_C_Update");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_Update, bSkipMeepleAnimations_) == 0x000000, "Member 'SourdropperRoundStatusTeamStats_C_Update::bSkipMeepleAnimations_' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_Update, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'SourdropperRoundStatusTeamStats_C_Update::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_Update, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'SourdropperRoundStatusTeamStats_C_Update::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_Update, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'SourdropperRoundStatusTeamStats_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_Update, K2Node_DynamicCast_AsPawn) == 0x000020, "Member 'SourdropperRoundStatusTeamStats_C_Update::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_Update, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SourdropperRoundStatusTeamStats_C_Update::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_Update, CallFunc_GetActorTeam_ReturnValue) == 0x000029, "Member 'SourdropperRoundStatusTeamStats_C_Update::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_Update, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002A, "Member 'SourdropperRoundStatusTeamStats_C_Update::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function SourdropperRoundStatusTeamStats.SourdropperRoundStatusTeamStats_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SourdropperRoundStatusTeamStats_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusTeamStats_C_PreConstruct) == 0x000001, "Wrong alignment on SourdropperRoundStatusTeamStats_C_PreConstruct");
static_assert(sizeof(SourdropperRoundStatusTeamStats_C_PreConstruct) == 0x000001, "Wrong size on SourdropperRoundStatusTeamStats_C_PreConstruct");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SourdropperRoundStatusTeamStats_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SourdropperRoundStatusTeamStats.SourdropperRoundStatusTeamStats_C.OnDisplayMinigameInProgressUI
// 0x0001 (0x0001 - 0x0000)
struct SourdropperRoundStatusTeamStats_C_OnDisplayMinigameInProgressUI final
{
public:
	bool                                          bDisplay;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusTeamStats_C_OnDisplayMinigameInProgressUI) == 0x000001, "Wrong alignment on SourdropperRoundStatusTeamStats_C_OnDisplayMinigameInProgressUI");
static_assert(sizeof(SourdropperRoundStatusTeamStats_C_OnDisplayMinigameInProgressUI) == 0x000001, "Wrong size on SourdropperRoundStatusTeamStats_C_OnDisplayMinigameInProgressUI");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_OnDisplayMinigameInProgressUI, bDisplay) == 0x000000, "Member 'SourdropperRoundStatusTeamStats_C_OnDisplayMinigameInProgressUI::bDisplay' has a wrong offset!");

// Function SourdropperRoundStatusTeamStats.SourdropperRoundStatusTeamStats_C.IsTeamIndexRelevant
// 0x000B (0x000B - 0x0000)
struct SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant final
{
public:
	uint8                                         TeamIndex;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         OwningTeamIndex;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         TeamSize;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant) == 0x000001, "Wrong alignment on SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant");
static_assert(sizeof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant) == 0x00000B, "Wrong size on SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant, TeamIndex) == 0x000000, "Member 'SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant::TeamIndex' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant, OwningTeamIndex) == 0x000001, "Member 'SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant::OwningTeamIndex' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant, TeamSize) == 0x000002, "Member 'SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant::TeamSize' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant, ReturnValue) == 0x000003, "Member 'SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant::ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant, Temp_bool_Variable) == 0x000004, "Member 'SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant, CallFunc_Greater_ByteByte_ReturnValue) == 0x000005, "Member 'SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000007, "Member 'SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000008, "Member 'SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant, K2Node_Select_Default) == 0x000009, "Member 'SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'SourdropperRoundStatusTeamStats_C_IsTeamIndexRelevant::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SourdropperRoundStatusTeamStats.SourdropperRoundStatusTeamStats_C.ExecuteUbergraph_SourdropperRoundStatusTeamStats
// 0x0038 (0x0038 - 0x0000)
struct SourdropperRoundStatusTeamStats_C_ExecuteUbergraph_SourdropperRoundStatusTeamStats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisplay;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusTeamStats_C_ExecuteUbergraph_SourdropperRoundStatusTeamStats) == 0x000008, "Wrong alignment on SourdropperRoundStatusTeamStats_C_ExecuteUbergraph_SourdropperRoundStatusTeamStats");
static_assert(sizeof(SourdropperRoundStatusTeamStats_C_ExecuteUbergraph_SourdropperRoundStatusTeamStats) == 0x000038, "Wrong size on SourdropperRoundStatusTeamStats_C_ExecuteUbergraph_SourdropperRoundStatusTeamStats");
static_assert(offsetof(SourdropperRoundStatusTeamStats_C_ExecuteUbergraph_SourdropperRoundStatusTeamStats, EntryPoint) == 0x000000, "Member 'SourdropperRoundStatusTeamStats_C_ExecuteUbergraph_SourdropperRoundStatusTeamStats::EntryPoint' has a wrong offset!");
