#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SourdropperRoundStatusFunctionLib

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function SourdropperRoundStatusFunctionLib.SourdropperRoundStatusFunctionLib_C.GetColor
// 0x0098 (0x0098 - 0x0000)
struct SourdropperRoundStatusFunctionLib_C_GetColor final
{
public:
	EFortTeamAffiliation                          TeamAffiliation;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSourDropperColorType                     ColorType;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCreativeSourDropperRoundStatusColorDataAsset* DataAsset;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OutColor;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bColorIsValid;                                     // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnColorIsValid;                                // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortSourDropperColorData              CallFunc_Map_Find_Value;                           // 0x0030(0x0050)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Map_Find_Value_1;                         // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SourdropperRoundStatusFunctionLib_C_GetColor) == 0x000008, "Wrong alignment on SourdropperRoundStatusFunctionLib_C_GetColor");
static_assert(sizeof(SourdropperRoundStatusFunctionLib_C_GetColor) == 0x000098, "Wrong size on SourdropperRoundStatusFunctionLib_C_GetColor");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, TeamAffiliation) == 0x000000, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::TeamAffiliation' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, ColorType) == 0x000001, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::ColorType' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, DataAsset) == 0x000008, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::DataAsset' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, OutColor) == 0x000010, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::OutColor' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, __WorldContext) == 0x000020, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::__WorldContext' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, bColorIsValid) == 0x000028, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::bColorIsValid' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, ReturnColorIsValid) == 0x000029, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::ReturnColorIsValid' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, CallFunc_IsValid_ReturnValue) == 0x00002A, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, CallFunc_Map_Find_Value) == 0x000030, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, CallFunc_Map_Find_Value_1) == 0x000084, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(SourdropperRoundStatusFunctionLib_C_GetColor, CallFunc_Map_Find_ReturnValue_1) == 0x000094, "Member 'SourdropperRoundStatusFunctionLib_C_GetColor::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

}

