#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreAlertToast

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreAlertToast.StoreAlertToast_C
// 0x0038 (0x02C0 - 0x0288)
class UStoreAlertToast_C final : public UStoreAlertWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFancyToastWidget_C*                    StoreToastWidget;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           TryToShowToast;                                    // 0x0298(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              AnimationStart;                                    // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              AnimationDone;                                     // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_StoreAlertToast(int32 EntryPoint);
	void DisplayStoreUpdated(class UStoreToastRequest* NewStoreUpdatedRequest);
	void BndEvt__StoreToastWidget_K2Node_ComponentBoundEvent_2_OnFinishedToast__DelegateSignature();
	void AttemptToShowToast();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreAlertToast_C">();
	}
	static class UStoreAlertToast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreAlertToast_C>();
	}
};
static_assert(alignof(UStoreAlertToast_C) == 0x000008, "Wrong alignment on UStoreAlertToast_C");
static_assert(sizeof(UStoreAlertToast_C) == 0x0002C0, "Wrong size on UStoreAlertToast_C");
static_assert(offsetof(UStoreAlertToast_C, UberGraphFrame) == 0x000288, "Member 'UStoreAlertToast_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreAlertToast_C, StoreToastWidget) == 0x000290, "Member 'UStoreAlertToast_C::StoreToastWidget' has a wrong offset!");
static_assert(offsetof(UStoreAlertToast_C, TryToShowToast) == 0x000298, "Member 'UStoreAlertToast_C::TryToShowToast' has a wrong offset!");
static_assert(offsetof(UStoreAlertToast_C, AnimationStart) == 0x0002A0, "Member 'UStoreAlertToast_C::AnimationStart' has a wrong offset!");
static_assert(offsetof(UStoreAlertToast_C, AnimationDone) == 0x0002B0, "Member 'UStoreAlertToast_C::AnimationDone' has a wrong offset!");

}

