#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwingingLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct SwingingLayerAnimBP.SwingingLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0347 (0x0348 - 0x0001)
struct SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_841;                                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_842;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_843;                                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_844;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_845;                                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_846;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_847;                                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_848;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_849;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_850;                                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_851;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_852;                                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_853;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_854;                                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_855;                                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_856;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_857;                                 // 0x0088(0x0010)()
	class FName                                   NameProperty_858;                                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_859;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_860;                                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_861;                                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_862;                                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_863;                                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_864;                                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_865;                                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_866;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_867;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_868;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_869;                                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_870;                                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_871;                                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_872;                                 // 0x0108(0x0010)()
	class UBlendSpace*                            ObjectProperty_873;                                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_874;                                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_875;                                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_876;                                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_877;                                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_878;                                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_879;                                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_880;                                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_881;                                 // 0x0158(0x0010)()
	TArray<float>                                 ArrayProperty_882;                                 // 0x0168(0x0010)()
	class UBlendSpace*                            ObjectProperty_883;                                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_884;                                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_885;                                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_886;                                // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_887;                                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_888;                                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_889;                                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_890;                                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_891;                                  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_892;                                 // 0x01C0(0x0010)()
	class FName                                   NameProperty_893;                                  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_894;                                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_895;                                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_896;                                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_897;                                  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_898;                                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          ObjectProperty_899;                                // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            ObjectProperty_900;                                // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             EnumProperty_901;                                  // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      EnumProperty_902;                                  // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_903;                                 // 0x0218(0x0010)()
	bool                                          BoolProperty_904;                                  // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_905;                                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          StructProperty_906;                                // 0x0230(0x002C)(NoDestructor)
	float                                         FloatProperty_907;                                 // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_908;                                // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_909;                                  // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_910;                                  // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_911;                                  // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26B[0x1];                                      // 0x026B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_912;                                  // 0x026C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_913;                                  // 0x0274(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_914;                                  // 0x027C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_915;                                  // 0x0284(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_916;                                // 0x0290(0x0020)(NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x02B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0330(0x0018)()
};
static_assert(alignof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000348, "Wrong size on SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_841) == 0x000004, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_841' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_842) == 0x000010, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_842' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_843) == 0x000018, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_843' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_844) == 0x000020, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_844' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_845) == 0x000028, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_845' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_846) == 0x000030, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_846' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_847) == 0x000038, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_847' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_848) == 0x000040, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_848' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_849) == 0x000048, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_849' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_850) == 0x000050, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_850' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_851) == 0x000058, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_851' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_852) == 0x000060, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_852' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_853) == 0x000068, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_853' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_854) == 0x000070, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_854' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_855) == 0x000078, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_855' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_856) == 0x000080, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_856' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_857) == 0x000088, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_857' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_858) == 0x000098, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_858' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_859) == 0x0000A0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_859' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_860) == 0x0000A8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_860' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_861) == 0x0000B0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_861' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_862) == 0x0000B8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_862' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_863) == 0x0000C0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_863' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_864) == 0x0000C8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_864' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_865) == 0x0000D0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_865' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_866) == 0x0000D8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_866' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_867) == 0x0000E0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_867' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_868) == 0x0000E8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_868' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_869) == 0x0000F0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_869' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_870) == 0x0000F8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_870' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_871) == 0x000100, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_871' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_872) == 0x000108, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_872' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_873) == 0x000118, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_873' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_874) == 0x000120, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_874' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_875) == 0x000128, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_875' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_876) == 0x000130, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_876' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_877) == 0x000138, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_877' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_878) == 0x000140, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_878' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_879) == 0x000148, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_879' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_880) == 0x000150, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_880' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_881) == 0x000158, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_881' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_882) == 0x000168, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_882' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_883) == 0x000178, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_883' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_884) == 0x000180, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_884' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_885) == 0x000188, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_885' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_886) == 0x000190, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_886' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_887) == 0x000198, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_887' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_888) == 0x0001A0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_888' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_889) == 0x0001A8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_889' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_890) == 0x0001B0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_890' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_891) == 0x0001B8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_891' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_892) == 0x0001C0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_892' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_893) == 0x0001D0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_893' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_894) == 0x0001D8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_894' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_895) == 0x0001E0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_895' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_896) == 0x0001E8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_896' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_897) == 0x0001F0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_897' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_898) == 0x0001F8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_898' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_899) == 0x000200, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_899' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_900) == 0x000208, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_900' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_901) == 0x000210, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_901' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_902) == 0x000211, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_902' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_903) == 0x000218, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_903' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_904) == 0x000228, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_904' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_905) == 0x00022C, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_905' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_906) == 0x000230, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_906' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_907) == 0x00025C, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_907' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_908) == 0x000260, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_908' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_909) == 0x000268, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_909' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_910) == 0x000269, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_910' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_911) == 0x00026A, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_911' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_912) == 0x00026C, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_912' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_913) == 0x000274, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_913' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_914) == 0x00027C, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_914' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_915) == 0x000284, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_915' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_916) == 0x000290, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_916' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0002B0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000330, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SwingingLayerAnimBP.SwingingLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x003F (0x0040 - 0x0001)
struct SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          BoolProperty;                                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_0;                                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_1;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_2;                                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_3;                                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_4;                                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_5;                                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_6;                                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_7;                                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_8;                                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_9;                                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_10;                                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_11;                                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_12;                                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_13;                                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_14;                                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_15;                                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_16;                                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_17;                                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_18;                                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000040, "Wrong size on SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData, BoolProperty) == 0x000001, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData::BoolProperty' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData, BoolProperty_0) == 0x000002, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData::BoolProperty_0' has a wrong offset!");
