#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: The_Golden_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass The_Golden_Skeleton_AnimBP.The_Golden_Skeleton_AnimBP_C
// 0x0930 (0x0EB0 - 0x0580)
class UThe_Golden_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0588(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0590(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0598(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x05B8(0x00C8)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0680(0x07F0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0E70(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0E90(0x0020)()

public:
	void ExecuteUbergraph_The_Golden_Skeleton_AnimBP(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"The_Golden_Skeleton_AnimBP_C">();
	}
	static class UThe_Golden_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThe_Golden_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UThe_Golden_Skeleton_AnimBP_C) == 0x000010, "Wrong alignment on UThe_Golden_Skeleton_AnimBP_C");
static_assert(sizeof(UThe_Golden_Skeleton_AnimBP_C) == 0x000EB0, "Wrong size on UThe_Golden_Skeleton_AnimBP_C");
static_assert(offsetof(UThe_Golden_Skeleton_AnimBP_C, UberGraphFrame) == 0x000580, "Member 'UThe_Golden_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UThe_Golden_Skeleton_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000588, "Member 'UThe_Golden_Skeleton_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UThe_Golden_Skeleton_AnimBP_C, AnimBlueprintExtension_Base) == 0x000590, "Member 'UThe_Golden_Skeleton_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UThe_Golden_Skeleton_AnimBP_C, AnimGraphNode_Root) == 0x000598, "Member 'UThe_Golden_Skeleton_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UThe_Golden_Skeleton_AnimBP_C, AnimGraphNode_SubInput) == 0x0005B8, "Member 'UThe_Golden_Skeleton_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UThe_Golden_Skeleton_AnimBP_C, AnimGraphNode_RigidBody) == 0x000680, "Member 'UThe_Golden_Skeleton_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UThe_Golden_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000E70, "Member 'UThe_Golden_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UThe_Golden_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000E90, "Member 'UThe_Golden_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");

}

