#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrickFeedView

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TrickFeedView.TrickFeedView_C.UpdateTrickStats
// 0x0018 (0x0018 - 0x0000)
struct TrickFeedView_C_UpdateTrickStats final
{
public:
	class FText                                   StatsText;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TrickFeedView_C_UpdateTrickStats) == 0x000008, "Wrong alignment on TrickFeedView_C_UpdateTrickStats");
static_assert(sizeof(TrickFeedView_C_UpdateTrickStats) == 0x000018, "Wrong size on TrickFeedView_C_UpdateTrickStats");
static_assert(offsetof(TrickFeedView_C_UpdateTrickStats, StatsText) == 0x000000, "Member 'TrickFeedView_C_UpdateTrickStats::StatsText' has a wrong offset!");

// Function TrickFeedView.TrickFeedView_C.UpdateScore
// 0x0010 (0x0010 - 0x0000)
struct TrickFeedView_C_UpdateScore final
{
public:
	class UFortVehicleTrickSet*                   TrickSet;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalScore_0;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrickFeedView_C_UpdateScore) == 0x000008, "Wrong alignment on TrickFeedView_C_UpdateScore");
static_assert(sizeof(TrickFeedView_C_UpdateScore) == 0x000010, "Wrong size on TrickFeedView_C_UpdateScore");
static_assert(offsetof(TrickFeedView_C_UpdateScore, TrickSet) == 0x000000, "Member 'TrickFeedView_C_UpdateScore::TrickSet' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_UpdateScore, TotalScore_0) == 0x000008, "Member 'TrickFeedView_C_UpdateScore::TotalScore_0' has a wrong offset!");

// Function TrickFeedView.TrickFeedView_C.UpdateMultiplier
// 0x0004 (0x0004 - 0x0000)
struct TrickFeedView_C_UpdateMultiplier final
{
public:
	int32                                         Multiplier_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrickFeedView_C_UpdateMultiplier) == 0x000004, "Wrong alignment on TrickFeedView_C_UpdateMultiplier");
static_assert(sizeof(TrickFeedView_C_UpdateMultiplier) == 0x000004, "Wrong size on TrickFeedView_C_UpdateMultiplier");
static_assert(offsetof(TrickFeedView_C_UpdateMultiplier, Multiplier_0) == 0x000000, "Member 'TrickFeedView_C_UpdateMultiplier::Multiplier_0' has a wrong offset!");

// Function TrickFeedView.TrickFeedView_C.ToggleCompleteStyle
// 0x0001 (0x0001 - 0x0000)
struct TrickFeedView_C_ToggleCompleteStyle final
{
public:
	bool                                          IsComplete;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrickFeedView_C_ToggleCompleteStyle) == 0x000001, "Wrong alignment on TrickFeedView_C_ToggleCompleteStyle");
static_assert(sizeof(TrickFeedView_C_ToggleCompleteStyle) == 0x000001, "Wrong size on TrickFeedView_C_ToggleCompleteStyle");
static_assert(offsetof(TrickFeedView_C_ToggleCompleteStyle, IsComplete) == 0x000000, "Member 'TrickFeedView_C_ToggleCompleteStyle::IsComplete' has a wrong offset!");

// Function TrickFeedView.TrickFeedView_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct TrickFeedView_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrickFeedView_C_PreConstruct) == 0x000001, "Wrong alignment on TrickFeedView_C_PreConstruct");
static_assert(sizeof(TrickFeedView_C_PreConstruct) == 0x000001, "Wrong size on TrickFeedView_C_PreConstruct");
static_assert(offsetof(TrickFeedView_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'TrickFeedView_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function TrickFeedView.TrickFeedView_C.GetCalloutText
// 0x0078 (0x0078 - 0x0000)
struct TrickFeedView_C_GetCalloutText final
{
public:
	class FText                                   Callout;                                           // 0x0000(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_Select_Default;                             // 0x0030(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_Select_Default_1;                           // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0060(0x0018)()
};
static_assert(alignof(TrickFeedView_C_GetCalloutText) == 0x000008, "Wrong alignment on TrickFeedView_C_GetCalloutText");
static_assert(sizeof(TrickFeedView_C_GetCalloutText) == 0x000078, "Wrong size on TrickFeedView_C_GetCalloutText");
static_assert(offsetof(TrickFeedView_C_GetCalloutText, Callout) == 0x000000, "Member 'TrickFeedView_C_GetCalloutText::Callout' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_GetCalloutText, Temp_bool_Variable) == 0x000018, "Member 'TrickFeedView_C_GetCalloutText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_GetCalloutText, Temp_bool_Variable_1) == 0x000019, "Member 'TrickFeedView_C_GetCalloutText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_GetCalloutText, K2Node_MakeArray_Array) == 0x000020, "Member 'TrickFeedView_C_GetCalloutText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_GetCalloutText, K2Node_Select_Default) == 0x000030, "Member 'TrickFeedView_C_GetCalloutText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_GetCalloutText, K2Node_Select_Default_1) == 0x000040, "Member 'TrickFeedView_C_GetCalloutText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_GetCalloutText, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'TrickFeedView_C_GetCalloutText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_GetCalloutText, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'TrickFeedView_C_GetCalloutText::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_GetCalloutText, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000058, "Member 'TrickFeedView_C_GetCalloutText::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_GetCalloutText, CallFunc_Array_Get_Item) == 0x000060, "Member 'TrickFeedView_C_GetCalloutText::CallFunc_Array_Get_Item' has a wrong offset!");

// Function TrickFeedView.TrickFeedView_C.FadeOutMusic
// 0x0001 (0x0001 - 0x0000)
struct TrickFeedView_C_FadeOutMusic final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrickFeedView_C_FadeOutMusic) == 0x000001, "Wrong alignment on TrickFeedView_C_FadeOutMusic");
static_assert(sizeof(TrickFeedView_C_FadeOutMusic) == 0x000001, "Wrong size on TrickFeedView_C_FadeOutMusic");
static_assert(offsetof(TrickFeedView_C_FadeOutMusic, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'TrickFeedView_C_FadeOutMusic::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TrickFeedView.TrickFeedView_C.ExecuteUbergraph_TrickFeedView
// 0x0470 (0x0470 - 0x0000)
struct TrickFeedView_C_ExecuteUbergraph_TrickFeedView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_TrickName;                            // 0x0068(0x0018)(ConstParm)
	class UUserWidget*                            CallFunc_BP_CreateEntry_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTrickEntry_C*                          K2Node_DynamicCast_AsTrick_Entry;                  // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortVehicleTrickSet*                   K2Node_Event_TrickSet;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TotalScore;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Multiplier;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0100(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0118(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0130(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0148(0x0018)()
	bool                                          Temp_bool_Variable_5;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0164(0x0014)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isCritical;                     // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x018C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x019C(0x0014)()
	class UObject*                                K2Node_Select_Default_2;                           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x01E0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0200(0x0058)(HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0288(0x0014)()
	bool                                          K2Node_CustomEvent_isComplete;                     // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Select_Default_5;                           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x02B0(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x02C4(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_6;                           // 0x02D8(0x0014)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_7;                           // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings_1;           // 0x02F8(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0318(0x0058)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x0373(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCalloutEntry_C*                        CallFunc_BP_CreateEntryOfClass_ReturnValue;        // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCalloutText_Callout;                   // 0x0380(0x0018)()
	class UCalloutEntry_C*                        K2Node_DynamicCast_AsCallout_Entry;                // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A2[0x2];                                      // 0x03A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x03A8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x03C0(0x0018)()
	class FText                                   K2Node_Event_StatsText;                            // 0x03D8(0x0018)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0408(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0420(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0458(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0468(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView) == 0x000008, "Wrong alignment on TrickFeedView_C_ExecuteUbergraph_TrickFeedView");
static_assert(sizeof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView) == 0x000470, "Wrong size on TrickFeedView_C_ExecuteUbergraph_TrickFeedView");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, EntryPoint) == 0x000000, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::EntryPoint' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_struct_Variable) == 0x000004, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_struct_Variable_1) == 0x00000C, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_bool_Variable) == 0x000014, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_struct_Variable_2) == 0x000018, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_struct_Variable_3) == 0x000028, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_bool_Variable_1) == 0x000038, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_bool_Variable_2) == 0x000039, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_object_Variable) == 0x000040, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_object_Variable_1) == 0x000048, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_bool_Variable_3) == 0x000050, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_bool_Variable_4) == 0x000051, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_object_Variable_2) == 0x000058, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_object_Variable_3) == 0x000060, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Event_TrickName) == 0x000068, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Event_TrickName' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_BP_CreateEntry_ReturnValue) == 0x000080, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_BP_CreateEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_DynamicCast_AsTrick_Entry) == 0x000088, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_DynamicCast_AsTrick_Entry' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Event_TrickSet) == 0x000098, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Event_TrickSet' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Event_TotalScore) == 0x0000A0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Event_TotalScore' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000A4, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Event_Multiplier) == 0x0000A8, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Event_Multiplier' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_MakeStruct_FormatArgumentData) == 0x0000B0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_MakeArray_Array) == 0x0000F0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_Format_ReturnValue) == 0x000100, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_MakeLiteralText_ReturnValue) == 0x000118, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000130, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000148, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_bool_Variable_5) == 0x000160, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_MakeStruct_SlateColor) == 0x000164, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000178, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_int_Variable) == 0x00017C, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_Not_PreBool_ReturnValue) == 0x000180, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_BooleanAND_ReturnValue) == 0x000181, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Event_IsDesignTime) == 0x000182, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_CustomEvent_isCritical) == 0x000183, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_CustomEvent_isCritical' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Select_Default) == 0x000184, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Select_Default_1) == 0x00018C, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_MakeStruct_SlateColor_1) == 0x00019C, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Select_Default_2) == 0x0001B0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_int_Variable_1) == 0x0001B8, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_PlayAnimation_ReturnValue) == 0x0001C0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_bool_Variable_6) == 0x0001C8, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Select_Default_3) == 0x0001CC, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_struct_Variable_4) == 0x0001D0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_MakeStruct_FontOutlineSettings) == 0x0001E0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_MakeStruct_FontOutlineSettings' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_MakeStruct_SlateFontInfo) == 0x000200, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_struct_Variable_5) == 0x000258, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_bool_Variable_7) == 0x000268, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_PlayAnimation_ReturnValue_1) == 0x000270, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Select_Default_4) == 0x000278, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_MakeStruct_SlateColor_2) == 0x000288, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_CustomEvent_isComplete) == 0x00029C, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_CustomEvent_isComplete' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_PlayAnimation_ReturnValue_2) == 0x0002A0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Select_Default_5) == 0x0002A8, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_MakeStruct_SlateColor_3) == 0x0002B0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_MakeStruct_SlateColor_4) == 0x0002C4, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Select_Default_6) == 0x0002D8, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_Add_IntInt_ReturnValue) == 0x0002EC, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Select_Default_7) == 0x0002F0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_byte_Variable) == 0x0002F4, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_MakeStruct_FontOutlineSettings_1) == 0x0002F8, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_MakeStruct_FontOutlineSettings_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_MakeStruct_SlateFontInfo_1) == 0x000318, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_byte_Variable_1) == 0x000370, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, Temp_bool_Variable_8) == 0x000371, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000372, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Select_Default_8) == 0x000373, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_BP_CreateEntryOfClass_ReturnValue) == 0x000378, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_BP_CreateEntryOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_GetCalloutText_Callout) == 0x000380, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_GetCalloutText_Callout' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_DynamicCast_AsCallout_Entry) == 0x000398, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_DynamicCast_AsCallout_Entry' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_DynamicCast_bSuccess_1) == 0x0003A0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_TextIsEmpty_ReturnValue) == 0x0003A1, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0003A4, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_MakeLiteralText_ReturnValue_3) == 0x0003A8, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_MakeLiteralText_ReturnValue_4) == 0x0003C0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_Event_StatsText) == 0x0003D8, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_Event_StatsText' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_PlayAnimation_ReturnValue_3) == 0x0003F0, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_Array_Length_ReturnValue) == 0x0003F8, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_Subtract_IntInt_ReturnValue) == 0x0003FC, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000400, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_Array_Get_Item) == 0x000408, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_TextToUpper_ReturnValue) == 0x000420, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_PlayAnimation_ReturnValue_4) == 0x000438, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_SpawnSound2D_ReturnValue) == 0x000440, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_PlayAnimation_ReturnValue_5) == 0x000448, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_PlayAnimation_ReturnValue_6) == 0x000450, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, K2Node_CreateDelegate_OutputDelegate) == 0x000458, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TrickFeedView_C_ExecuteUbergraph_TrickFeedView, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000468, "Member 'TrickFeedView_C_ExecuteUbergraph_TrickFeedView::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function TrickFeedView.TrickFeedView_C.CritStyleEvent
// 0x0001 (0x0001 - 0x0000)
struct TrickFeedView_C_CritStyleEvent final
{
public:
	bool                                          isCritical_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrickFeedView_C_CritStyleEvent) == 0x000001, "Wrong alignment on TrickFeedView_C_CritStyleEvent");
static_assert(sizeof(TrickFeedView_C_CritStyleEvent) == 0x000001, "Wrong size on TrickFeedView_C_CritStyleEvent");
static_assert(offsetof(TrickFeedView_C_CritStyleEvent, isCritical_0) == 0x000000, "Member 'TrickFeedView_C_CritStyleEvent::isCritical_0' has a wrong offset!");

// Function TrickFeedView.TrickFeedView_C.AddTrick
// 0x0018 (0x0018 - 0x0000)
struct TrickFeedView_C_AddTrick final
{
public:
	class FText                                   TrickName;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TrickFeedView_C_AddTrick) == 0x000008, "Wrong alignment on TrickFeedView_C_AddTrick");
static_assert(sizeof(TrickFeedView_C_AddTrick) == 0x000018, "Wrong size on TrickFeedView_C_AddTrick");
static_assert(offsetof(TrickFeedView_C_AddTrick, TrickName) == 0x000000, "Member 'TrickFeedView_C_AddTrick::TrickName' has a wrong offset!");

}

