#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XpMatchProgression

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass XpMatchProgression.XpMatchProgression_C
// 0x0050 (0x02C0 - 0x0270)
class UXpMatchProgression_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USmallLevelUpReward_C*                  LevelUpReward;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaPlayerLevel_C*                   PlayerLevelBar;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TotalScore;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TotalXp;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXpReasonFeed_C*                        XpReasonFeed;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FAthenaMatchXpReward>           XpRewards;                                         // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         XpRewardIndex;                                     // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayingLeveling;                                   // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPlayerMatchReport*               Report;                                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateRewardForLevel(int32 SeasonLevel);
	void TickRewardAnimation();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetPlayerState(class AFortPlayerControllerAthena* PlayerController, const struct FAthenaLevelInfo& AthenaLevelInfo);
	void Play_Xp_Rewards(class UAthenaPlayerMatchReport* Report_0);
	bool IsReadyForNextXpEvent();
	void Finished_Playing_Animation();
	void ExecuteUbergraph_XpMatchProgression(int32 EntryPoint);
	void Destruct();
	void BndEvt__PlayerLevelBar_K2Node_ComponentBoundEvent_3_LevelChanged__DelegateSignature(int32 Level);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"XpMatchProgression_C">();
	}
	static class UXpMatchProgression_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpMatchProgression_C>();
	}
};
static_assert(alignof(UXpMatchProgression_C) == 0x000008, "Wrong alignment on UXpMatchProgression_C");
static_assert(sizeof(UXpMatchProgression_C) == 0x0002C0, "Wrong size on UXpMatchProgression_C");
static_assert(offsetof(UXpMatchProgression_C, UberGraphFrame) == 0x000270, "Member 'UXpMatchProgression_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UXpMatchProgression_C, LevelUpReward) == 0x000278, "Member 'UXpMatchProgression_C::LevelUpReward' has a wrong offset!");
static_assert(offsetof(UXpMatchProgression_C, PlayerLevelBar) == 0x000280, "Member 'UXpMatchProgression_C::PlayerLevelBar' has a wrong offset!");
static_assert(offsetof(UXpMatchProgression_C, TotalScore) == 0x000288, "Member 'UXpMatchProgression_C::TotalScore' has a wrong offset!");
static_assert(offsetof(UXpMatchProgression_C, TotalXp) == 0x000290, "Member 'UXpMatchProgression_C::TotalXp' has a wrong offset!");
static_assert(offsetof(UXpMatchProgression_C, XpReasonFeed) == 0x000298, "Member 'UXpMatchProgression_C::XpReasonFeed' has a wrong offset!");
static_assert(offsetof(UXpMatchProgression_C, XpRewards) == 0x0002A0, "Member 'UXpMatchProgression_C::XpRewards' has a wrong offset!");
static_assert(offsetof(UXpMatchProgression_C, XpRewardIndex) == 0x0002B0, "Member 'UXpMatchProgression_C::XpRewardIndex' has a wrong offset!");
static_assert(offsetof(UXpMatchProgression_C, PlayingLeveling) == 0x0002B4, "Member 'UXpMatchProgression_C::PlayingLeveling' has a wrong offset!");
static_assert(offsetof(UXpMatchProgression_C, Report) == 0x0002B8, "Member 'UXpMatchProgression_C::Report' has a wrong offset!");

}

